{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[{"name":"READ"}]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"userId":34004016,"authorName":"Derek James","from":"Derek James &lt;blue5432@...&gt;","profile":"blue5432","replyTo":"LIST","senderId":"RyRKtMaGNX0bO_-THx3mMsJ4sYHa5v72iQpzXIopH58iLdyb_mFly07a0FiVHQPnZOQREO12p_LRS_FFiGCec82pGF58mzM","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Introduction","postDate":"1061766971","msgId":1,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDIwMDMwODI0MjMxNjExLjM1MDEwLnFtYWlsQHdlYjExMDAzLm1haWwueWFob28uY29tPg=="},"prevInTopic":0,"nextInTopic":2,"prevInTime":0,"nextInTime":2,"topicId":1,"numMessagesInTopic":5,"msgSnippet":"Welcome to the NEAT Users Yahoo Group. Presumably you re here either because you use NEAT or are interested in using NEAT (or you created NEAT). You already","rawEmail":"Return-Path: &lt;blue5432@...&gt;\r\nX-Sender: blue5432@...\r\nX-Apparently-To: neat@yahoogroups.com\r\nReceived: (qmail 46770 invoked from network); 24 Aug 2003 23:16:19 -0000\r\nReceived: from unknown (66.218.66.216)\n  by m15.grp.scd.yahoo.com with QMQP; 24 Aug 2003 23:16:18 -0000\r\nReceived: from unknown (HELO web11003.mail.yahoo.com) (216.136.131.53)\n  by mta1.grp.scd.yahoo.com with SMTP; 24 Aug 2003 23:16:16 -0000\r\nMessage-ID: &lt;20030824231611.35010.qmail@...&gt;\r\nReceived: from [12.241.81.158] by web11003.mail.yahoo.com via HTTP; Sun, 24 Aug 2003 16:16:11 PDT\r\nDate: Sun, 24 Aug 2003 16:16:11 -0700 (PDT)\r\nSubject: Introduction\r\nTo: neat@yahoogroups.com\r\nMIME-Version: 1.0\r\nContent-Type: text/plain; charset=us-ascii\r\nFrom: Derek James &lt;blue5432@...&gt;\r\nX-Yahoo-Group-Post: member; u=34004016\r\nX-Yahoo-Profile: blue5432\r\n\r\nWelcome to the NEAT Users Yahoo Group.\n\nPresumably you&#39;re here either because you use NEAT or\nare interested in using NEAT (or you created NEAT).\n\nYou already know the purpose of this group and list,\nbut I thought I&#39;d introduce myself and Philip Tucker,\nand give you an idea of how we got interested in NEAT,\nwhat we&#39;re doing right now, and where we&#39;re going.\n\nMy name is Derek James, and my background is not in\neither Artificial Intelligence or Computer Science. \nIt&#39;s in education.  I graduated from U.T. Austin in\n1993 with a B.A. in English and teacher certification\nin Math, Science, and English.  But I&#39;ve always\nconsidered AI an avocation, and I&#39;ve read extensively\non the subject since I was in high school.  Philip and\nI met at Baylor University in 1989, where he was\nworking on an undergraduate in CS.  He went on to get\na Master&#39;s, also in CS.\n\nWe&#39;ve been friends since then, and had discussions\nregarding AI, but never really took any steps to\nactively develop AI.  That changed last year.  Philip\nenrolled in an introductory neural network class here\nat the University of Texas at Dallas.  I audited the\nclass.  We met two other guys, one who was nearly\nfinished with a Master&#39;s in Cognitive Science from\nUTD, the other a developer who was working on AI in\nhis spare time.  The four of us started a bi-weekly\ndiscussion group centered around using neural networks\nand genetic algorithms.\n\nLike many AI researchers, our group discussed a\nvariety of domains, but we were primarily interested\nin the domain of classic board games, specifically Go.\n \n\nAround the end of 2002, I began to read published work\nin the field.  At one of the group member&#39;s urging, I\nread Fogel&#39;s book, Blondie24, regarding evolving ANNs\nwith fixed topologies as part of a Checkers-playing\nalgorithm.\n\nI read about the work done at UT Austin over the past\ndecade or so.  I read first about SANE, then found the\npaper on NEAT.  It was exactly the sort of approach I\nwas looking for.  I showed it to Philip, and we\ndecided that it was a technique we would be interested\nin experimenting with.\n\nWe looked at existing implementations of NEAT, but for\na variety of reasons we decided to implement our own\nversion.  It is built around two existing open-source\npackages:\n\nJOONE (Java Object-Oriented Neural Engine)\n\nhttp://www.jooneworld.com/index.html\n\nand JGAP (Java Genetic Algorithms Package)\n\nhttp://jgap.sourceforge.net/\nThere are a number of features in these packages,\nespecially JOONE, which we are not using in our\ninitial implementation, but which might be useful\nlater on.\n\n\nWe wanted to implement NEAT so that it would be easily\nadapted to a distributed computing environment (we\nbelieve that a high-input/output domain like Go will\nrequire such an environment).  We also wanted to\nimplement it so that it would run through a browser\ninterface.  This version will also persist a number of\ngraphical diagnostics, including graphical\nrepresentations of the evolved neural nets,\nevolutionary progress, etc., in the XML-based\ngraphical language, SVG.\n\nAs of this writing, the core NEAT engine is\nimplemented and working, though we have not\nincorporated speciation yet.  We have tested it so\nfar, without speciation, on XOR, and gotten it to\nconverge in multiple trials.  It will probably be a\nfew more months before we have a stable,\nfully-implemented version of NEAT, though.\n\nAt that time, we plan to initiate an open-source\nproject on SourceForge and make the source freely\navailable to anyone who is interested.  We would also\nlike to have two or three demo tasks available for our\nimplementation before we release it.\n\nAs far as our own research path, we would like to\nexplore competitive coevolutionary techniques,\nspecifically applied to game domains.  Our first game\ndomain will be Tic-Tac-Toe, and we hope to scale up to\nGoMoku (5-in-a-row on a 13x13 board), and then Go.  We\nalso hope to explore some form of indirect encoding to\nexploit the inherent symmetry in such game domains.\n\nSo that&#39;s who we are, where we&#39;re at right now, and\nwhere we hope to be in the near future.  If you join\nthe group, please consider introducing yourself\n(though you don&#39;t have to be as verbose as me) and\nletting the group know how you&#39;re either using NEAT or\nwould like to.\n\nThanks for joining, and we&#39;ll see you around... \n\n__________________________________\nDo you Yahoo!?\nYahoo! SiteBuilder - Free, easy-to-use web site design software\nhttp://sitebuilder.yahoo.com\n\n"}}