{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[{"name":"READ"}]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"userId":115403844,"authorName":"John Arrowwood","from":"&quot;John Arrowwood&quot; &lt;jarrowwx@...&gt;","profile":"jarrowwx","replyTo":"LIST","senderId":"Gm_bSTadiaIlBrt0tNb6JQVx8kmHNGj1cDvUvAO1-vL4voI2WrGW6UlfXRld7zeZnRX6YTmuJ5VPVxUEflXwuyEwXb7WqF-j5uRYCvpX","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [neat] Re: Bloat","postDate":"1086383683","msgId":1001,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEJBWTItRjEyN21PdFpwTGV3YzYwMDA0NDRiY0Bob3RtYWlsLmNvbT4="},"prevInTopic":1000,"nextInTopic":1002,"prevInTime":1000,"nextInTime":1002,"topicId":904,"numMessagesInTopic":68,"msgSnippet":"... That seems strange to me.  It seems to me like the more appropriate thing to do is to limit mutations to one structural change at a time.  You can add one","rawEmail":"Return-Path: &lt;jarrowwx@...&gt;\r\nX-Sender: jarrowwx@...\r\nX-Apparently-To: neat@yahoogroups.com\r\nReceived: (qmail 49651 invoked from network); 4 Jun 2004 21:14:55 -0000\r\nReceived: from unknown (66.218.66.216)\n  by m23.grp.scd.yahoo.com with QMQP; 4 Jun 2004 21:14:55 -0000\r\nReceived: from unknown (HELO hotmail.com) (65.54.247.127)\n  by mta1.grp.scd.yahoo.com with SMTP; 4 Jun 2004 21:14:55 -0000\r\nReceived: from mail pickup service by hotmail.com with Microsoft SMTPSVC;\n\t Fri, 4 Jun 2004 14:14:43 -0700\r\nReceived: from 64.122.44.102 by by2fd.bay2.hotmail.msn.com with HTTP;\n\tFri, 04 Jun 2004 21:14:43 GMT\r\nX-Originating-Email: [jarrowwx@...]\r\nX-Sender: jarrowwx@...\r\nTo: neat@yahoogroups.com\r\nBcc: \r\nDate: Fri, 04 Jun 2004 14:14:43 -0700\r\nMime-Version: 1.0\r\nContent-Type: text/plain; format=flowed\r\nMessage-ID: &lt;BAY2-F127mOtZpLewc6000444bc@...&gt;\r\nX-OriginalArrivalTime: 04 Jun 2004 21:14:43.0418 (UTC) FILETIME=[F4A4ABA0:01C44A78]\r\nX-eGroups-Remote-IP: 65.54.247.127\r\nFrom: &quot;John Arrowwood&quot; &lt;jarrowwx@...&gt;\r\nReply-To: john@...\r\nSubject: Re: [neat] Re: Bloat\r\nX-Yahoo-Group-Post: member; u=115403844\r\nX-Yahoo-Profile: jarrowwx\r\n\r\n&gt;From: Derek James &lt;djames@...&gt;\n&gt;\n&gt;On Fri, 04 Jun 2004 00:42:41 +0100, Colin Green &lt;cgreen@...&gt; \n&gt;wrote:\n&gt; &gt; Consider the problem from the other direction then. If all of of these\n&gt; &gt; useless structures aren&#39;t participating positively in a search (on the\n&gt; &gt; whole) then every single improvement seen in a population must come from\n&gt; &gt; immediately beneficial single mutations.\n&gt;\n&gt;Well, that&#39;s not entirely accurate.  In any new individual generated\n&gt;in NEAT, there could be a very large number of mutations at once.\n&gt;Many of its connection weights may be mutated at once, along with the\n&gt;addition (or subtraction) of a fairly large number of topological\n&gt;features.\n\nThat seems strange to me.  It seems to me like the more appropriate thing to \ndo is to limit mutations to one structural change at a time.  You can add \none connection, OR you can split one connection (or delete one \nconnection...), but you can&#39;t do any more than that for a given mutation of \na given organism.  Then, each and every change has a chance to prove itself \nbefore being added upon.\n\n&gt; &gt; So anyway, what I was proposing was a method of getting the best of both\n&gt; &gt; worlds. If excess structure is important then keep it, but if the search\n&gt; &gt; has stagnated for a period of time then I would say that the excess\n&gt; &gt; structures have now had plenty of time to prove themselves - and failed.\n&gt; &gt; They have crossed the line from being possible useful structures into\n&gt; &gt; being useless junk (bloat).\n&gt;\n&gt;It would be interesting to see if this view could be tested\n&gt;empirically.  It was my understanding that the philosophy of NEAT was\n&gt;essentially gradualist in its approach to adding structure, and that\n&gt;was part of the appeal of it to me.  It sounds as if you and Ken are\n&gt;both now arguing more for the approach of jumping, via allowing chunks\n&gt;of untested morphology to accumulate in the hope that they will\n&gt;eventually spontaneously contribute to increased fitness.\n\nI don&#39;t think that&#39;s what Ken was trying to say.\n\nPicture an experiment.  Focus on one species that is fairly well developed, \nbut stagnant.  During a generation, the top members breed or are mutated.  \nThe mutations add structure.  Some are helpful, maybe.  Some hinder.  Others \nare neutral.  Those that are a hindrence get selected against.  Those that \nhelp are selected for.  But in (this) stagnant population, few single \nmutations are by themselves helpful.  So a lot of the neutral mutations \nsurvive to the next generation.  They are now carrying something extra.  It \ndoesn&#39;t help.  It doesn&#39;t hinder.  It&#39;s just there.\n\nAt the next generation, the same thing happens.  Now, some portion of the \npopulation will not have any extra, some will have one extra, and others \nwill have two.  And others will be mixtures thereof.  If that isn&#39;t enough \nto cause a fitness jump, then the process happens again.  Again, some will \nhave no extra, some one extra, some two, some three, and many will be \nvariants thereof.  The more generations go by, the bigger the spectrum.  \nHowever, it will most likely be fairly evenly distributed between those \nwithout and those with extra neutral structure.\n\nAs that neutral structure is recombined through crossover, some will be a \nhindrence, and will die out.  Others might be helpful, and others neutral, \nsame as with mutation.  If no helpful ones are discovered, then neutral will \nremain.\n\nEventually, some combination may strike on a configuration that results in \nan improvement in fitness.  At that point, evolution will favor that \nconfiguration.  The stagnation will end.  The point is, to get there, you \nhad to add structure.  There&#39;s no assurance that all the &#39;extraneous&#39; \nstructure that accumulated will be useful, however.\n\nAs for the idea of pruning a stagnant species, that&#39;s not all that \ngood...when you start going forward again, you would undo your pruning as \nyou look for a way to move forward.  You would need to wait until the \nstagnant species has broken out of that stagnation, and THEN prune.  But I \nthink your best bet is to wait until you have found an acceptable solution, \nand then do a phase that supports pruning in order to optimize that \nsolution.\n\n\n\n"}}