{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[{"name":"READ"}]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"userId":127853030,"authorName":"Colin Green","from":"Colin Green &lt;cgreen@...&gt;","profile":"alienseedpod","replyTo":"LIST","senderId":"135nD-1CdjT9J3e2O-dcMAReTywn3qtp3qs9sUeNpRqloTcXg331OtTfPUXSpLjEZIaCikTmM0Lr4p1Do3jffiaAg3ZJ6ZXiww","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [neat] Re: Bloat","postDate":"1086555586","msgId":1007,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDQwQzM4NUMyLjEwMDA0MDFAZHNsLnBpcGV4LmNvbT4=","inReplyToHeader":"PDE5YjEwZDUxMDQwNjA0MTIzMjdhYmFhNTkwQG1haWwuZ21haWwuY29tPg==","referencesHeader":"PGM5bzFvYytpNTYzQGVHcm91cHMuY29tPiA8MTliMTBkNTEwNDA2MDMxNTIxMmUzNmY2MjlAbWFpbC5nbWFpbC5jb20+IDw0MEJGQjc3MS4xMDgwNEBkc2wucGlwZXguY29tPiA8MTliMTBkNTEwNDA2MDQxMjMyN2FiYWE1OTBAbWFpbC5nbWFpbC5jb20+"},"prevInTopic":1006,"nextInTopic":1008,"prevInTime":1006,"nextInTime":1008,"topicId":904,"numMessagesInTopic":68,"msgSnippet":"... I think most NEAT implementations perform only one structural mutation at a time. If you did two or more then there s a good chance that one of them would","rawEmail":"Return-Path: &lt;cgreen@...&gt;\r\nX-Sender: cgreen@...\r\nX-Apparently-To: neat@yahoogroups.com\r\nReceived: (qmail 3081 invoked from network); 6 Jun 2004 20:59:45 -0000\r\nReceived: from unknown (66.218.66.167)\n  by m21.grp.scd.yahoo.com with QMQP; 6 Jun 2004 20:59:45 -0000\r\nReceived: from unknown (HELO shockwave.systems.pipex.net) (62.241.160.9)\n  by mta6.grp.scd.yahoo.com with SMTP; 6 Jun 2004 20:59:45 -0000\r\nReceived: from dsl.pipex.com (81-86-175-101.dsl.pipex.com [81.86.175.101])\n\tby shockwave.systems.pipex.net (Postfix) with ESMTP id A58AC1C001FC\n\tfor &lt;neat@yahoogroups.com&gt;; Sun,  6 Jun 2004 21:59:42 +0100 (BST)\r\nMessage-ID: &lt;40C385C2.1000401@...&gt;\r\nDate: Sun, 06 Jun 2004 21:59:46 +0100\r\nUser-Agent: Mozilla/5.0 (Windows; U; Windows NT 5.1; en-US; rv:1.5) Gecko/20031007\r\nX-Accept-Language: en-us, en\r\nMIME-Version: 1.0\r\nTo: neat@yahoogroups.com\r\nReferences: &lt;c9o1oc+i563@...&gt; &lt;19b10d5104060315212e36f629@...&gt; &lt;40BFB771.10804@...&gt; &lt;19b10d5104060412327abaa590@...&gt;\r\nIn-Reply-To: &lt;19b10d5104060412327abaa590@...&gt;\r\nContent-Type: text/plain; charset=ISO-8859-1; format=flowed\r\nContent-Transfer-Encoding: 7bit\r\nX-eGroups-Remote-IP: 62.241.160.9\r\nFrom: Colin Green &lt;cgreen@...&gt;\r\nSubject: Re: [neat] Re: Bloat\r\nX-Yahoo-Group-Post: member; u=127853030\r\nX-Yahoo-Profile: alienseedpod\r\n\r\nDerek James wrote:\n\n&gt;On Fri, 04 Jun 2004 00:42:41 +0100, Colin Green &lt;cgreen@...&gt; wrote:\n&gt;  \n&gt;\n&gt;&gt;Consider the problem from the other direction then. If all of of these\n&gt;&gt;useless structures aren&#39;t participating positively in a search (on the\n&gt;&gt;whole) then every single improvement seen in a population must come from\n&gt;&gt;immediately beneficial single mutations. \n&gt;&gt;    \n&gt;&gt;\n&gt;\n&gt;Well, that&#39;s not entirely accurate.  In any new individual generated\n&gt;in NEAT, there could be a very large number of mutations at once. \n&gt;Many of its connection weights may be mutated at once, along with the\n&gt;addition (or subtraction) of a fairly large number of topological\n&gt;features.\n&gt;  \n&gt;\nI think most NEAT implementations perform only one structural mutation \nat a time. If you did two or more then there&#39;s a good chance that one of \nthem would be good but would get cancelled out by the deleterious effect \nof the others - I would expect most structural mutations to have such a \ndeleterious effect, and only a few to be neutral or beneficial. As for \nweight mutations, these *are* being done in large numbers at a time but \nI was really talking in the context of structural mutations, you don&#39;t \nnormally get bloat from weight mutations - well you might if the weights \nchange in such a way as to make some connections redundant (neutral).\n\n&gt;Thus, ten or twenty mutations at once might produce an increase in\n&gt;fitness, which is quite a bit different from benefit arising from a\n&gt;single mutation.  (Unless you&#39;re considering all of these events as a\n&gt;single mutation.)\n&gt;  \n&gt;\nBut it is highly unlikely that twenty random mutations will ever result \nin finding a beneficial structure because they are untested and \ntherefore they will mostly be deleterious. Performing single \n[structural] mutations and keeping the neutral ones around for the next \ngeneration is far more likely to find you a good series of mutations.\n\n&gt;  \n&gt;\n&gt;&gt;I&#39;m reminded of past arguments that creationists have used against\n&gt;&gt;evolution,  it goes something like - &quot;I can&#39;t see how some biological\n&gt;&gt;structures came about because they seem like too much of a jump, there\n&gt;&gt;doesn&#39;t seem to be any possible gradual evolutionary steps that produced\n&gt;&gt;certain structures. therefore they were designed.&quot;  \n&gt;&gt;    \n&gt;&gt;\n&gt;\n&gt;Hey...you aren&#39;t actually comparing me to a creationist, are you?  I\n&gt;might take offense at that. ;)\n&gt;  \n&gt;\n:) Just don&#39;t get me started on *that* one.\n\n&gt;&gt;I think this is\n&gt;&gt;because sometimes jumps are made, so e.g. a piece of  DNA that codes for\n&gt;&gt;a single protein might get accidentally copied into part of the genome\n&gt;&gt;that describes high-level morphology and instead of describing a protein\n&gt;&gt;it now describes, say, a vibration sensitive hair. \n&gt;&gt;    \n&gt;&gt;\n&gt;\n&gt;You&#39;re talking about a piece of genetic material that already encodes\n&gt;for something adaptive.  Which, again, is quite different from simply\n&gt;having a glob of *untested* morphology suddenly hooked up to the stuff\n&gt;around it and suddenly increasing the fitness of the organism.\n&gt;  \n&gt;\nAs Ken already pointed out, in the gene&#39;s new context it may as well be \na &#39;glob&#39; of junk. It is a protein sequence that got used in a totally \ndifferent context in which it&#39;s old meaning is completely lost. But it \nhappened to describe something useful when interpreted as high-level \nmorphology because biological systems use very flexible and forgiving \nrepresentation systems. So most of the base pairs would be ignored and \nwould still be junk in the new context, and most of what isn&#39;t ignored \nwould probably describe junk in the phenotype, but that new structure in \nthe phenotype included a hair attached to a nerve and could therefore \ndetect sound. Natural selection can then remove all of the new junk in \nthe phenotype and refine the hair, but a lot of junk would probably \nremain in the DNA.\n\nNow I realise that some may think that I&#39;ve argued myself into a corner \nhere, since this could be interpreted to be the opposite of my above \nargument about multiple mutations being very unlikely to be good. But as \nI say, I think this only works in biology because of the flexible \nrepresentation system(s). Since we have a rigid rep. system (in NEAT) \nit&#39;s far more efficient to add structure incrementaly and to allow for \n&#39;jumps&#39; in functionality by allowing neutral structure to accumulate.\n\n&gt;&gt;So anyway, what I was proposing was a method of getting the best of both\n&gt;&gt;worlds. If excess structure is important then keep it, but if the search\n&gt;&gt;has stagnated for a period of time then I would say that the excess\n&gt;&gt;structures have now had plenty of time to prove themselves - and failed.\n&gt;&gt;They have crossed the line from being possible useful structures into\n&gt;&gt;being useless junk (bloat). \n&gt;&gt;    \n&gt;&gt;\n&gt;\n&gt;It would be interesting to see if this view could be tested\n&gt;empirically.  It was my understanding that the philosophy of NEAT was\n&gt;essentially gradualist in its approach to adding structure, and that\n&gt;was part of the appeal of it to me.  It sounds as if you and Ken are\n&gt;both now arguing more for the approach of jumping, via allowing chunks\n&gt;of untested morphology to accumulate in the hope that they will\n&gt;eventually spontaneously contribute to increased fitness.\n&gt;\n&gt;  \n&gt;\nI think Ken and other have covered this, I would just like to copy in a \nparagraph from John though...\n\n&gt;As for the idea of pruning a stagnant species, that&#39;s not all that \n&gt;good...when you start going forward again, you would undo your pruning as \n&gt;you look for a way to move forward.  You would need to wait until the \n&gt;stagnant species has broken out of that stagnation, and THEN prune.  But I \n&gt;think your best bet is to wait until you have found an acceptable solution, \n&gt;and then do a phase that supports pruning in order to optimize that \n&gt;solution.\n&gt;\n\nYes that makes more sense :)  So if some of the neutral structure \nbecomes positive then you have moved into a new and better position in \nthe overall search space, this warrants searching around that space for \na while, but! you are still likely to have some of the neutral structure \nthat didn&#39;t become positive. This means you are searching through a \nhigher search dimensionality than you really should be - you have found \na new promising point in the search space so you don&#39;t really want that \nspeculative neutral structure, not until you start to stagnate again. \nTherefore I think it would be a refinement of the NEAT search process to \nprune neutral structure from the genomes at that point.\n\nColin\n\n\n"}}