{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[{"name":"READ"}]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"userId":54567749,"authorName":"Kenneth Stanley","from":"&quot;Kenneth Stanley&quot; &lt;kstanley@...&gt;","profile":"kenstanley01","replyTo":"LIST","senderId":"iSgSPYX4UDQOPrv1mf09Geb1NilTrra6URPbLmJVMrQu19dfhiTcGsG82vlyeNvCWWRanXQGTlbz7mPkgsRVSnecQPY4gIagbcVEWNNNn_A1","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: Bloat","postDate":"1086636423","msgId":1017,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGNhMmZpNys4dm5nQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDE5YjEwZDUxMDQwNjA3MTA0ODcxNDQyNDQ1QG1haWwuZ21haWwuY29tPg=="},"prevInTopic":1016,"nextInTopic":1020,"prevInTime":1016,"nextInTime":1018,"topicId":904,"numMessagesInTopic":68,"msgSnippet":"... diversity ... survive. ... this ... to ... You know I have to admit the paragraph could have been phrased better.  The idea is that in the limit (over a","rawEmail":"Return-Path: &lt;kstanley@...&gt;\r\nX-Sender: kstanley@...\r\nX-Apparently-To: neat@yahoogroups.com\r\nReceived: (qmail 86605 invoked from network); 7 Jun 2004 19:29:07 -0000\r\nReceived: from unknown (66.218.66.166)\n  by m24.grp.scd.yahoo.com with QMQP; 7 Jun 2004 19:29:07 -0000\r\nReceived: from unknown (HELO n11.grp.scd.yahoo.com) (66.218.66.66)\n  by mta5.grp.scd.yahoo.com with SMTP; 7 Jun 2004 19:29:07 -0000\r\nReceived: from [66.218.67.248] by n11.grp.scd.yahoo.com with NNFMP; 07 Jun 2004 19:27:04 -0000\r\nDate: Mon, 07 Jun 2004 19:27:03 -0000\r\nTo: neat@yahoogroups.com\r\nMessage-ID: &lt;ca2fi7+8vng@...&gt;\r\nIn-Reply-To: &lt;19b10d51040607104871442445@...&gt;\r\nUser-Agent: eGroups-EW/0.82\r\nMIME-Version: 1.0\r\nContent-Type: text/plain; charset=ISO-8859-1\r\nContent-Length: 4790\r\nX-Mailer: Yahoo Groups Message Poster\r\nX-eGroups-Remote-IP: 66.218.66.66\r\nFrom: &quot;Kenneth Stanley&quot; &lt;kstanley@...&gt;\r\nSubject: Re: Bloat\r\nX-Yahoo-Group-Post: member; u=54567749\r\nX-Yahoo-Profile: kenstanley01\r\n\r\n--- In neat@yahoogroups.com, Derek James &lt;djames@g...&gt; wrote:\n&gt; The section on Minimizing Dimensionality in the paper &quot;Efficient\n&gt; Evolution of Neural Network Topologies says this:\n&gt; \n&gt; &quot;TWEANN algorithms typically start with an initial population\n&gt; of random topologies [2, 7, 21, 22]. Such topological\n&gt; diversity must be introduced from the start because new structure\n&gt; frequently does not survive in these methods, which do\n&gt; not protect innovation. However, it is not clear that such \ndiversity\n&gt; is necessary or useful. A population of random topologies\n&gt; has a great deal of structure that has not withstood a single\n&gt; Fitness evaluation. Therefore, there is no way to know if\n&gt; any of such structure is necessary. It is costly though because\n&gt; the more connections a network contains, the higher the number\n&gt; of dimensions that need to be searched to optimize the\n&gt; network. Therefore, with random topologies the algorithm\n&gt; may waste a lot of effort by optimizing unnecessarily complex\n&gt; structures.\n&gt; In contrast, NEAT begins with a uniform population of networks\n&gt; with no hidden nodes. Because NEAT protects innovation\n&gt; using speciation, it can start this way, minimally, and\n&gt; grow new structure only as necessary. New structure is introduced\n&gt; incrementally as structural mutations occur, and only\n&gt; those structures survive that are found to be useful through\n&gt; Fitness evaluations. This way, NEAT searches through a minimal\n&gt; number of weight dimensions, significantly reducing the\n&gt; number of generations necessary to find a solution.&quot; \n&gt; \n&gt; You talk about starting minimally and only adding structure that is\n&gt; &quot;useful&quot; or &quot;necessary&quot;...not &quot;neutral&quot; structure.\n&gt; \n&gt; You say only those structures that are found to be *useful* \nsurvive. \n&gt; But that&#39;s not necessarily true, according to the discussion on \nthis\n&gt; list.  At least, they are not useful in the sense of contributing \nto\n&gt; the fitness of an individual.  If you mean neutral in terms of\n&gt; affecting the fitness of an individual, but useful in terms of\n&gt; providing building blocks for later innovations, fine.  But that&#39;s\n&gt; definitely not clear from the literature, and in fact seems a bit\n&gt; contradictory.\n&gt; \n\nYou know I have to admit the paragraph could have been phrased \nbetter.  The idea is that in the limit (over a long period of \ngenerations) for the most part only the useful innovations survive.  \nOf course there is always a chance something might survive that \ndidn&#39;t do well but that would be a fluke of stochasticity.  \n\nBut yes I think neutral additions are useful in a number of \nsituations.    Note that neutral mutations are totally different \nfrom random structure in the initial population that haven&#39;t \nwithstood a single fitness evaluation, since in general, neutral \nadditions that persist have withstood many fitness evaluations.\n\n&gt; &gt; -&quot;Not contributing to fitness&quot; is different than &quot;reducing\n&gt; &gt; fitness.&quot;  You are using these terms interchangeably.  \n&gt; \n&gt; No, I don&#39;t think I did.  I think I&#39;ve been fairly careful about\n&gt; distinguishing between &quot;neutral&quot; structure and structure which \neither\n&gt; helps or hurts fitness.  I&#39;ve used words like &quot;superflous&quot; and\n&gt; &quot;unnecessary&quot;, but this is not the same as saying such structure is\n&gt; maladaptive.\n&gt; \n&gt; &gt; If I am\n&gt; &gt; stagnating and I manage to add structure that does not reduce\n&gt; &gt; fitness, that is a good thing, not a bad thing, because I&#39;m\n&gt; &gt; increasing my range of candidate spaces.\n&gt; \n&gt; But it increases the search space and slows down network \nactivation. \n&gt; And if the payoffs down the road aren&#39;t worth the extra expense, \nthen\n&gt; it *is* a bad thing.  I don&#39;t think it is necessarily true that the\n&gt; retention of neutral structure is preferrable...I&#39;m not sure it&#39;s\n&gt; intuitive.  As I&#39;ve mentioned before, there are other possible\n&gt; explanations for jumps out of stagnation.\n&gt; \n&gt; My inclination, in general, is to try to keep the search as tight \nand\n&gt; lean as possible, and to try to deal with stagnation from the \nfitness\n&gt; function side (i.e., attempt to insure a smoother fitness \ngradient).\n&gt; \n&gt; &gt; The point with NEAT is that we are trying to get access to good\n&gt; &gt; parts of high-dimensional space.  To say that increasing\n&gt; &gt; dimensionality is flat out bad is a generalization.  \n&gt; \n&gt; Well, I wasn&#39;t arguing that point.  I think without proportional \ngains\n&gt; in the performance of the algorithm it&#39;s bad policy, because there\n&gt; definitely is a cost associated with increasing the dimensionality.\n&gt; \n\nMaybe your thinking is affected by the way you were doing large \nnumbers of additions at one time.  I think if you think of NEAT the \nway I implemented it, with very slow growth one piece at a time, you \ncan start to see the slowly piecing together neutral structure in \nthis way is a good idea if you are stagnating.\n\nken\n\n\n"}}