{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[{"name":"READ"}]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"userId":54567749,"authorName":"Kenneth Stanley","from":"&quot;Kenneth Stanley&quot; &lt;kstanley@...&gt;","profile":"kenstanley01","replyTo":"LIST","senderId":"aXiuzv8mqrAn2m4kUhJ286HZr-Zjd2YuJ0Euq5ouzmaHvesYg0-QIWSBiX0N-aChdKysAFhc28mV1vhE0jYx7U6JhmcwVBG9XHd2TtGzE3N_","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: Interesting article","postDate":"1065050161","msgId":105,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGJsZm43aCthM2NhQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDIwMDMwOTMwMTYxMjIzLjM2ODg0LnFtYWlsQHdlYjExMDAzLm1haWwueWFob28uY29tPg=="},"prevInTopic":104,"nextInTopic":106,"prevInTime":104,"nextInTime":106,"topicId":102,"numMessagesInTopic":26,"msgSnippet":"... dealing with AI. ... fundamentally conceptually flawed, and that these flaws often stem from an oversimplification of the meaning of intelligence and/or","rawEmail":"Return-Path: &lt;kstanley@...&gt;\r\nX-Sender: kstanley@...\r\nX-Apparently-To: neat@yahoogroups.com\r\nReceived: (qmail 24786 invoked from network); 1 Oct 2003 23:16:02 -0000\r\nReceived: from unknown (66.218.66.217)\n  by m11.grp.scd.yahoo.com with QMQP; 1 Oct 2003 23:16:02 -0000\r\nReceived: from unknown (HELO n33.grp.scd.yahoo.com) (66.218.66.101)\n  by mta2.grp.scd.yahoo.com with SMTP; 1 Oct 2003 23:16:02 -0000\r\nReceived: from [66.218.67.187] by n33.grp.scd.yahoo.com with NNFMP; 01 Oct 2003 23:16:01 -0000\r\nDate: Wed, 01 Oct 2003 23:16:01 -0000\r\nTo: neat@yahoogroups.com\r\nSubject: Re: Interesting article\r\nMessage-ID: &lt;blfn7h+a3ca@...&gt;\r\nIn-Reply-To: &lt;20030930161223.36884.qmail@...&gt;\r\nUser-Agent: eGroups-EW/0.82\r\nMIME-Version: 1.0\r\nContent-Type: text/plain; charset=ISO-8859-1\r\nContent-Length: 5160\r\nX-Mailer: Yahoo Groups Message Poster\r\nFrom: &quot;Kenneth Stanley&quot; &lt;kstanley@...&gt;\r\nX-Yahoo-Group-Post: member; u=54567749\r\nX-Yahoo-Profile: kenstanley01\r\n\r\n--- In neat@yahoogroups.com, Derek James &lt;blue5432@y...&gt; wrote:\n&gt; This isn&#39;t specific to NEAT, but I found this article on the flaws \nof various AI approaches interesting:\n&gt; \n&gt; http://www.generation5.org/content/2003/Why_AI_is_hard.asp\n&gt; It&#39;s at Generation 5, a Slashdot-type site dedicated to articles \ndealing with AI.\n&gt; \n&gt; Anyway, I agree with the author that much of AI research is \nfundamentally conceptually flawed, and that these flaws often stem \nfrom an oversimplification of the meaning of &quot;intelligence&quot; \nand/or &quot;intelligent behavior&quot;.\n&gt; \n&gt; But this rubbed me the wrong way:\n&gt; \n&gt; I think that there is a further factor involved in this wishful \nthinking: intelligence as I defined is really a huge collection of \nintelligent behaviors leading many researchers to become overwhelmed \nand turn to hoping that an &quot;emergent intelligence&quot; will\nspring like \na phoenix from their work.  This is often combined with what I \nterm &quot;more-thinking&quot;: the hope that more speed, more\nconnections, \nmore rules, more memory, etc., will cause disappointing results to \ntransform into success.  This can be seen in followers of:  genetic \nalgorithm (GA), artificial neural net (ANN), Bayesian reasoning, \ncase based reasoning, etc.  The typical cycle observed by those in \nthis field for the last couple of decades is: first a great deal of \nexcitement surrounding initial experiments, then grandiose \nprojections of further success, subsequent lack of further progress, \nand eventual lapsing into the belief that more resources will lead \nto success.And this:The current GA work largely ignores the \ncomplexity\n&gt;  required of the environment and fitness test for a meaningful \napplication of the method (of which there has not been one to \ndate).  These constraints dictate the possible outcomes of any GA \nprocess, which is merely shifting the difficult work from designing \nthe processing algorithms to designing the environment and fitness \nalgorithms.  Natural evolutionary process occurs in our complete \nenvironment.  Similar results are not likely unless a similar \nenvironment is modeled.  This is truly wishful thinking.Obviously I \nthink he&#39;s wrong, and I&#39;d guess many here do as well, so I&#39;m \ninterested in what you guys think about what he says.\n&gt; \n\nHi Derek, I will try to respond to this author&#39;s &quot;controversial&quot; \narticle.  I read the whole thing so I will write in general about \neverything he said, rather than just responding to the above quotes.\n\nThe author is trying to be controversial, to raise some objections, \nshake the boat a little.  But the article just sounds like the same \nold thing to me.  In fact, it sounds remarkably similar to the \npeople the author is criticizing- those who are supposedly set in \ntheir close-minded ways.  After all, the author is essentially \nadvocating a multi-pronged, modular approach, in which lots \nof &quot;tools&quot; are used together to produce the final product.  \n\nThe funny thing is, that is the same old-fashioned way of thinking \nthat has long been motivating AI researchers:  this idea that some \nhodge-podge &quot;toolbox&quot; will be cobbled together out of 500 different \nand totally incompatible algorithms and data structures.  And then \nsuddenly we&#39;ll have a brain.  What&#39;s new here?  The author claims \nthat some people tend to specialize too much.  Fair enough, but we \nall know that the &quot;visionaries,&quot; like the author, ultimately believe \nall these specialized notions might be pieced together eventually.\n\nBut no one has the faintest idea how this might happen.  So saying \nthat it *should* happen hardly adds any value to the equation.\n\nHere is an alternative plan: Creating a brain is an instance of the \ngeneral class of problems of efficiently creating extremely complex \nstructures (i.e. over 1 trillion parts; the brain has 100 trillion \nconnections).  Efficiency is the key because if you spent even just \n1 second considering each of those trillion pieces, you&#39;d spend \nabout 31,000 years to put the solution together.  So, let them try, \npiece by piece.  In the meantime, let&#39;s find the fundamental \nprinciples behind generating complexity.  For example: it is easier \nto search first in a small space and then expand the space than it \nis to search starting directly in a larger space.  And, if a massive \ncomplex structure includes parts that are reused, then those reused \nparts should only be encoded *once* in the description of the \nsolution.  There are probably a lot of other principles.  But you \nget my point: Let&#39;s find all the principles that allow us to both \nsearch and represent extreme complexity, and then apply those \nprinciples en masse to our massive problem, thus shaving off \nthousands of years of human effort or computation. \n\nIt probably won&#39;t be enough- we&#39;ll probably then have to actually \nengineer some of the products of our principles to enhance and \nexpand them further at certain points- a field which doesn&#39;t even \nexist yet.  \n\nBut the funny thing is, you may notice, I never mentioned NN&#39;s or \nGA&#39;s, but if you like my plan, you can&#39;t help but think, hmm NN&#39;s \nand GA&#39;s sound like what I&#39;m talking about.  Now the question is, \nwhose plan is actually new?\n\nken\n\n\n"}}