{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[{"name":"READ"}]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"userId":115403844,"authorName":"John Arrowwood","from":"&quot;John Arrowwood&quot; &lt;jarrowwx@...&gt;","profile":"jarrowwx","replyTo":"LIST","senderId":"IimmjbUOJrX1AAJK2mdXWkGWJ6cecT9um-tsKmHL7yEE729-L6WiMepFqvQTxJ5Nnd5pCIlnxq8Bs_SWZq5JLcuCug3jQvzvaia0nH3-","spamInfo":{"isSpam":false,"reason":"0"},"subject":"RE: [neat] Re: Stephen Thaler","postDate":"1091211685","msgId":1294,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEJBWTItRjI1dWR6eHhmWVhGcncwMDA0NDRiYUBob3RtYWlsLmNvbT4="},"prevInTopic":1288,"nextInTopic":0,"prevInTime":1293,"nextInTime":1295,"topicId":1257,"numMessagesInTopic":9,"msgSnippet":"... Depends. ... For the robot, no.  For the creativity machine, yes. ... For the creativity machine?  To find valid but untried combinations.  To be creative.","rawEmail":"Return-Path: &lt;jarrowwx@...&gt;\r\nX-Sender: jarrowwx@...\r\nX-Apparently-To: neat@yahoogroups.com\r\nReceived: (qmail 43899 invoked from network); 30 Jul 2004 18:21:27 -0000\r\nReceived: from unknown (66.218.66.218)\n  by m17.grp.scd.yahoo.com with QMQP; 30 Jul 2004 18:21:27 -0000\r\nReceived: from unknown (HELO hotmail.com) (65.54.247.25)\n  by mta3.grp.scd.yahoo.com with SMTP; 30 Jul 2004 18:21:27 -0000\r\nReceived: from mail pickup service by hotmail.com with Microsoft SMTPSVC;\n\t Fri, 30 Jul 2004 11:21:25 -0700\r\nReceived: from 64.122.44.102 by by2fd.bay2.hotmail.msn.com with HTTP;\n\tFri, 30 Jul 2004 18:21:25 GMT\r\nX-Originating-Email: [jarrowwx@...]\r\nX-Sender: jarrowwx@...\r\nTo: neat@yahoogroups.com\r\nBcc: \r\nDate: Fri, 30 Jul 2004 11:21:25 -0700\r\nMime-Version: 1.0\r\nContent-Type: text/plain; format=flowed\r\nMessage-ID: &lt;BAY2-F25udzxxfYXFrw000444ba@...&gt;\r\nX-OriginalArrivalTime: 30 Jul 2004 18:21:25.0519 (UTC) FILETIME=[062531F0:01C47662]\r\nX-eGroups-Remote-IP: 65.54.247.25\r\nFrom: &quot;John Arrowwood&quot; &lt;jarrowwx@...&gt;\r\nReply-To: john@...\r\nSubject: RE: [neat] Re: Stephen Thaler\r\nX-Yahoo-Group-Post: member; u=115403844\r\nX-Yahoo-Profile: jarrowwx\r\n\r\n&gt;From: &quot;Kenneth Stanley&quot; &lt;kstanley@...&gt;\n&gt;\n&gt;--- In neat@yahoogroups.com, &quot;John Arrowwood&quot; &lt;jarrowwx@h...&gt; wrote:\n&gt; &gt; &gt;From: &quot;Kenneth Stanley&quot; &lt;kstanley@c...&gt;\n&gt; &gt; &gt;\n&gt; &gt; &gt;So I am just wondering how Thaler&#39;s thing differs from hill\n&gt; &gt; &gt;climbing?\n&gt; &gt;\n&gt; &gt; As far as I have gathered, it isn&#39;t.  But because he is climbing\n&gt; &gt; the CURRENT hill, he may avoid some of those pitfalls.\n&gt;\n&gt;I think I&#39;m still not getting something.  What&#39;s good about the\n&gt;current hill?  I thought the whole problem usually is to find the\n&gt;right hill with no prior information.\n\nDepends.\n\n&gt;Is he assuming we already start with a solution?\n\nFor the robot, no.  For the creativity machine, yes.\n\n&gt;And if so, then what&#39;s the point?\n\nFor the creativity machine?  To find valid but untried combinations.  To be \ncreative.\n\n&gt;Just to\n&gt;track a slowly moving landscape?  There are probably better ways to\n&gt;do even that; for example, particle swarm optimization.\n\nCan you summarize what particle swarm optimization is in a few sentences?\n\n&gt;I guess I&#39;m missing the big picture.  His method wouldn&#39;t e.g.\n&gt;discover a biped walking network right?\n\nDon&#39;t know.  It might.  Depends on the hurdles it has to overcome to do so.  \nAnd it does depend on having an appropriate topology already in place.  But \nin theory, he can perform a single evaluation on a network, during which \ntime the weights automatically optimize, and know at the end if the topology \nis adequate.  As opposed to going through hundreds of evaluations during \nwhich you try thousands of weight combinations looking for that magical \nminimized error point.\n\nIt assumes that if you just always climb up hill a little at a time while \nthe hills are moving, you will eventually end up at the highest peak.  Is it \ntrue?  Will it work?  For a controller, maybe.  If you have enough \nevaluations and changes per second, it might actually be true.  Only \nexperimentation will say for sure if it holds true for a given problem \ndomain.\n\nBut that holds true for back-propagation, too.  In most cases, they don&#39;t \nanalyze all the training samples before adjusting weights.  They would like \nto, but it is too computationally intensive.  Instead, they do minor \nadjustments after each evaluation, and have the same exact hope that given \nenough time, they will find the highest peak.  You would expect that his \napproach, though dependant on randomness instead of calculus, should \nexperience about the same kind of results.  And back-propagation tends to \nhave a pretty good track record, from what I&#39;ve read.\n\n&gt;It sounds like it just\n&gt;takes some preconstructed solution and gets &quot;creative&quot; on it by\n&gt;randomly messing it up and hoping something interesting pops out.\n&gt;Is that the big idea?\n\nFor the creativity machine, yes.  Which, if your goal is creativity, that&#39;s \na good thing!  For instance, he has made a network that composes music.  \nPersonally, I&#39;d like to recreate that particular experiment...\n\n&gt; &gt; &gt;I agree with what Derek later said...that site is so full of hype\n&gt; &gt; &gt;and hyperbole that I can hardly believe this guy is really on the\n&gt; &gt; &gt;ball and not just a nut.  But then again, they say genius is\n&gt; &gt; &gt;difficult recognize...\n&gt; &gt;\n&gt; &gt; Someone that is dependant on and trying to attract investors is\n&gt; &gt; left with little choice.  They have to make a good impression on people \n&gt;with\n&gt; &gt; the cash.  And what works on them doesn&#39;t always work on the people with\n&gt; &gt; the knowledge and understanding of the work being done.  That, and\n&gt; &gt; what he is doing is easily reproduced, which he would prefer not to have\n&gt; &gt; happen.  So he doesn&#39;t spell out the details, for fear of being copied.  \n&gt;Can&#39;t\n&gt; &gt; blame the guy for that. :)\n&gt;\n&gt;I don&#39;t know, I&#39;m still skeptical about his sanity.  I would expect\n&gt;technology investors to be paranoid about people who claim to have\n&gt;the ultimate solution to AI.\n\nI would, too.  And his claim *IS* over-hyped.  It doesn&#39;t yet yeild a \nthinking machine.  Is he on track to making one?  That is too early to tell. \n  But some of the technologies he has produced ARE impressive and useful.  \nThe security scanning tool, for instance.\n\n&gt;Actually, interestingly, there was a guy I met an AI & Games\n&gt;conference who contacted me earlier in the year asking for my\n&gt;professional assessment of Thaler&#39;s work.  I didn&#39;t know anything\n&gt;about Thaler at the time, but I looked at his website and told the\n&gt;guy I couldn&#39;t evaluate it well because there isn&#39;t any technical\n&gt;information but that the claims sound unrealistic.\n\nYes, some of the claims are a little premature.  Other claims are fantastic, \nbut real.  Unless he lied, he really did build a network that invents words, \nand another that invents music, and another that invented the Oral-B \ncross-action toothbrush.  And I don&#39;t even know what else, but I recall \nthere being other things, too.\n\n&gt;All government funding agencies have grant reviews done by academic\n&gt;peers.  Are there really investors out there who put millions of\n&gt;dollars down without consulting an expert just because someone\n&gt;claims to have discovered the key to intelligence?\n\nThere&#39;s probably a few.  But who makes an investment decision based on the \nweb site alone?  The website is the lure.  Then they contact him for more \ninfo.  And then sign an NDA in order to get that info...  And if they like \nwhat they see, then they invest.  Or if he&#39;s a really good con-man...\n\nI&#39;m not worried about it.  I&#39;m not investing in him.  But I see potential in \nhis work, which is why I brought it up.  So we can learn from it. :)\n\n-- John\n\n\n\n"}}