{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[{"name":"READ"}]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"userId":54567749,"authorName":"Kenneth Stanley","from":"&quot;Kenneth Stanley&quot; &lt;kstanley@...&gt;","profile":"kenstanley01","replyTo":"LIST","senderId":"LgwPcQWRFwfLdSVKBSNU4nXB2vpU9lGBBx-mCd70RhNczHY4Ovxk09frj6ilwhsR0hq4DA_6lkILKvqab4aHRXdYbZLSBI7TWf3K67KxRQiK","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: genotype vs phenotype","postDate":"1092608217","msgId":1401,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGNmb25jcCtjcjJrQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGI3MzcwMWM0N2U5YyRiNjNhNTI5MCQ2ZWNiMDEwYUBtYWlsMndvcmxkLmNvbT4="},"prevInTopic":1357,"nextInTopic":1405,"prevInTime":1400,"nextInTime":1402,"topicId":1351,"numMessagesInTopic":16,"msgSnippet":"Hey Chad, I ve been meaning to respond to this message for a while but I got distracted my my Ph.D. defense.  Fianly I have enough time. ... some of ... all","rawEmail":"Return-Path: &lt;kstanley@...&gt;\r\nX-Sender: kstanley@...\r\nX-Apparently-To: neat@yahoogroups.com\r\nReceived: (qmail 17651 invoked from network); 15 Aug 2004 22:16:59 -0000\r\nReceived: from unknown (66.218.66.172)\n  by m24.grp.scd.yahoo.com with QMQP; 15 Aug 2004 22:16:59 -0000\r\nReceived: from unknown (HELO n11.grp.scd.yahoo.com) (66.218.66.66)\n  by mta4.grp.scd.yahoo.com with SMTP; 15 Aug 2004 22:16:59 -0000\r\nReceived: from [66.218.67.151] by n11.grp.scd.yahoo.com with NNFMP; 15 Aug 2004 22:16:58 -0000\r\nDate: Sun, 15 Aug 2004 22:16:57 -0000\r\nTo: neat@yahoogroups.com\r\nMessage-ID: &lt;cfoncp+cr2k@...&gt;\r\nIn-Reply-To: &lt;b73701c47e9c$b63a5290$6ecb010a@...&gt;\r\nUser-Agent: eGroups-EW/0.82\r\nMIME-Version: 1.0\r\nContent-Type: text/plain; charset=ISO-8859-1\r\nContent-Length: 4268\r\nX-Mailer: Yahoo Groups Message Poster\r\nX-Yahoo-Newman-Property: groups-compose\r\nX-eGroups-Remote-IP: 66.218.66.66\r\nFrom: &quot;Kenneth Stanley&quot; &lt;kstanley@...&gt;\r\nSubject: Re: genotype vs phenotype\r\nX-Yahoo-Group-Post: member; u=54567749\r\nX-Yahoo-Profile: kenstanley01\r\n\r\nHey Chad, I&#39;ve been meaning to respond to this message for a while \nbut I got distracted my my Ph.D. defense.  Fianly I have enough time.\n\n--- In neat@yahoogroups.com, &quot;Chad Bohannan&quot; &lt;chad@b...&gt; wrote:\n&gt; I&#39;m picking apart the Windows NEAT code I have, and mulling over \nsome of\n&gt; the threads from the group, and I have some questions. \n&gt; \n&gt; innovation #s vs ID #s: are they the same thing? I see some code\n&gt; readability to using unique id numbers, but I don&#39;t understand what\n&gt; innovation #s are for. I was reading postings about remembering \nall the\n&gt; innovations. what benifit does this have?\n&gt; \n\nI am not sure about the specific variable names in Windows NEAT (Mat \nBuckland who wrote it would know better), but I can tell you what \ninnovation numbers are for.  They are the &quot;historical markings&quot; that \ntell NEAT which gene is which when it matches up different \ntopologies.  By keeping an innovation number for each gene that \nrepresents when it first appeared, it knows when every gene in the \nsystem first appeared, and can match them up on that basis.  See \nsome of my papers on NEAT for the full description of historical \nmarking and why it works.\n\n&gt; genotype vs phenotype: I know there has been a lot of talk and \ninterest\n&gt; in modular structures, where the phenotype is not a direct mapping \nof\n&gt; the genotype, but if ( as in with NEAT ) the phenotype IS a direct \nmap,\n&gt; wouldn&#39;t it be simpler not to seperate the two? As I understand \nit, the\n&gt; idea is to build networks that can be mutated and crossed with \nother\n&gt; networks. What benifit does the genotype/phenotype distinction \nprovide?\n&gt; \n\nYou could make an argument that both the phenotype and genotype \ncould be represented by the same programming structure in a direct \nencoding, but I think keeping them separate is still useful at least \nconceptually since the kinds of operations your perform on them lead \nto different ways of storing data.  For example, genotypes need to \nbe crossed over and compared, whereas phenotype neural networks need \nto be activated.  Crossover is well served by a linear sequence of \ngenes that desribe the network, whereas activation is best served as \na connected graph structure where signals can travel down the \ngraph.  It is possible a meta-structure can be developed that serves \nboth purposes, but unless memory is a huge issue, such a structure \nseems to me more muddled than it&#39;s worth in terms of &quot;what it really \nis.&quot;  \n\nAlso, as a matter of future expansion of the code, trying to fold \ngenotype and phenotype into one structure takes away the opportunity \nto introduce even the slightest indirectness.  For example, I later \nintroduced &quot;traits&quot; to the genotype, which were actually a list of \nlearning rules that different genes could point to.  In other words, \ntraits get reused, introducing a slight indirectness to the \ngeneotype-&gt;phenotype map.  That would not be possible if the \ngenotype and phenotype had to be represented in exactly the same way.\n\n&gt; species: can speciation be summarized as method of evolving \nmultiple\n&gt; populations simultaniously, or is there too much mixing between \nspecies?\n&gt; I havn&#39;t read too deep into the speciation code. I don&#39;t really \ngrasp\n&gt; what it&#39;s supposed to accomplish. Windows NEAT essentially seems \nto use\n&gt; the species class as a simple container with accessors. Is that it?\n&gt; \n\nSpeciation is a significant and important component of NEAT.  Their \nmain purpose is to protect innovative structures in their own \nniche.  In other words, it allows similar topologies to compete \nmostly among each other instead of directly with the population at \nlarge.  That way, NEAT is able to test and maintain a good variety \nof increasingly complex topologies.  Another useful aspect of \nspeciation is that it prevents completely completely incompatible \nstructures from frequently trying to recombine with eachother, since \nthat would normally lead to a poor offspring.  However, there is \nsome chance such a combination will work well since NEAT keeps track \nof historical markings, so usually I allow some veyr small chance of \ninterspecies mating, like 1% or less.  I suggest reading our \nEvolutionary Computation paper which describes the motivation behind \nspeciation in detail in the Background section.\n\nken\n\n\n"}}