{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[{"name":"READ"}]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"userId":7192225,"authorName":"Ian Badcoe","from":"Ian Badcoe &lt;ian_badcoe@...&gt;","profile":"ian_badcoe","replyTo":"LIST","senderId":"EJB0Wg1u5XSgEjDuGV-nlTTKNZI7wj0EvMeitnTEYlMkNUXHkDijrJc84MAE7FGDO83ON4iJ8W8XDmS5S0t3bL6Do_18LbNIYpM","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [neat] Re: ANN: SharpNEAT Release (15-August-2004) +  Phased searching experiment write-","postDate":"1093353209","msgId":1457,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDYuMS4yLjAuMC4yMDA0MDgyMDEyMjk0Ni4wMjU0YWQzOEBwb3AubWFpbC55YWhvby5jby51az4=","inReplyToHeader":"PDQxMjUxNjI4LjQwNzA1MDhAZHNsLnBpcGV4LmNvbT4=","referencesHeader":"PGNnMnM3Zis2cjczQGVHcm91cHMuY29tPiA8NDEyNTE2MjguNDA3MDUwOEBkc2wucGlwZXguY29tPg=="},"prevInTopic":1456,"nextInTopic":1464,"prevInTime":1456,"nextInTime":1458,"topicId":1151,"numMessagesInTopic":34,"msgSnippet":"... Doesn t NEAT crossover also, when one individual has a gene and the other not, always include the gene in the offspring? That means that a deletion cannot","rawEmail":"Return-Path: &lt;ian_badcoe@...&gt;\r\nX-Sender: ian_badcoe@...\r\nX-Apparently-To: neat@yahoogroups.com\r\nReceived: (qmail 5474 invoked from network); 24 Aug 2004 13:13:54 -0000\r\nReceived: from unknown (66.218.66.218)\n  by m23.grp.scd.yahoo.com with QMQP; 24 Aug 2004 13:13:54 -0000\r\nReceived: from unknown (HELO smtp005.mail.ukl.yahoo.com) (217.12.11.36)\n  by mta3.grp.scd.yahoo.com with SMTP; 24 Aug 2004 13:13:54 -0000\r\nReceived: from unknown (HELO ian2k.yahoo.co.uk) (ian?badcoe@212.159.73.108 with login)\n  by smtp005.mail.ukl.yahoo.com with SMTP; 24 Aug 2004 13:13:48 -0000\r\nMessage-Id: &lt;6.1.2.0.0.20040820122946.0254ad38@...&gt;\r\nX-Sender: ian_badcoe@...\r\nX-Mailer: QUALCOMM Windows Eudora Version 6.1.2.0\r\nDate: Tue, 24 Aug 2004 14:13:29 +0100\r\nTo: neat@yahoogroups.com\r\nIn-Reply-To: &lt;41251628.4070508@...&gt;\r\nReferences: &lt;cg2s7f+6r73@...&gt;\n &lt;41251628.4070508@...&gt;\r\nMime-Version: 1.0\r\nContent-Type: text/plain; charset=&quot;us-ascii&quot;; format=flowed\r\nX-eGroups-Remote-IP: 217.12.11.36\r\nFrom: Ian Badcoe &lt;ian_badcoe@...&gt;\r\nSubject: Re: [neat] Re: ANN: SharpNEAT Release (15-August-2004) +\n  Phased searching experiment write-\r\nX-Yahoo-Group-Post: member; u=7192225\r\nX-Yahoo-Profile: ian_badcoe\r\n\r\n\n&gt; &gt;\n&gt;Yes the parameters are all correct and I agree that it seems counter\n&gt;intuitive. Actually I think you answered this question yourself in your\n&gt;response to John -  crossover. The crossover rate was set to 0.5, so\n&gt;structures are continuously propagating through the population.\n&gt;Subtractive mutations are only on individual [offspring] genomes, so\n&gt;there is a very high probability that the deleted gene will exist in\n&gt;numerous other genomes in the population and will persist despite\n&gt;subtractive mutations occuring. In fact the propagation of genes through\n&gt;crossover is so numerous that the subtractive mutations have hardly any\n&gt;effect at all - as demonstrated in the graphs.\n\nDoesn&#39;t NEAT crossover also, when one individual has a gene and the other \nnot, always include the gene in the offspring?\n\nThat means that a deletion cannot spread to other individuals and be \ncombined with other deletions.\n\n&gt;As a side note I was just reading a short article in this month&#39;s\n&gt;Scientific American that briefly discusses the possibility that\n&gt;crossover, despite being being good at trying out combinations of genes,\n&gt;actually acts as an error correcting technique - that is, if one of the\n&gt;parents has a mutated gene that is poor, the other parent is likely to\n&gt;have a good copy, and therefore some of the offspring will have a\n&gt;complete set of good genes despite having a parent with a mutation.\n&gt;Well, it&#39;s sort of relevant :)\n\nIt&#39;s very probably true but less significant than it sounds.  Calling what \ncross over does &quot;error correcting&quot; is based on a supposition that the \nmutation is &quot;wrong&quot; in some way.  Another view is that any mutation is \nadvantageous, disadvantageous or neutral.  Most are neutral, then \ndisadvantageous and finally a tiny minority are advantageous (because \nmodern species are already &quot;highly evolved&quot;).  What crossover does is to \nmix mutations which originate in either parent into one offspring.  Thus:\n\n1) neutral mutations recombine purely at random.\n\n2) advantageous and disadvantageous mutations recombine according to their \ndominant/recessive nature (sexual species are generally have two copies of \neach gene).  In the simplest cases one copy of the gene simply &quot;works \nbetter&quot; than the other.  This makes it the dominant one (because the \npresence of a less-efficient or broken alternative form does not impair the \ngood one).\n\n[[dominant mutations affect the individual fully, even with only one copy \npresent, recessive genes only affect the individual when both chromosomes \ncarry them]]\n\n3) So recessive disadvantages are selected against only when two copies \nappear.  This makes only in a way which can be determined by examination of \nits descendents (is there a word for this?).  So it&#39;s not so much unfit \nitself, more an &quot;unfitness carrier&quot;.\n\n4) Advantageous recessive genes are selected for a single copy but have no \nfurther pressure to add the second copy (except for the same sort of \n&quot;fitness carrier&quot; for the offspring, as just mentioned).\n\nSo, this leaves us with the idea that crossover allows advantageous genes \n_from different parents_ to be shuffled together into the same \nchromosome.  Thus allowing a descendant to carry both of them.  Which is \ngoing to work exactly the same whether the unfit genes are &#39;mutations&#39; or \nwhether they are the &#39;normal&#39; copy, slowly being replaced by the fitter \n&#39;mutation&#39;...\n\nNote that in nature, crossover occurs during gametogenesis (sperm/egg \ncreation) so that it&#39;s only after an individual has proven fit that the \nchromosomes it got from its parents are recombined, ready for its own \nchildren...\n\n&gt;I think it makes sense. If a species is good but has not improved for a\n&gt;number of generations (200 in the experiments) then it is culled.\n\nThis is presumably the wrong thing to do?  I mean, given that the fitness \nfunction is the only measure of progress that we have, then the fittest \nspecies _is_ the best solution we have. however much we would also like it \nto also have the property of still evolving.  The only thing we can do is \nto continue taking mutants of it (and other fit species) and hope that \neventually an avenue of progress is found.\n\nThis is where neutral mutations might come into their own.  Neutral \nmutations allow the system to continue exploring, even when it does no know \nwhich way is uphill.  This can happen two ways:\n\n1) accumulation of diversity in the population (whether you choose to call \nit more than one species is up to you)\n\n2) genetic drift -- this is the simple random walk of the genome when \nsubjected to a series of mutation with no selection pressure.\n\nSo, reassure me that your approaches do allow neutral mutations to prosper...\n\n         Ian Badcoe\n\n\n\nLiving@Home - Open Source Evolving Organisms - \nhttp://livingathome.sourceforge.net/\n\n\n\n\n"}}