{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[{"name":"READ"}]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"userId":127853030,"authorName":"Colin Green","from":"Colin Green &lt;cgreen@...&gt;","profile":"alienseedpod","replyTo":"LIST","senderId":"4qfcAqHUYaA1MRXL5I4KUKDms1JE7dJTgLqOj-xAJqznECgFZB1uU2onTLGK6neLaMbBrRzlrbpy1nYXx5bGadM8lw4q1z-Zgw","spamInfo":{"isSpam":false,"reason":"0"},"subject":"General discussion -  Fitness landscapes / Indirect encodings","postDate":"1094154920","msgId":1509,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDQxMzc3QUE4LjEwNjAyMDNAZHNsLnBpcGV4LmNvbT4=","inReplyToHeader":"PDYuMS4yLjAuMC4yMDA0MDkwMjExMTQxOS4wMjRjYmRiMEBwb3AubWFpbC55YWhvby5jby51az4=","referencesHeader":"PGNnMzhjdStrYmE2QGVHcm91cHMuY29tPiA8Y2c1bTBkK3A3YjhAZUdyb3Vwcy5jb20+IDw2LjEuMi4wLjAuMjAwNDA4MjQxNzM1MjkuMDI1NzY3YzhAcG9wLm1haWwueWFob28uY28udWs+IDw0MTJFNUZDMS43MDgwMzA2QGRzbC5waXBleC5jb20+IDw2LjEuMi4wLjAuMjAwNDA5MDIxMTE0MTkuMDI0Y2JkYjBAcG9wLm1haWwueWFob28uY28udWs+"},"prevInTopic":1504,"nextInTopic":0,"prevInTime":1508,"nextInTime":1510,"topicId":1418,"numMessagesInTopic":15,"msgSnippet":"Ian, These emails are getting out of hand so I m gonna [foolishly] try and merge them... ... Ideally you would do as nature does and increase population so","rawEmail":"Return-Path: &lt;cgreen@...&gt;\r\nX-Sender: cgreen@...\r\nX-Apparently-To: neat@yahoogroups.com\r\nReceived: (qmail 8835 invoked from network); 2 Sep 2004 19:55:20 -0000\r\nReceived: from unknown (66.218.66.172)\n  by m24.grp.scd.yahoo.com with QMQP; 2 Sep 2004 19:55:20 -0000\r\nReceived: from unknown (HELO colossus.systems.pipex.net) (62.241.160.73)\n  by mta4.grp.scd.yahoo.com with SMTP; 2 Sep 2004 19:55:20 -0000\r\nReceived: from [10.0.0.10] (81-86-175-101.dsl.pipex.com [81.86.175.101])\n\tby colossus.systems.pipex.net (Postfix) with ESMTP id 746A11C001D7\n\tfor &lt;neat@yahoogroups.com&gt;; Thu,  2 Sep 2004 20:55:19 +0100 (BST)\r\nMessage-ID: &lt;41377AA8.1060203@...&gt;\r\nDate: Thu, 02 Sep 2004 20:55:20 +0100\r\nUser-Agent: Mozilla Thunderbird 0.7.1 (Windows/20040626)\r\nX-Accept-Language: en-us, en\r\nMIME-Version: 1.0\r\nTo: neat@yahoogroups.com\r\nReferences: &lt;cg38cu+kba6@...&gt; &lt;cg5m0d+p7b8@...&gt; &lt;6.1.2.0.0.20040824173529.025767c8@...&gt; &lt;412E5FC1.7080306@...&gt; &lt;6.1.2.0.0.20040902111419.024cbdb0@...&gt;\r\nIn-Reply-To: &lt;6.1.2.0.0.20040902111419.024cbdb0@...&gt;\r\nContent-Type: text/plain; charset=ISO-8859-1; format=flowed\r\nContent-Transfer-Encoding: 7bit\r\nX-eGroups-Remote-IP: 62.241.160.73\r\nFrom: Colin Green &lt;cgreen@...&gt;\r\nSubject: General discussion -  Fitness landscapes / Indirect encodings\r\nX-Yahoo-Group-Post: member; u=127853030\r\nX-Yahoo-Profile: alienseedpod\r\n\r\nIan,\n\nThese emails are getting out of hand so I&#39;m gonna [foolishly] try and \nmerge them...\n\nIan Badcoe wrote:\n\n&gt;[snip...]\n&gt;\n&gt;  \n&gt;\n&gt;&gt;&gt;3) Increased connectivity pulls points closer together and speeds evolution.\n&gt;&gt;&gt;\n&gt;&gt;&gt;4) Increased connectivity increases the size of &quot;neighborhood&quot; around each\n&gt;&gt;&gt;point, and slows evolution.\n&gt;&gt;&gt;\n&gt;&gt;&gt;5) So there&#39;s a trade-off between 3 and 4, which is problem dependent and\n&gt;&gt;&gt;nobody knows how to estimate the best compromise.\n&gt;&gt;&gt;\n&gt;&gt;&gt;\n&gt;&gt;&gt;      \n&gt;&gt;&gt;\n&gt;&gt;Putting my phased search hat on for a moment. Perhaps switching between\n&gt;&gt;different types of mutation could be beneficial, the search could spend\n&gt;&gt;time finding a local optimum in the current landscape, and then we\n&gt;&gt;change the landscape to search for wdier solutions, if we find one then\n&gt;&gt;switch back to searching for local solutions. This is a generalisation\n&gt;&gt;of course, you could have many different fitness landscape schemes to\n&gt;&gt;choose from. So just periodically cycling through different schemes\n&gt;&gt;might be better than any one scheme on it&#39;s own. One very rudamentary\n&gt;&gt;implementation of this idea would be to periodically take a champion\n&gt;&gt;genome from NEAT and to just perform weight mutation (no topology\n&gt;&gt;mutations), in order to find the optimal weights fro the current best\n&gt;&gt;toplogy.\n&gt;&gt;    \n&gt;&gt;\n&gt;\n&gt;I think that&#39;s a really good insight.  However, there&#39;s a downside as well.\n&gt;\n&gt;One of the things about higher-dimensional spaces is that our intuition \n&gt;about them is really poor.\n&gt;\n&gt;In this case, how much &quot;volume&quot; grows with increasing radius is very much \n&gt;disproportionate to the 3D spaces we are used too (in fact, most people \n&gt;visualize in 2D and even underestimate 3D volumes).\n&gt;\n&gt;Thus, in a 3D space:\n&gt;\n&gt;radius * 2 implies volume * 8\n&gt;\n&gt;in a 100D space:\n&gt;\n&gt;radius * 2 implies volume * 1267650600228229401496703205376\n&gt;\n&gt;Which brings me to the down-side of long-ranged mutations.  E.g. suppose in \n&gt;one phase we use mutations equivalent to &quot;short&quot; steps across the space, in \n&gt;the phase and there could be (say) 1 billion &quot;local&quot; genomes accessible \n&gt;(again, say) 10 are fitter than us.  Suppose that then we &quot;stall&quot; and \n&gt;switch to another phase using mutations equivalent to &quot;long&quot; steps across \n&gt;the space, now there are (yet again say) 1E50 genomes accessible and (yet \n&gt;another figure off the top of my head) 100 are better then the current one.\n&gt;\n&gt;[[I base &quot;100&quot; on the idea that (i) an interesting problem might have 100 \n&gt;different &quot;strategies&quot; meaning 100 different remote &quot;meta optima&quot;, and (ii) \n&gt;very optimistically, I&#39;m supposing we can hit each of those meta optima at \n&gt;least once with the &quot;long steps&quot;, and (iii) also very optimistically, I&#39;m \n&gt;supposing that when we do hit a meta optimum, we hit it far enough up the \n&gt;slope that it looks better than the current solution]]\n&gt;\n&gt;So basically what I&#39;m saying is that once a population gets &quot;locked in&quot; on \n&gt;a particular &quot;strategy&quot;.  Any steps long enough to walk it out of the local \n&gt;meta-optimum, unless the meta optimum is really low, has no chance of \n&gt;hitting a genome which will out perform the current population champion.\n&gt;\n&gt;Of course, this is where species come in, because a new species arising \n&gt;from a &quot;long step&quot; can compete amongst itself until it out-performs the \n&gt;previous best species.  However we must consider the vastness of the space \n&gt;again, that species might take along while to get out of the doldrums, and \n&gt;may itself &quot;stall&quot; several times on the way to it&#39;s sun-lit uplands...\n&gt;\n&gt;On this basis, do people agree that strategies which leave species alone \n&gt;for absolutely as long as possible might be the way to go?\n&gt;\n\nIdeally you would do as nature does and increase population so massively \nthat you can search trillions of points in the search space at once. We \ndon&#39;t have that luxury but I think a compromise may be better than our \ncurrent strategy of culling all species except the best. How about \ncombining speciation with population islands. Each island gets to search \nthe space around it&#39;s best species, but within the island we utilise \nspecies culling as normal.\n\n&gt;If I were really implementing this, I would not stop at just two levels of \n&gt;speciation.  I also would not use anything as rigid as an a.b.c type \n&gt;system.  I would probably just track the descent of individuals from common \n&gt;ancestors.  Thus a set of brothers would form the smallest \n&gt;&quot;sub-sub-sub-...-sub-species&quot; and the whole thing would proceed \n&gt;hierarchically through cousins, uncles... up to some threshold where I \n&gt;would call them &quot;unrelated&quot;.\n&gt;\n&gt;Thoughts anybody...\n&gt;  \n&gt;\nIsn&#39;t that pretty much what NEAT does when it compares genomes for \ncompatibility? It may not be tracing lineage directly, but comparing \ninnovation IDs tells us roughly how close two genomes are in the family \ntree. Maybe I missed the point here.\n\n\n\nJohn Wrote:\n\n&gt;&gt;In the mean time it&#39;s a good idea to investigate the limits of direct\n&gt;&gt;encoding techniques such as NEAT. With a great many experiments and all\n&gt;&gt;ideas exhausted research can them move on to modular or indirect\n&gt;&gt;approaches, using the best direct encoding technques as a benchmark.  I\n&gt;&gt;also think that NEAT could form the core of an indirect encoding\n&gt;&gt;technique in the future, finding sub-solutions that can then be\n&gt;&gt;recombined into larger solutions. I think I just walked into that trap\n&gt;&gt;of thinking in a &#39;divide and conquer&#39; / engineering manner again  :) \n&gt;&gt;    \n&gt;&gt;\n&gt;\n&gt;I&#39;m not sure that I agree.\n&gt;\n&gt;Hmm, let me rephrase, I agree that NEAT is an exciting technique and well \n&gt;worthy of all the exploration we can get.\n&gt;\n&gt;But..., I&#39;m not sure that the progression to modular systems is necessarily \n&gt;a _consequence_ of sufficient non-modular research.\n&gt;  \n&gt;\nActuall I agree it makes sense to research indirect and direct encodings \nin parallel. Really I was just discussing my own plans there. I read the \nmodular NEAT paper recently and it shows some promising results.\n\n&gt;I&#39;m also not sure I necessarily equate the &quot;indirect&quot; with &quot;modular&quot;.  I \n&gt;  \n&gt;\nFair point. I suppose it is possible to have an indirect encoding that \nis not modular, not sure about vis versa though. Modular implies you \nhave genes that descibe where whole modules are placed in the phenotype \nrather than the atomic parts of the structure, and that the modules can \nbe re-used - which sounds like an indirect encoding to me.\n\n&gt;&gt;&gt;Anyway I have serious doubts about how well indirect techniques can work\n&gt;&gt;&gt;without much faster computers\n&gt;&gt;    \n&gt;&gt;\n&gt;\n&gt;Hmm, you are of course right, but I would also argue that CPU has made \n&gt;great strides in the last few years, and nobody has yet really plumbed the \n&gt;depths of what&#39;s practical at our current level.  That and the fact that \n&gt;Moore&#39;s law catches up faster than one thinks, so there&#39;s no harm trying to \n&gt;have a few &quot;impractical&quot; approaches ready for the year after next.\n&gt;  \n&gt;\n\nOk i&#39;m gonna do another U-turn here and agree that current research \nhasn&#39;t fully exploerd what&#39;s possible with currently available CPUs. I \nrecon a nice lean, simple indirect encoding could offer great advantages \nover direct encodings with current hardware. And the Modular NEAT paper \nis good evidence of this. Even so,  I&#39;ve got my eye on those multi-core \nOpterons :)\n\n&gt;Grid computing also adapts most neatly (no pun intended) to an &quot;islands&quot; \n&gt;approach to subpopulations.  Which is another take on that whole \n&gt;species/sub-species discussion in my earlier post.\n&gt;\n&gt;  \n&gt;\n\nYep, see mention of islands above.\n\n\nColin\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nColin.\n\n"}}