{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[{"name":"READ"}]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"userId":104426122,"authorName":"Mitchell Timin","from":"Mitchell Timin &lt;zenguyuno@...&gt;","profile":"zenguyuno","replyTo":"LIST","senderId":"qNmCO9gZfPT8oQfa6XpdFNmDGlbuoo-Nr3KwmfQixCdvuQ13FbxWeQE6afA2U_-uJjT1OdWxsfp7rSr_Efcj8mf4oZicA1Yq6YO4","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Some Good News and Some Bad News","postDate":"1066878952","msgId":153,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDIwMDMxMDIzMDMxNTUyLjUyOTI1LnFtYWlsQHdlYjIxNDExLm1haWwueWFob28uY29tPg=="},"prevInTopic":0,"nextInTopic":154,"prevInTime":152,"nextInTime":154,"topicId":153,"numMessagesInTopic":6,"msgSnippet":"About the concentration game, that is.  The bad news is that I have totally failed to evolve an ANN that would play better than a random selector of cards. ","rawEmail":"Return-Path: &lt;zenguyuno@...&gt;\r\nX-Sender: zenguyuno@...\r\nX-Apparently-To: neat@yahoogroups.com\r\nReceived: (qmail 40106 invoked from network); 23 Oct 2003 03:15:52 -0000\r\nReceived: from unknown (66.218.66.218)\n  by m13.grp.scd.yahoo.com with QMQP; 23 Oct 2003 03:15:52 -0000\r\nReceived: from unknown (HELO web21411.mail.yahoo.com) (216.136.232.80)\n  by mta3.grp.scd.yahoo.com with SMTP; 23 Oct 2003 03:15:52 -0000\r\nMessage-ID: &lt;20031023031552.52925.qmail@...&gt;\r\nReceived: from [64.180.115.78] by web21411.mail.yahoo.com via HTTP; Wed, 22 Oct 2003 20:15:52 PDT\r\nDate: Wed, 22 Oct 2003 20:15:52 -0700 (PDT)\r\nSubject: Some Good News and Some Bad News\r\nTo: neat@yahoogroups.com\r\nMIME-Version: 1.0\r\nContent-Type: text/plain; charset=us-ascii\r\nFrom: Mitchell Timin &lt;zenguyuno@...&gt;\r\nX-Yahoo-Group-Post: member; u=104426122\r\nX-Yahoo-Profile: zenguyuno\r\n\r\n\nAbout the concentration game, that is.  The bad news\nis that I have totally failed to evolve an ANN that\nwould play better than a random selector of cards. \nThis was with the six card deck, two each of three\nkinds.  Hours of evolution would produce an ANN that\nwas as good as the random card selector, but after\nthat it would not improve.  This is using the fully\nrecurrent binary ANN which I think I described\nearlier.  I tried various number of neurons up to 40. \nI concluded that this configuration is incapable of\nremembering the cards it sees and then recalling that\ndata and using it.  (more about this below)\n\nThe good news is that I have succeeded in\ndemonstrating that such an ANN can remember what it\nsees and act upon it.  I decided to simplify the\nconcentration game to its simplest possible version. \nHere is what I eventually did:  There is a 4 card\ndeck, two aces and two deuces.  The ANN goes second. \nThe first player chooses the first card at random, but\nthe second card is chosen NOT to match the first card.\n So the ANN sees two non-matching cards and two face\ndown cards.  Then the cards are turned face down and\nthe ANN picks one card.  Then the ANN picks a second\ncard.  That&#39;s it!  If the cards match, the ANN wins. \nOtherwise it loses.\n\nIf the ANN had no memory and just picked at random it\nwould win only 33.3% of the time. This is because,\nwhichever card is picked first, there remain two cards\nthat don&#39;t match and only one that matches.\n\nIf the ANN can remember in what positions the first\nplayer found a non-pair, it could increase its win\npercentage to 50% by always picking one previously\npicked card and one un-picked card.  This would not\nrequire remember what cards it saw, just where they\nwere picked.\n\nIf the ANN can remember everything, then it can win\nevery time.  Of course it also has to follow the right\nstrategy, which is to first pick an un-picked card,\nand then choose the matching one from the two that\nwere exposed.  An ANN that does this every time will\nwin 100%.\n\nThe good news is that I have evolved ANNs that win 95%\nof the time!  I have checked this carefully and have\nconfidence in the result.  The evolution seemed to\nstop at about 95%.  I&#39;m not sure why this is, but it\nmay be that more neurons are required.  The 95% result\nwas with 40 neurons.  \n\nSince this proves that the ANN can remember a series\nof patterns and then act correctly using that data, it\nwould seem that the six card game could be mastered. \nMy hypothesis is that many more neurons are required. \nPerhaps one or two hundred are necessary.  OTOH, my\ncomputational resources and patience probably limit me\nto 50 neurons max.  I wonder if there are any\ntheortical results that would apply to this problem?\n\n\n\n=====\nMitchell Timin\nhttp://annevolve.sourceforge.net\n\n__________________________________\nDo you Yahoo!?\nThe New Yahoo! Shopping - with improved product search\nhttp://shopping.yahoo.com\n\n"}}