{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[{"name":"READ"}]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"userId":127853030,"authorName":"Colin Green","from":"Colin Green &lt;cgreen@...&gt;","profile":"alienseedpod","replyTo":"LIST","senderId":"EiyKu92l2r1qVJDnLzdgKP7fjvEu1v7eGFul37h-NW3aDjaO6IPBASLYzignsfW079VSs8t_ZtSZcHAHK8l5jipUgzIFLByJ2Q","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [neat] Phased Searching Writeup","postDate":"1095462301","msgId":1548,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDQxNEI2RDlELjgwNDA1MDdAZHNsLnBpcGV4LmNvbT4=","inReplyToHeader":"PGNoN2wwOSttY2puQGVHcm91cHMuY29tPg==","referencesHeader":"PGNoN2wwOSttY2puQGVHcm91cHMuY29tPg=="},"prevInTopic":1507,"nextInTopic":1557,"prevInTime":1547,"nextInTime":1549,"topicId":1507,"numMessagesInTopic":3,"msgSnippet":"Hi Ken, Thanks for  response on the phased search write-up. Responses below... ... The first question here is,  if I were to make the write-up publication ","rawEmail":"Return-Path: &lt;cgreen@...&gt;\r\nX-Sender: cgreen@...\r\nX-Apparently-To: neat@yahoogroups.com\r\nReceived: (qmail 77290 invoked from network); 17 Sep 2004 23:05:07 -0000\r\nReceived: from unknown (66.218.66.167)\n  by m24.grp.scd.yahoo.com with QMQP; 17 Sep 2004 23:05:07 -0000\r\nReceived: from unknown (HELO pengo.systems.pipex.net) (62.241.160.193)\n  by mta6.grp.scd.yahoo.com with SMTP; 17 Sep 2004 23:05:07 -0000\r\nReceived: from [10.0.0.10] (81-86-175-101.dsl.pipex.com [81.86.175.101])\n\tby pengo.systems.pipex.net (Postfix) with ESMTP id 7CBD44C0018B\n\tfor &lt;neat@yahoogroups.com&gt;; Sat, 18 Sep 2004 00:05:06 +0100 (BST)\r\nMessage-ID: &lt;414B6D9D.8040507@...&gt;\r\nDate: Sat, 18 Sep 2004 00:05:01 +0100\r\nUser-Agent: Mozilla Thunderbird 0.7.1 (Windows/20040626)\r\nX-Accept-Language: en-us, en\r\nMIME-Version: 1.0\r\nTo: neat@yahoogroups.com\r\nReferences: &lt;ch7l09+mcjn@...&gt;\r\nIn-Reply-To: &lt;ch7l09+mcjn@...&gt;\r\nContent-Type: text/plain; charset=ISO-8859-1; format=flowed\r\nContent-Transfer-Encoding: 7bit\r\nX-eGroups-Remote-IP: 62.241.160.193\r\nFrom: Colin Green &lt;cgreen@...&gt;\r\nSubject: Re: [neat] Phased Searching Writeup\r\nX-Yahoo-Group-Post: member; u=127853030\r\nX-Yahoo-Profile: alienseedpod\r\n\r\nHi Ken,\n\nThanks for  response on the phased search write-up. Responses below...\n\nKenneth Stanley wrote:\n\n&gt;Here are some comments on your writeup.  I think it&#39;s great work and \n&gt;very helpful.  It seems from your preliminary results that phased \n&gt;search can significantly outperform complexification alone, so we \n&gt;might now be able to solve even harder problems.  For that reason \n&gt;alone, this is probably publication-worthy work, although there are \n&gt;a few things that should be addressed, or at least I&#39;m curious about:\n&gt;  \n&gt;\nThe first question here is,  if I were to make the write-up publication \nworthy what avenues are open with regards to getting work published? \nPlacing the work on the internet works well up to a point, but a peer \nreviewed paper has more credability and can be used as a base point for \nfurther research by others, plus it is something to put in the ole CV :)\n\n&gt;-Why is the phased search so much faster?  It seems to be 5 or 10 \n&gt;times faster based on what you say, but that seems more dramatic \n&gt;than I would expect.  I guess it&#39;s because this task is all about \n&gt;network activation and has no &quot;domain simulation&quot; involved.  \n&gt;\nYeh, because the evaluation code is so simple and fast, something like \n90% (at a guess) of the execution time is spent in the actual NEAT \nprocess of generating offspring, comparing genomes and decoding genomes \ninto working networks. Therefore if you reduce the size of the genomes \nwithin the population then you can expect a dramatic speed up. There is \nalso a scaling issue in SharpNEAT right now that means that it slows \ndown a lot more than it should as the genome size increases. There&#39;s a \nsimple fix but I&#39;ve not had time to work on SharpNEAT lately.\n\n&gt;That \n&gt;won&#39;t be the case in other domains, and therefore the speedup aspect \n&gt;of this might be misleading.  Therefore, it would be helpful to see \n&gt;comparison graphs with generations on the x axis instead of time.  \n&gt;Usually people in machine learning are interested in # evaluations \n&gt;to get a soltuion rather than CPU time since ultimately that&#39;s the \n&gt;main factor in computational complexity.  Time alone doesn&#39;t give \n&gt;that information but generations does.\n&gt;  \n&gt;\nyes I can see the value in showing generation based graphs, with the \ntime based graphs the percieved benefit may just be from performing more \ngenerations in a given amount of time - the none phased search runs may \nhave achieved the same result if allowed to run to the same # of \ngenerations. I still like the time based graphs though because \nultimately we need to know if we can find solutions within realistic \ntime frames. It&#39;s not much use devising a technqiue that can solve \nproblem X within 1,000 years :)\n\n&gt;-If you ran the complexifying or blended runs for the same number of \n&gt;generations as the phased runs would they catch up?  That&#39;s another \n&gt;reason it would be good to see a comparison by generations rather \n&gt;than time.  If they can&#39;t catch up in the same # of generations, \n&gt;that is a very strong result!\n&gt;  \n&gt;\nYes I agree that this would be an interesting experiment to run.\n\n&gt;-To really validate this approach, we need a task that cannot be \n&gt;solved without hidden nodes.  So probably another experiment in a \n&gt;new domain would be a good idea.\n&gt;  \n&gt;\nI&#39;m intending to do some phased search experiments with Tic-Tac-Toe, and \nprobably function regression. The later hopefully leading on to some \nform of financial data prediction experiment(s).\n\n&gt;-The # hidden nodes in a soltuion is interesting in its own right.  \n&gt;For example, what is actually happening to keep complexity steady: \n&gt;Are connections being added then taken away back and forth over and \n&gt;over, or are several hidden layers being built at the same time as \n&gt;some inputs are being pruned?  A graph of # nodes per solution would \n&gt;give some insight.\n&gt;  \n&gt;\nThe search is mainly one of finding connections. Although hidden nodes \ndo accumulate during the complexification phase they almost always are \ncompletely removed by the end of a prune phase. Some  &#39;common feature&#39; \nnodes exist by way of connections from output nodes to other output nodes.\n\n\n&gt;-It would be interesting to see a picture of a solution network.  It \n&gt;would help address the above point and also it&#39;s just fun to see :)\n&gt;  \n&gt;\nYeh the problem here is that the networks from complexifying and blended \nruns are really complex, whereas the ones that have been pruned have no \nhidden node and frankly look a bit boring :)  One idea is to runt eh \nnetworks from a complexifying run through a prune phase to prune away \nredundant structure. My guess is that they will be utilising some hidden \nnodes, possibly a lot, whereas the pruning phase nets normally don&#39;t \nhave any.\n\nThanks again for the feedback,\n\nColin.\n\n\n"}}