{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[{"name":"READ"}]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"userId":7192225,"authorName":"Ian Badcoe","from":"Ian Badcoe &lt;ian_badcoe@...&gt;","profile":"ian_badcoe","replyTo":"LIST","senderId":"ocGLWbjIddDK8vNh9b3MwiT6KaB2EfkUIH5tYJFpSxqz-w9d_aY_t1_YVKw3XD--JOxRmjIOKarxMtj3tmnpxYexdHG2kq0RAIw","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [neat] Re: Connection weight mutation schemes","postDate":"1097685250","msgId":1645,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDYuMS4yLjAuMC4yMDA0MTAxMzEyMTY1MC4wMjUwMTVmMEBwb3AubWFpbC55YWhvby5jby51az4=","inReplyToHeader":"PDQxNkM1QjgxLjcwNzAzMDlAZHNsLnBpcGV4LmNvbT4=","referencesHeader":"PGNrZXNmcitlczd2QGVHcm91cHMuY29tPiA8NDE2QzVCODEuNzA3MDMwOUBkc2wucGlwZXguY29tPg=="},"prevInTopic":1644,"nextInTopic":1648,"prevInTime":1644,"nextInTime":1646,"topicId":1618,"numMessagesInTopic":27,"msgSnippet":"... A-ha!!! You just inspired me to understand an issue which has been at the back of my mind for quite a while but I was never quite able to put into clear ","rawEmail":"Return-Path: &lt;ian_badcoe@...&gt;\r\nX-Sender: ian_badcoe@...\r\nX-Apparently-To: neat@yahoogroups.com\r\nReceived: (qmail 21903 invoked from network); 13 Oct 2004 16:30:20 -0000\r\nReceived: from unknown (66.218.66.166)\n  by m21.grp.scd.yahoo.com with QMQP; 13 Oct 2004 16:30:20 -0000\r\nReceived: from unknown (HELO smtp001.mail.ukl.yahoo.com) (217.12.11.32)\n  by mta5.grp.scd.yahoo.com with SMTP; 13 Oct 2004 16:30:19 -0000\r\nReceived: from unknown (HELO ian2k.yahoo.co.uk) (ian?badcoe@212.159.73.108 with login)\n  by smtp001.mail.ukl.yahoo.com with SMTP; 13 Oct 2004 16:30:18 -0000\r\nMessage-Id: &lt;6.1.2.0.0.20041013121650.025015f0@...&gt;\r\nX-Sender: ian_badcoe@...\r\nX-Mailer: QUALCOMM Windows Eudora Version 6.1.2.0\r\nDate: Wed, 13 Oct 2004 17:34:10 +0100\r\nTo: neat@yahoogroups.com\r\nIn-Reply-To: &lt;416C5B81.7070309@...&gt;\r\nReferences: &lt;ckesfr+es7v@...&gt;\n &lt;416C5B81.7070309@...&gt;\r\nMime-Version: 1.0\r\nContent-Type: text/plain; charset=&quot;us-ascii&quot;; format=flowed\r\nX-eGroups-Remote-IP: 217.12.11.32\r\nFrom: Ian Badcoe &lt;ian_badcoe@...&gt;\r\nSubject: Re: [neat] Re: Connection weight mutation schemes\r\nX-Yahoo-Group-Post: member; u=7192225\r\nX-Yahoo-Profile: ian_badcoe\r\n\r\n\n&gt;It seems very likely to me that the genome or gene level meta-parameters\n&gt;will drift a *lot*, mainly because there isn&#39;t much selection pressure\n&gt;being applied to them - the pressure is applied whenever a new better\n&gt;genome is found, and we can say aha! the set of meta-params on this\n&gt;genome/gene must be good. But of course a bad set of meta-params can\n&gt;find good genomes to, sometimes.  Assuming a lot of drift you then have\n&gt;to consider the possibility that some of these drifting parameters\n&gt;aren&#39;t working very well, but they are still able to propagate through\n&gt;the population (because of low selection pressure) and in fact you might\n&gt;end up with a population where only a few of the genomes are actually\n&gt;using sensible meta-parameters that have any chance of finding a good\n&gt;solution.\n&gt;\n&gt;No doubt then the ES people have encountered these issues, so some\n&gt;reading would be in order before implementing such a system with NEAT.\n\nA-ha!!!\n\nYou just inspired me to understand an issue which has been at the back of \nmy mind for quite a while but I was never quite able to put into clear \nwords.  I think this is quite an important concept.\n\nIt&#39;s the difference between mortals and immortals.\n\n(e.g. in a system with an &quot;elite&quot; the &quot;elite&quot; are immortal, they live many \ngenerations)\n\nThere&#39;s two different types of fitness involved.  Call them &quot;immediate \nfitness&quot; and &quot;iterated fitness&quot;.\n\nImmortals must have immediate fitness, they have to successfully compete \nwith the rest of the population so their individual fitness must be high \nfor whatever day-to-day tasks the population is tested against.  An \nimmortal can have defective reproduction machinery without impairing this \nimmediate fitness.  As long as it continues to measure up against the rest \nof the population it can hang around forever...  Looked at another way, \n99.9999% of its children may be still-born, but it can afford to wait for \nthe one in a million.\n\nMortals, in contrast have to have iterated fitness.  A mortal with \ndefective reproduction machinery is only a transient phenomenon and will \nnot be in the next generation.\n\nThus they evolve under quite different pressures.  In systems without any \n&quot;meta-parameters&quot; in the genes (like plain NEAT) there is little or nothing \nthe differential pressure can act upon.  Because there is nothing which \n_can_ change the individuals ability to have children.\n\nES, on the other hand, has its degree-of-mutation parameters (mutabilities, \n&quot;strategy variables&quot;) and these have the effect, as Colin pointed out, of \nchanging the (immediate) fitness of not the individual, but its \nchildren.  This is (in my terminology) changing the iterated fitness.  Thus \nthe definition of &quot;iterated fitness&quot; is something like:\n\nIF[1](who) = sum(child in children(who) : Fitness(child) * \nrelatedness(child, who))\n\nIF[n](who) = sum(child in children(who) : IF[n-1](child) * \nrelatedness(child, who))\n\n[[relatedness of parent and child is 1/2 (with equal probability crossover) \nand parent and grand-child is 1/4...]]\n\nAs you see, it varies according to how many generations you look ahead \n(e.g. the current-day IF of any T-Rex is zero...) and is an emergent \nproperty only visible after the event.\n\nSo in ES without an elite (&quot;comma strategy&quot; they call it) we are breeding \nnot only for the ability to solve the problem presented, but also for the \n_ability_ to breed solutions to the problem.\n\nWhich is what closes the loop and allows the mutability parameters to \nevolve to useful values in parallel with the functional genes.  Whether \nthey contribute to the search is a different question...\n\n--\n\nAnother point about this is that it is closely tied to mutual fertility \nbetween two individuals.  e.g. if two individuals are crossed over, \ndepending on the compatibility between their genomes, then the offspring \nmay be of similar fitness to the parents or else greatly reduced in \nfitness.  This is down to issues akin to the &quot;competing conventions&quot; problem.\n\nNow, if there is no crossover, then there is no drive for the individuals \nto remain mutually fertile.  On the other hand, even if there is crossover, \nan immortal individual may have little drive to be fertile with the bulk of \nthe population.  Conversely, if the elite breeds with the non-elite, and if \nthe elite father a largish proportion of the children, then the non-elite \nmay be held back needing to remain compatible with the elite.\n\nWith no elite, the need to remain mutually fertile adds an additional \nfactor to the IF of the individuals, e.g. if they are not fertile with most \nof the population, again their immediate fitness is unchanged but that of \ntheir children reduced.\n\n--\n\nAnother (vaguer) point is the difference between merely passing time and \npassing generations.  e.g. if we don&#39;t have an elite, then each individual \nlives one generation but during that generation gets only one chance to \nbreed (or to be exact, once chance to breed a few times).  The reason this \nmay matter is that, in nature, individuals frequently take note of their \nown breeding success when deciding whether to breed more.  e.g.\n\n(1) to some extent a bonded pair will keep having sex _until_ the female \ngets pregnant -- so any (minor) incompatibilities between them (which might \nkill the offspring in the womb) get overridden by persisting until they get \nlucky (without spewing out hundreds of offspring whether they get lucky or \nnot).\n\n(2) on a larger scale individuals may not breed at all when they think they \nhave enough offspring (in the simplest case because they don&#39;t have time \nafter caring for the existing ones)\n\n(3) in some species individuals pick a different partner each year, thei \nenables them to exploit (1) within the year but switch to somebody else in \ncase they turn out completely infertile\n\netc etc\n\n         All of which adds up to more than just giving individuals one \nchance to breed in one generation and them being lost from the population \nif they are unlucky.  It is perhaps more like, once we have decided an \nindividual is fit enough to breed, making a sustained effort (multiple \nbreedings with multiple partners) to produce an offspring, and then, \nfollowing that offspring for at least a short while and if it proves \nunsuccessful, giving the parent further chances.\n\n--\n\nFood for thought...\n\n         Ian\n\n\n\n\nLiving@Home - Open Source Evolving Organisms - \nhttp://livingathome.sourceforge.net/\n\n\n\n\n"}}