{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[{"name":"READ"}]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"userId":127853030,"authorName":"Colin Green","from":"Colin Green &lt;cgreen@...&gt;","profile":"alienseedpod","replyTo":"LIST","senderId":"B-wT3Rh96ZUAA-wFnFeXyE9zdaY0Px7uAJO8MBFabR8RqNwENqhRD4Cg4G2h5OOegDEJUcLZyfItNdg85nrTPAz4BhUXMdLSbg","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [neat] Re: Connection weight mutation schemes","postDate":"1098129521","msgId":1649,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDQxNzQyMDcxLjgwOTA5MDBAZHNsLnBpcGV4LmNvbT4=","inReplyToHeader":"PDYuMS4yLjAuMC4yMDA0MTAxMzEyMTY1MC4wMjUwMTVmMEBwb3AubWFpbC55YWhvby5jby51az4=","referencesHeader":"PGNrZXNmcitlczd2QGVHcm91cHMuY29tPiA8NDE2QzVCODEuNzA3MDMwOUBkc2wucGlwZXguY29tPiA8Ni4xLjIuMC4wLjIwMDQxMDEzMTIxNjUwLjAyNTAxNWYwQHBvcC5tYWlsLnlhaG9vLmNvLnVrPg=="},"prevInTopic":1648,"nextInTopic":0,"prevInTime":1648,"nextInTime":1650,"topicId":1618,"numMessagesInTopic":27,"msgSnippet":"... umm, I think this discussion probably belongs on alt.philosophy :) ... Yes except that [in SharpNEAT anyway] old species are discarded if there are other","rawEmail":"Return-Path: &lt;cgreen@...&gt;\r\nX-Sender: cgreen@...\r\nX-Apparently-To: neat@yahoogroups.com\r\nReceived: (qmail 68596 invoked from network); 18 Oct 2004 19:58:51 -0000\r\nReceived: from unknown (66.218.66.172)\n  by m24.grp.scd.yahoo.com with QMQP; 18 Oct 2004 19:58:51 -0000\r\nReceived: from unknown (HELO astro.systems.pipex.net) (62.241.163.6)\n  by mta4.grp.scd.yahoo.com with SMTP; 18 Oct 2004 19:58:50 -0000\r\nReceived: from [10.0.0.10] (81-86-175-101.dsl.pipex.com [81.86.175.101])\n\tby astro.systems.pipex.net (Postfix) with ESMTP id 92B7CE000311\n\tfor &lt;neat@yahoogroups.com&gt;; Mon, 18 Oct 2004 20:58:47 +0100 (BST)\r\nMessage-ID: &lt;41742071.8090900@...&gt;\r\nDate: Mon, 18 Oct 2004 20:58:41 +0100\r\nUser-Agent: Mozilla Thunderbird 0.7.1 (Windows/20040626)\r\nX-Accept-Language: en-us, en\r\nMIME-Version: 1.0\r\nTo: neat@yahoogroups.com\r\nReferences: &lt;ckesfr+es7v@...&gt; &lt;416C5B81.7070309@...&gt; &lt;6.1.2.0.0.20041013121650.025015f0@...&gt;\r\nIn-Reply-To: &lt;6.1.2.0.0.20041013121650.025015f0@...&gt;\r\nContent-Type: text/plain; charset=ISO-8859-1; format=flowed\r\nContent-Transfer-Encoding: 7bit\r\nX-eGroups-Remote-IP: 62.241.163.6\r\nFrom: Colin Green &lt;cgreen@...&gt;\r\nSubject: Re: [neat] Re: Connection weight mutation schemes\r\nX-Yahoo-Group-Post: member; u=127853030\r\nX-Yahoo-Profile: alienseedpod\r\n\r\nIan Badcoe wrote:\n\n&gt;\n&gt;A-ha!!!\n&gt;\n&gt;You just inspired me to understand an issue which has been at the back of \n&gt;my mind for quite a while but I was never quite able to put into clear \n&gt;words.  I think this is quite an important concept.\n&gt;\n&gt;It&#39;s the difference between mortals and immortals.\n&gt;  \n&gt;\numm, I think this discussion probably belongs on alt.philosophy :)\n\n&gt;(e.g. in a system with an &quot;elite&quot; the &quot;elite&quot; are immortal, they live many \n&gt;generations)\n&gt;  \n&gt;\nYes except that [in SharpNEAT anyway] old species are discarded if there \nare other equally fit species around. They&#39;re immortal for a while anyway :)\n\n&gt;There&#39;s two different types of fitness involved.  Call them &quot;immediate \n&gt;fitness&quot; and &quot;iterated fitness&quot;.\n&gt;\n&gt;Immortals must have immediate fitness, they have to successfully compete \n&gt;with the rest of the population so their individual fitness must be high \n&gt;for whatever day-to-day tasks the population is tested against.  An \n&gt;immortal can have defective reproduction machinery without impairing this \n&gt;immediate fitness.  As long as it continues to measure up against the rest \n&gt;of the population it can hang around forever...  Looked at another way, \n&gt;99.9999% of its children may be still-born, but it can afford to wait for \n&gt;the one in a million.\n&gt;\n&gt;Mortals, in contrast have to have iterated fitness.  A mortal with \n&gt;defective reproduction machinery is only a transient phenomenon and will \n&gt;not be in the next generation.\n&gt;  \n&gt;\nResisting the urge to make some bad jokes at this point, but yes I&#39;m \nwith you...\n\n&gt;Thus they evolve under quite different pressures.  In systems without any \n&gt;&quot;meta-parameters&quot; in the genes (like plain NEAT) there is little or nothing \n&gt;the differential pressure can act upon.  Because there is nothing which \n&gt;_can_ change the individuals ability to have children.\n&gt;  \n&gt;\nI think this is probably true of &#39;plain&#39; NEAT as it stands, but if you \nhave a modular genome then some modules may be more able bind with other \nmodules beneficially, so the evolution has a sort of sub-thread of \nevolving modules that not only perform well at the immediate task, but \nthat also combine well with other modules. You end up with a  sort of \nco-evolution of modules and symbiotic relationships being set up.\n\n&gt;ES, on the other hand, has its degree-of-mutation parameters (mutabilities, \n&gt;&quot;strategy variables&quot;) and these have the effect, as Colin pointed out, of \n&gt;changing the (immediate) fitness of not the individual, but its \n&gt;children.  This is (in my terminology) changing the iterated fitness.  Thus \n&gt;the definition of &quot;iterated fitness&quot; is something like:\n&gt;  \n&gt;\n&gt;IF[1](who) = sum(child in children(who) : Fitness(child) * \n&gt;relatedness(child, who))\n&gt;\n&gt;IF[n](who) = sum(child in children(who) : IF[n-1](child) * \n&gt;relatedness(child, who))\n&gt;  \n&gt;\nOk yeh, so IF is something we can only calculate for an individual \nseveral generations after he/she/it came about, and will tend to be a \nlarge number for an individual that is an ancestor of a large number \nmodern day individuals.\n\n&gt;[[relatedness of parent and child is 1/2 (with equal probability crossover) \n&gt;and parent and grand-child is 1/4...]]\n&gt;\n&gt;As you see, it varies according to how many generations you look ahead \n&gt;(e.g. the current-day IF of any T-Rex is zero...) and is an emergent \n&gt;property only visible after the event.\n&gt;  \n&gt;\nAs a side not I&#39;d just like to say that T-Rex as a species (particular \ncombination of genes) is dead, but most of those genes are still around \ntoday in modern day species, including homo-sapiens.  So T-Rex will \nscore zero, but if we focus in on individual genes we get a different \npicture. In fact, finding genes that have a high IF in nature will tend \nto identify very old genes that encode for fundamental structures such \nas cells, bone, organs, etc. Actually the highest scores will go to any \ngenes that made it into modern day insects, on account of their large \nnumbers.\n\n&gt;So in ES without an elite (&quot;comma strategy&quot; they call it) we are breeding \n&gt;not only for the ability to solve the problem presented, but also for the \n&gt;_ability_ to breed solutions to the problem.\n&gt;  \n&gt;\nI don&#39;t think keeping an elite is entirely incompatible with breeding an \nability to generate good solutions. Some elite might rarely spawn good \nsolutions, but that might be a better solution than any found by the \nmasses, because they could propogate by evolving the same mediocre \nsolutions over and over.\n\n&gt;Which is what closes the loop and allows the mutability parameters to \n&gt;evolve to useful values in parallel with the functional genes.  Whether \n&gt;they contribute to the search is a different question...\n&gt;  \n&gt;\nIt closes the loop but I&#39;m still concerned about the large amount of \ndrift that might occur in the meta genes. If you have identified an \noptimal set of meta-parameters then a NEAT search will progress more \nefficiently using that set of fixed params than if we allowed a search \nto continually drift around the search space.\n\n&gt;--\n&gt;\n&gt;Another point about this is that it is closely tied to mutual fertility \n&gt;between two individuals.  e.g. if two individuals are crossed over, \n&gt;depending on the compatibility between their genomes, then the offspring \n&gt;may be of similar fitness to the parents or else greatly reduced in \n&gt;fitness.  This is down to issues akin to the &quot;competing conventions&quot; problem.\n&gt;  \n&gt;\nA problem currently solved with historical markers and speciation, we \nalready have some parameters in this area that could be optimised \n(speciation threshold and the three coefficients), but maybe we could \nparameterize the compatibility function further - and therefore allow \nindividuals to effectively decide who they are compatible with (and \ntherefore who they wish to mate with) to a greater degree then they do now.\n\n&gt;Now, if there is no crossover, then there is no drive for the individuals \n&gt;to remain mutually fertile.  On the other hand, even if there is crossover, \n&gt;an immortal individual may have little drive to be fertile with the bulk of \n&gt;the population.\n&gt;\nOk but we kill the elite off eventually, and we define a species culling \nage to determine how long we are prepared to wait for an elite species \nto spawn off new better genomes.\n\n&gt;  Conversely, if the elite breeds with the non-elite, and if \n&gt;the elite father a largish proportion of the children, then the non-elite \n&gt;may be held back needing to remain compatible with the elite.\n&gt;  \n&gt;\nSpeciation currently prevents this sort of situation from occuring, but \nit&#39;s interesting to think about the kind of dynamicas that might be set \nup if we allow evolution more of a free reign. I can definitely see \nthat  an elite individual or species might propagate itself by mating \nwith other species to generate very poor offspring, thus keeping the \noriginal elite alive and the population as a whole supressed. So yeh, \nmaintaining elite individuals at the same time as evolving meta-genes is \nprobably a bad idea.\n\n\n\n&gt;--\n&gt;\n&gt;Another (vaguer) point is the difference between merely passing time and \n&gt;passing generations.  e.g. if we don&#39;t have an elite, then each individual \n&gt;lives one generation but during that generation gets only one chance to \n&gt;breed (or to be exact, once chance to breed a few times).  The reason this \n&gt;may matter is that, in nature, individuals frequently take note of their \n&gt;own breeding success when deciding whether to breed more.  e.g.\n&gt;\n&gt;(1) to some extent a bonded pair will keep having sex _until_ the female \n&gt;gets pregnant -- so any (minor) incompatibilities between them (which might \n&gt;kill the offspring in the womb) get overridden by persisting until they get \n&gt;lucky (without spewing out hundreds of offspring whether they get lucky or \n&gt;not).\n&gt;  \n&gt;\nIt&#39;s a good point, I think it would be extreme to only allow one round \nof mating before an individual dies, although a number of biological \nspecies use this model, so it&#39;s probably not that bad. So we could allow \nindividuals to stick around until they reach some pre-defined &#39;death&#39; \nage. This complicates how we keep the population down to a reasonable \nlevel, in nature the population of successful species tends increase as \nfar as resources allow - our resources are very limited inside a \ncomputer. I guess we just keep culling the weakest individuals to trim \nthe population back to a reasonable number as we do now.\n\n&gt;(3) in some species individuals pick a different partner each year, thei \n&gt;enables them to exploit (1) within the year but switch to somebody else in \n&gt;case they turn out completely infertile\n&gt;  \n&gt;\nThis ensures a good mix-up of the gene pool. Again, resisting urge to \ncrack bad jokes :)\n\n&gt;Food for thought...\n&gt;\n&gt;  \n&gt;\nInteresting stuff,\n\nColin.\n\n"}}