{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[{"name":"READ"}]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"userId":127853030,"authorName":"Colin Green","from":"Colin Green &lt;cgreen@...&gt;","profile":"alienseedpod","replyTo":"LIST","senderId":"M8I3cqn6L0DZExiJArHCTf6ooyqTTjZqXTeSxp9lSk63AYSwwKpipSkwDvrm8y_vKu2phOdhkCUmFCQJTf-ZCQSdmpwMvkd4cw","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [neat] Symmetry, concepts and data buses in the brain","postDate":"1106781330","msgId":1838,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDQxRjgyNDkyLjgwMjA2QGRzbC5waXBleC5jb20+","inReplyToHeader":"PGdpbGxhbS0wUzUvT0FpL3EyQWs0UUdlVnFxM2xONHkway9UZmNpQG1haWxibG9ja3MuY29tPg==","referencesHeader":"PDQxQzc0NDBCLjUwMTAzMDVAZHNsLnBpcGV4LmNvbT4gPGNxN3NmdCtoc29nQGVHcm91cHMuY29tPiA8Ni4yLjAuMTQuMC4yMDA0MTIyMTE3MjE1Ni4wM2JhNjJlOEBwb3AubWFpbC55YWhvby5jby51az4gPDQxRjJBRjYzLjcwNzA4MDJAZHNsLnBpcGV4LmNvbT4gPDAxYTUwMWM1MDBmMCQzYzJlZDNhMCQwZTE4YThjMEBKb3VybmV5PiA8Z2lsbGFtLTBTNS9PQWkvcTJBazRRR2VWcXEzbE40eTBrL1RmY2lAbWFpbGJsb2Nrcy5jb20+"},"prevInTopic":1837,"nextInTopic":1839,"prevInTime":1837,"nextInTime":1839,"topicId":1698,"numMessagesInTopic":40,"msgSnippet":"... Thanks. ... I think a lot of mystery has been spun around the idea of conciousness over the years. It is often (in books, documentaries, etc) discussed as ","rawEmail":"Return-Path: &lt;cgreen@...&gt;\r\nX-Sender: cgreen@...\r\nX-Apparently-To: neat@yahoogroups.com\r\nReceived: (qmail 94145 invoked from network); 26 Jan 2005 23:15:30 -0000\r\nReceived: from unknown (66.218.66.218)\n  by m3.grp.scd.yahoo.com with QMQP; 26 Jan 2005 23:15:30 -0000\r\nReceived: from unknown (HELO ranger.systems.pipex.net) (62.241.162.32)\n  by mta3.grp.scd.yahoo.com with SMTP; 26 Jan 2005 23:15:29 -0000\r\nReceived: from [10.0.0.10] (81-86-175-101.dsl.pipex.com [81.86.175.101])\n\tby ranger.systems.pipex.net (Postfix) with ESMTP id 2B639E00014C\n\tfor &lt;neat@yahoogroups.com&gt;; Wed, 26 Jan 2005 23:15:28 +0000 (GMT)\r\nMessage-ID: &lt;41F82492.80206@...&gt;\r\nDate: Wed, 26 Jan 2005 23:15:30 +0000\r\nUser-Agent: Mozilla Thunderbird 0.9 (Windows/20041103)\r\nX-Accept-Language: en-us, en\r\nMIME-Version: 1.0\r\nTo: neat@yahoogroups.com\r\nReferences: &lt;41C7440B.5010305@...&gt; &lt;cq7sft+hsog@...&gt; &lt;6.2.0.14.0.20041221172156.03ba62e8@...&gt; &lt;41F2AF63.7070802@...&gt; &lt;01a501c500f0$3c2ed3a0$0e18a8c0@Journey&gt; &lt;gillam-0S5/OAi/q2Ak4QGeVqq3lN4y0k/Tfci@...&gt;\r\nIn-Reply-To: &lt;gillam-0S5/OAi/q2Ak4QGeVqq3lN4y0k/Tfci@...&gt;\r\nContent-Type: text/plain; charset=ISO-8859-1; format=flowed\r\nContent-Transfer-Encoding: 7bit\r\nX-eGroups-Remote-IP: 62.241.162.32\r\nFrom: Colin Green &lt;cgreen@...&gt;\r\nSubject: Re: [neat] Symmetry, concepts and data buses in the brain\r\nX-Yahoo-Group-Post: member; u=127853030\r\nX-Yahoo-Profile: alienseedpod\r\n\r\nMichael Gillam wrote:\n\n&gt;Hi Colin,\n&gt;\n&gt;Interesting post!\n&gt;  \n&gt;\nThanks.\n\n&gt;Just to add a thought to the mix...\n&gt;\n&gt;One other possibility regarding consciousness is that it is an *emergent*\n&gt;property of the network (i.e. not a necessary pursuit and not necessarily\n&gt;real.)\n&gt;  \n&gt;\nI think a lot of mystery has been spun around the idea of conciousness \nover the years. It is often (in books, documentaries, etc) discussed as \nsome intangible concept that is probably beyond the human mind to \ncomprehend. I often recall a sentence in &#39;Plan and Purpose In Nature&#39; by \nGeorge Williams regarding early work on embyology:\n-----------\nThe &quot;intrinisc processes&quot; of development so impressed the early pioneers \nof experimental biology that many thought it obviously required \nsupernatural guidance.\n-----------\n\nAlthough development in biology is still not even close to being fully \nunderstood, we do understand some of the underlying principles that are \nat work and it&#39;s quite inconceivable (to me anyway) to suggest that some \nsupernatural forces are at work. And yet this is precisely what some \nhave suggested is behind the phenomenon of conciousness. I&#39;m going back \nprobably 10 years here but one case of this was Roger Penrose&#39;s book \nShadows Of The Mind in which he attempts to prove mathematically that \nconciousness cannot be described by an algorithm. He then goes on to \nsuggest that neuron mitochondria may be somehow describing a much finer \n(than relatively large neurons) information processing network that \noperates at the quantum physical level, perhaps tapping into some \nunknown physical dimension.\n\nNow, while it&#39;s an interesting idea it was my interpretation that the \nbook was effectively saying that conciousness is something which is \nsupernatural and mysterious and it just feels like passing the buck to me.\n\n&gt;We know that almost all known chemical and physicial processes proceed in a\n&gt;predetermined direction.  (i.e.  If you were to rewind time and start it\n&gt;playing again - the chemical/physical processes would proceed almost\n&gt;*exactly* the same.  I say almost - because new quantum theory suggests\n&gt;there is a level of inherent unpredictability which might suggest different\n&gt;outcomes.)\n&gt;  \n&gt;\nHaving recently done some reading on pseudo random number generators it \nmakes me wonder if the universe may be using such a generator ;)  And if \nwe could perhaps work out the algorithm, hmm :)\n\n&gt;We also know that we can detect thoughts *before* they become conscious.\n&gt;(i.e. a portion of neurons in your brain will simulate scratching your nose\n&gt;before you consciously decide - &quot;my nose itches&quot; and scratch it.)\n&gt;  \n&gt;\nSure there is a lot of subconcious activity invoved in things like \nimage, sound and sensation processing. A lot of this processing results \nin information that is deemed low value and so we never become aware of \nit. It&#39;s like there is a switching and prioritising system controlling \nwhat we are aware of.\n\n&gt;Taken together, these suggest that consciousness is a *secondary*\n&gt;phenomenon, and perhaps an *emergent* property of the network.\n&gt;  \n&gt;\nYes and no. From an evolutionary point of view it makes sense to have \nall of these sensory inputs to monitor your environment, because even \nwithout conciousness some simple rules can be applied (instinct) to aid \nsurvival, e.g. locating food, avoiding hazards. You can then imagine a \nsliding scale of complexity starting at simple systems such as plankton \nthat are able to sense their immediate environment and propel themselves \nin a basic manner, right up to something like a crocodile - which AFAIK \nonly has a very small brain that is equivalent to our limbic system. \nThat&#39;s why you can put your head inside a crocs mouth in certain \ncircumstances and it won&#39;t bite it off - by discovering what a croc&#39;s \ninstincts are some folks have been able to find gaps in their very \nsimple survival strategy such as this.\n\nNow consider that crocs have been around for millions of years without \nhardly changing from an evolutionary point of view. Perhaps they have \nreached the pinacle of what they can achieve without something \nequivalent to the frontal cortex of our brain, which is something which \nevolved after the limibic system but communicates very closely with it. \nThis new brain system takes in the same information but is able to \nprovide a new level of processing that the limbic system was incapable \nof, like make memories and associations between them.\n\nThis more abstract level of processing is what I reckon we would call \nconciousnessness, although I do think that any system that senses it&#39;s \nsurrounding in some way in order to drive it&#39;s behaviour is &#39;concious&#39; \nto some degree. So I think a croc would percieve me as a pice of \npossible prey, but it wouldn&#39;t percieve any fine detail such as, say, \nthe colour of my t-shirt :) (if they can even see in colour?). Taken to \nan extreme a plankton is &#39;concious&#39; of it&#39;s immediate surroundings and \nmy central heating thermostat is &#39;concious&#39; of the temp in this room.\n\nIt might sound silly but I don&#39;t think conciousness is an on/off thing \nthat is generated by some specific part of the brain, I think it&#39;s a \nconsequence of more and more information about our surroundings being \nprocessed in an ordered manner to drive our behaviour/survival - the \nmore deep and abstract the information, the deeper the level of \nconciousness.\n\nTaking the idea a step further, yes it is emergent but you can&#39;t just \nput a load of unordered complex systems together  and hope for \nemergence. The interface between the systems has to be ordered, and \nsurvival of the fittest just happens to have come up with just such an \nordered system of info processing.\n\n&gt;This observation suggests that a large enough and complex enough network\n&gt;could experience this emergent property.  The Internet itself could *think*\n&gt;it is sentient - despite the fact that, like us, its thoughts are\n&gt;predetermined.  This approach has interesting and dour predictions for\n&gt;communication between species.\n&gt;  \n&gt;\nThe internet is an intersting case to ponder. Think I&#39;ll leave that for \nanother day :)\n\n&gt;This approach also suggests that programmers do not have to worry about\n&gt;*building* consciousness into a system - it is an *emergent* property of an\n&gt;adequately complex adaptive network.\n&gt;  \n&gt;\nYeh but they need to build the complexity in an ordered and directed \nway. I think the Seed AI people are trying to achieve something like \nthis. Actually I don&#39;t think they mention conciousness in their goal, \nbut I suspect that what they are aiming to build would become concious \nif they ever succeeded.\n\nBTW in case you were wondering, none of these ideas are particularly \nnew, it&#39;s all just stuff I&#39;ve read elsewhere.\n\nColin.\n\n\n"}}