{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[{"name":"READ"}]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"userId":127853030,"authorName":"Colin Green","from":"Colin Green &lt;cgreen@...&gt;","profile":"alienseedpod","replyTo":"LIST","senderId":"X4mBSEMrQNeGhGi-IapXSahnOjQTaY8fQkyt0UhT7GQEJlcSAceM64X6-XC98D-rMzV7UE5ebxFTU5A-Bcsn_93BS3Y4qkaRmQ","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [neat] Can anbody help a Newbie?","postDate":"1115936570","msgId":1966,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDQyODNENzNBLjIwMzA3MDlAZHNsLnBpcGV4LmNvbT4=","inReplyToHeader":"PGQ1dW9taytkcHZwQGVHcm91cHMuY29tPg==","referencesHeader":"PGQ1dW9taytkcHZwQGVHcm91cHMuY29tPg=="},"prevInTopic":1964,"nextInTopic":0,"prevInTime":1965,"nextInTime":1967,"topicId":1964,"numMessagesInTopic":2,"msgSnippet":"Hi Roland, I m no expert but thinking back to my university days this sounds very much like Job Shop Scheduling. This is quite a large well researched topic,","rawEmail":"Return-Path: &lt;cgreen@...&gt;\r\nX-Sender: cgreen@...\r\nX-Apparently-To: neat@yahoogroups.com\r\nReceived: (qmail 63955 invoked from network); 12 May 2005 22:22:51 -0000\r\nReceived: from unknown (66.218.66.167)\n  by m24.grp.scd.yahoo.com with QMQP; 12 May 2005 22:22:51 -0000\r\nReceived: from unknown (HELO galaxy.systems.pipex.net) (62.241.162.31)\n  by mta6.grp.scd.yahoo.com with SMTP; 12 May 2005 22:22:50 -0000\r\nReceived: from [10.0.0.10] (81-86-175-101.dsl.pipex.com [81.86.175.101])\n\tby galaxy.systems.pipex.net (Postfix) with ESMTP id DA304E00021E\n\tfor &lt;neat@yahoogroups.com&gt;; Thu, 12 May 2005 23:22:49 +0100 (BST)\r\nMessage-ID: &lt;4283D73A.2030709@...&gt;\r\nDate: Thu, 12 May 2005 23:22:50 +0100\r\nUser-Agent: Mozilla Thunderbird 0.9 (Windows/20041103)\r\nX-Accept-Language: en-us, en\r\nMIME-Version: 1.0\r\nTo: neat@yahoogroups.com\r\nReferences: &lt;d5uomk+dpvp@...&gt;\r\nIn-Reply-To: &lt;d5uomk+dpvp@...&gt;\r\nContent-Type: text/plain; charset=ISO-8859-1; format=flowed\r\nContent-Transfer-Encoding: 7bit\r\nX-eGroups-Msg-Info: 1:12:0\r\nFrom: Colin Green &lt;cgreen@...&gt;\r\nSubject: Re: [neat] Can anbody help a Newbie?\r\nX-Yahoo-Group-Post: member; u=127853030\r\nX-Yahoo-Profile: alienseedpod\r\n\r\nHi Roland,\n\nI&#39;m no expert but thinking back to my university days this sounds very \nmuch like Job Shop Scheduling. This is quite a large well researched \ntopic, and so I would expect a google search or a trip to a good library \nor bookstore to be useful.\n\nGenerally though neuro-evolution techniques such as NEAT aren&#39;t ideally \nsuited to this type of problem, especially if the problem to be solved \nis fixed. By this I mean you are trying to solve a specific instance of \nthe problem with, say 2 machines and 3 buckets, instead of the general \ncase of  &quot;What is the best solutions given x machines and y buckets?&quot;.\n\nYou say you have attempted to test every possible combination - the \n&#39;brute force&#39; approach. And you probably discovered that the number of \ncombinations is very large and therefore you can&#39;t find a good solution \nin a reasonable amount of time (or even any time this millenium!). \nTherefore you might want to try a simple genetic algorithm which goes \nsomething like this:\n\n1) Start with a fixed population of randomly generated solutions. Say 500.\n2)  Evaluate each solution and assign a fitness value.\n3)  Generate offspring from the fittest solutions using crossover and/or \nmutation.\n4)  Goto 2. (next generation)\n\n\nThere are a great many variations on this theme. E.g. you can replace a \nsmall proportion of the population (keep the fittest solutions) per \ngeneration or the whole generation. How you represent the solutions is \nalso important, so e.g. if you can think of an encoding that represents \nonly legal solutions then that is a very good start. Otherwise you can \nassign a low fitness to solutions that are actually impossible (e.g. two \nmachines filling the same bucket at the same time), but this will \nusually require searching for far longer in order to find a good solution.\n\nThe fitness function is very imporatant, any errors in the function will \nnormally cause a search to find poor or completely useless solutions. \nHowever you can start out witha crude fitness function to test how well \nthe approach works for your problem and then fine tune it as time \nallows, so for example you could factor in what are termed soft \nconstraints, these are factors that won&#39;t make a solution invalid but \nthat you would rather avoid (e.g. limit the distance machines have to \ntravel between buckets).\n\nI would expect that there is already a lot of job-shop scheduling \nsoftware already in existence, so it&#39;s worth searching the web. If you \ndo decide to write your own code then there are open source genetic \nalgorithm code libraries available which might make the task \nconsiderably easier, following a little reading of documentation.\n\nHope that helps,\n\nColin.\n\n\n\nschuller_esa wrote:\n\n&gt;Hi! \n&gt;\n&gt;My Boss gave me the instruction to write Process optimizing Programm.\n&gt;First I thougt that it will be hard but possible. \n&gt;By now I have an working alogithm. Which does the Job quite well. But\n&gt;now I got some additional rules, so that my Programm produces just\n&gt;junk.\n&gt;\n&gt;Were the problem:\n&gt;I have a number of (lets call them Buckets) \n&gt;They are aligned in two rows.\n&gt;Then I have Two machinetypes. On for Filling and one for emtying the\n&gt;Buckets.\n&gt;The material has to go into one Bucket (stay for a while) then from\n&gt;this into anoter (again Stay) and into a third (stay) and then out.\n&gt;There are specific Buckets for each phase.\n&gt;\n&gt;Now I have some rules for the machines.\n&gt;one cannot go pass the other while it is filling.\n&gt;for emtying and filling it to another bucket i need two Machines.\n&gt;The buckets do not have eaquel size, but do always have to be full.\n&gt;An emtying machine must not leave a Bucket while it is not empty \n&gt;....\n&gt;\n&gt;Some rules differ on each Plant.\n&gt;The goal is to get as much material through the mashine.\n&gt;\n&gt;So how do I have to get startet?!\n&gt;I Tried to think of an algorithm which tries every possible\n&gt;Combination\n&gt;(You can go asleep while its working. :-&lt; )\n&gt;\n&gt;I discoverd NEAT for Delphi and thought that this could be the right\n&gt;thing. \n&gt;But I didn&#39;t find any Quickstart or similar to use it. What Functions\n&gt;do I have to call? And the biggest Question: How should I connect the\n&gt;Gene? (Which to take for Input and for Output?)\n&gt;\n&gt;Is there any chance of constant learning? What if it generates an\n&gt;output against one of of the Rules. How to tell it that it was wrong?\n&gt;\n&gt;Can anybody point me tho the right direction.\n&gt;Btw. I use Delphi but I accept Ideas in every language.\n&gt;\n&gt;Roland Schuller, AUSTRIA\n&gt;\n&gt;\n&gt;\n&gt;\n&gt;\n&gt; \n&gt;Yahoo! Groups Links\n&gt;\n&gt;\n&gt;\n&gt; \n&gt;\n&gt;\n&gt;\n&gt;  \n&gt;\n\n\n"}}