{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[{"name":"READ"}]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"userId":7192225,"authorName":"Ian Badcoe","from":"Ian Badcoe &lt;ian_badcoe@...&gt;","profile":"ian_badcoe","replyTo":"LIST","senderId":"g6e3bYo8leUGdIXbuBwxO6vLngbU8J5jCwLchbXFMn7ypBW8m7vpLL9Xj25nbYjdSckWtzQ-m4Od7sUGdvjO3T13vZMJtmg14Uo","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [neat] response to advice offered","postDate":"1116961610","msgId":1977,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDYuMi4wLjE0LjAuMjAwNTA1MjQxOTQ3MjEuMDM1ODRhMTBAcG9wLm1haWwueWFob28uY28udWs+","inReplyToHeader":"PGQ2djhpcitmaWNyQGVHcm91cHMuY29tPg==","referencesHeader":"PGQ2djhpcitmaWNyQGVHcm91cHMuY29tPg=="},"prevInTopic":1975,"nextInTopic":1978,"prevInTime":1976,"nextInTime":1978,"topicId":1975,"numMessagesInTopic":5,"msgSnippet":"Hi, ... Generally a good BSc is all that s required on paper and the rest is down to impressing the potential-supervisor when you speak to him/her... ","rawEmail":"Return-Path: &lt;ian_badcoe@...&gt;\r\nX-Sender: ian_badcoe@...\r\nX-Apparently-To: neat@yahoogroups.com\r\nReceived: (qmail 30373 invoked from network); 24 May 2005 19:04:32 -0000\r\nReceived: from unknown (66.218.66.218)\n  by m27.grp.scd.yahoo.com with QMQP; 24 May 2005 19:04:32 -0000\r\nReceived: from unknown (HELO cmailg1.svr.pol.co.uk) (195.92.195.171)\n  by mta3.grp.scd.yahoo.com with SMTP; 24 May 2005 19:04:32 -0000\r\nReceived: from modem-1684.lynx.dialup.pol.co.uk ([217.135.198.148] helo=giles.yahoo.co.uk)\n\tby cmailg1.svr.pol.co.uk with esmtp (Exim 4.41)\n\tid 1DaehT-0004eg-G5\n\tfor neat@yahoogroups.com; Tue, 24 May 2005 20:04:25 +0100\r\nMessage-Id: &lt;6.2.0.14.0.20050524194721.03584a10@...&gt;\r\nX-Mailer: QUALCOMM Windows Eudora Version 6.2.0.14\r\nDate: Tue, 24 May 2005 20:06:50 +0100\r\nTo: neat@yahoogroups.com\r\nIn-Reply-To: &lt;d6v8ir+ficr@...&gt;\r\nReferences: &lt;d6v8ir+ficr@...&gt;\r\nMime-Version: 1.0\r\nContent-Type: text/plain; charset=&quot;us-ascii&quot;; format=flowed\r\nX-eGroups-Msg-Info: 1:12:0\r\nFrom: Ian Badcoe &lt;ian_badcoe@...&gt;\r\nSubject: Re: [neat] response to advice offered\r\nX-Yahoo-Group-Post: member; u=7192225\r\nX-Yahoo-Profile: ian_badcoe\r\n\r\nHi,\n\nAt 14:01 24/05/2005, you wrote:\n&gt;Thanks so much for your input guys, it is GREATLY appreciated.  I&#39;ve\n&gt;been re-reading your posts several times now, exploring the Internet\n&gt;for information on Unis and thinking long and hard about my future.\n&gt;After all this, besides getting a headache, I have come up with a few\n&gt;key points:\n&gt;\n&gt;(1) I don&#39;t know if I&#39;m &quot;qualified&quot; to enter into a PhD programme at\n&gt;the moment.  More than anything else this is because I am not really\n&gt;sure what&#39;s involved in getting accepted.  I find that concrete\n&gt;information can be difficult to find on Universities&#39; websites.  From\n&gt;my limited exposure to the entry requirements, I have noticed that\n&gt;applicants are required to write comprehensive essays and give\n&gt;discussions on their interested topic, including its history.  I do\n&gt;feel that my enthusiasm is at about 1000%, after engrossing myself in\n&gt;the subject for the last year, but I don&#39;t know if I&#39;d live up to the\n&gt;PhD entry standards.\n\nGenerally a good BSc is all that&#39;s required on paper and the rest is down \nto impressing the potential-supervisor when you speak to him/her...\n\nEnthusiasm will help a lot, as will having already worked in a related area.\n\n&gt;Furthermore, correct me if I&#39;m wrong, but it seems that if I&#39;m\n&gt;interested in pursuing a PhD at a particular University, it is on me\n&gt;to: (a) come up with a project idea, (b) email the appropriate person,\n&gt;(c) convince them to fund me while I do the work at their institution.\n&gt;  While I certainly have the enthusiasm and the drive to accomplish\n&gt;such a feat, I wonder if I would be successful after only 0.5 years of\n&gt;experience in the subject itself.  I find it difficult to know who\n&gt;exactly to ask in a Uni such specific questions and I don&#39;t want to\n&gt;bother the department heads if I don&#39;t need to.\n\nI hesitate to answer, because clearly a few things have changed since my \ntime as a Ph.D. student.\n\nGenerally, however, this picture you paint seems a bit backwards.  Usually \nwhat will happen (used to happen) is that a supervisor will have funding \nfor a Ph.D. place and will look around for somebody to fill it.  You are at \na disadvantage compared to people who already did their first degree in \nthat department, simply because they will be known to the supervisor and \nalso first to hear of it.\n\nThe subject of the Ph.D. is usually worked out by interaction between you \nand the supervisor, and generally changes a bit over the course of the \nfirst year (mine went from enzyme kinetics and genetic engineering to \ncomputer simulation -- at one point I was just going to entitle it \n&quot;Studies.&quot; :) ).  How much of the subject is you and how much is the \nsupervisor depends on how the two of you get on.  You do here of people \nstudying something completely against the supervisors will, but a lot \ndepends on who &quot;owns&quot; the funding, e.g. a studentship is generally awarded \nto _you_ and in extreme cases can be transferred to another supervisor, \nwhereas a research-assistantship is generally awarded to the supervisor...\n\nHalf a years experience is a little low, but generally you learn what you \nneed for a Ph.D. during the Ph.D. itself, e.g. my undergraduate \nBiochemistry merely equipped me to _start_ learning thew techniques I \nneeded for a Ph.D. in enzyme kinetics, and when I switched to a \ncomputer-based approach I was essentially making it up myself....\n\n&gt;(2) Unfortunately, as I&#39;m sure you can all tell, this whole process is\n&gt;being rushed quite severely as I would like to continue studying ASAP\n&gt;and not take too long of a break in between.  Of course, I need to\n&gt;balance this with finding the right institution, which may prove\n&gt;difficult.  That being said, it appears that most of the North\n&gt;American Universities stopped accepting MSc applications several\n&gt;months ago.\n\nIn the UK, at least, Ph.Ds don&#39;t start at any particular time of \nyear.  Although they cluster around september, just because that&#39;s when all \nthe recent graduates get back from their holidays.  M.Sc.s come in two \nflavours &quot;by research&quot; and &quot;taught&quot;.  The former is 1/3 of a Ph.D, whereas \nthe latter is like an extra year of your B.Sc. course -- with the exception \nthat it will specialize a lot more.\n\n&gt;(3) Does anyone know of any Universities in Canada that are doing work\n&gt;in the fields being discussed here?  I&#39;ve looked myself and come up\n&gt;empty handed.  I&#39;ve also emailed the CompSci departments at Waterloo\n&gt;and UofT to get their opinion, but have yet to hear back.\n\nSorry, no idea.  You do have the biggest computer-game company in the world \nhowever... and I think they sponsor a certain amount of research.\n\n&gt;(4) Right, more opinions needed.  I&#39;ll be honest, I&#39;m VERY keen to do\n&gt;a PhD at UCF once Ken gets settled and gets the department up and\n&gt;running.\n\n25 years time then...\n\n&lt;ducks&gt;\n\nBut seriously, getting anything solid started in academia can take ages...\n\n&gt;   In the mean time, the University of Sussex&#39;s &quot;Evolutionary\n&gt;and Adaptive Systems&#39; MSc programme looks absolutely perfect for where\n&gt;I am right now.  My thinking is that the extra year of intensive NE\n&gt;work should provide me with a more thorough background in NE (and\n&gt;related subjects) and thus perhaps get me into these surely\n&gt;competitive programmes.  What do you guys think?  Is that overkill or\n&gt;does it seem like a reasonable plan?\n\nPresumably you have confirmed that NE is in this program and that at least \none staff member is keen on it?\n\ne.g. &quot;Evolutionary and Adaptive Systems&#39; doesn&#39;t _have_ to include any NE, \nand if it does may not include TWEAN and only focus on tweaking \nweights.  It depends on the staff involved.  e.g. what they teach you will \nfocus on their personal interests, surrounded by a halo of more general \nstuff, but if they personally dislike some approach, it can be reduced to a \nmere footnote.\n\nOther than that, it sounds excellent and if you can get money from \nsomewhere, it would be a very good set up for a Ph.D. plus giving you a \nyear to find one...\n\nBest of luck and hope I&#39;m not lying.\n\n\n         Ian\n\np.s. there must be resources to help you with this, web-sites, \ncareers-advisors, people you know from your last course...\n\nIn 15 minutes everybody will be in the future.\n\n\n\n"}}