{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[{"name":"READ"}]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"userId":127853030,"authorName":"Colin Green","from":"Colin Green &lt;cgreen@...&gt;","profile":"alienseedpod","replyTo":"LIST","senderId":"0mxITRP2zz0JoSeIGFrcb1vPCtb0BYVTKaNEIqLwZkBPLYUVOpKMAJnYA5JpD77COEn-tnEz8jYnkKZlTojeiAzHtXPK_5GIvQ","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [neat] Benchmarks?","postDate":"1121201912","msgId":2062,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDQyRDQyRUY4LjMwMTAyMDVAZHNsLnBpcGV4LmNvbT4=","inReplyToHeader":"PDYuMi4wLjE0LjAuMjAwNTA3MTIxMTU1MTguMDMyOTU5MDhAcG9wLm1haWwueWFob28uY28udWs+","referencesHeader":"PDQyQ0M1MDE5LjMwNDA4MDlAZHNsLnBpcGV4LmNvbT4gPFBpbmUuTE5YLjQuNjMuMDUwNzA3MTIyMzIxMC4yODk4OUBvcmFuZ2UtcGVrb2UuY3MudXRleGFzLmVkdT4gPDQyRDA4OTgwLjkwNjAwMDdAZHNsLnBpcGV4LmNvbT4gPDYuMi4wLjE0LjAuMjAwNTA3MTExNzI0MTcuMDMyMGRkMDBAcG9wLm1haWwueWFob28uY28udWs+IDw0MkQyRUQ2NC41MDAwMzA0QGRzbC5waXBleC5jb20+IDw2LjIuMC4xNC4wLjIwMDUwNzEyMTE1NTE4LjAzMjk1OTA4QHBvcC5tYWlsLnlhaG9vLmNvLnVrPg=="},"prevInTopic":2061,"nextInTopic":2065,"prevInTime":2061,"nextInTime":2063,"topicId":2028,"numMessagesInTopic":33,"msgSnippet":"... Yes. I evaluate against *all* entries in the chain - I don t bail out on the first failure. And by beat I mean a player scores more over all 16 games. So","rawEmail":"Return-Path: &lt;cgreen@...&gt;\r\nX-Sender: cgreen@...\r\nX-Apparently-To: neat@yahoogroups.com\r\nReceived: (qmail 71417 invoked from network); 12 Jul 2005 20:58:10 -0000\r\nReceived: from unknown (66.218.66.166)\n  by m28.grp.scd.yahoo.com with QMQP; 12 Jul 2005 20:58:10 -0000\r\nReceived: from unknown (HELO ranger.systems.pipex.net) (62.241.162.32)\n  by mta5.grp.scd.yahoo.com with SMTP; 12 Jul 2005 20:58:10 -0000\r\nReceived: from [10.0.0.10] (81-86-175-101.dsl.pipex.com [81.86.175.101])\n\tby ranger.systems.pipex.net (Postfix) with ESMTP id 977C6E00033D\n\tfor &lt;neat@yahoogroups.com&gt;; Tue, 12 Jul 2005 21:58:09 +0100 (BST)\r\nMessage-ID: &lt;42D42EF8.3010205@...&gt;\r\nDate: Tue, 12 Jul 2005 21:58:32 +0100\r\nUser-Agent: Mozilla Thunderbird 1.0.2 (Windows/20050317)\r\nX-Accept-Language: en-us, en\r\nMIME-Version: 1.0\r\nTo: neat@yahoogroups.com\r\nReferences: &lt;42CC5019.3040809@...&gt; &lt;Pine.LNX.4.63.0507071223210.28989@...&gt; &lt;42D08980.9060007@...&gt; &lt;6.2.0.14.0.20050711172417.0320dd00@...&gt; &lt;42D2ED64.5000304@...&gt; &lt;6.2.0.14.0.20050712115518.03295908@...&gt;\r\nIn-Reply-To: &lt;6.2.0.14.0.20050712115518.03295908@...&gt;\r\nContent-Type: text/plain; charset=ISO-8859-1; format=flowed\r\nContent-Transfer-Encoding: 7bit\r\nX-eGroups-Msg-Info: 1:12:0\r\nFrom: Colin Green &lt;cgreen@...&gt;\r\nSubject: Re: [neat] Benchmarks?\r\nX-Yahoo-Group-Post: member; u=127853030; y=oH2ZwlA1hfrIuA1hn3OLFc8L8Km3St3iz8PPDoduPxweBP4aggzz\r\nX-Yahoo-Profile: alienseedpod\r\n\r\nIan Badcoe wrote:\n\n&gt;At 23:06 11/07/2005, you wrote:\n&gt;  \n&gt;\n&gt;&gt;\n&gt;&gt;1) In the first generation all players play each other and the best one\n&gt;&gt;becomes the first entry in the &#39;pareto dominance chain&#39; (to be honest\n&gt;&gt;though picking a random player is just as good).\n&gt;&gt;2) All subsequent evaluations are made by playing each entry in the\n&gt;&gt;chain. Fitness against each entry is multiplied by that entry&#39;s index+1,\n&gt;&gt;since later entries are deemed to be better players, and therefore\n&gt;&gt;scoring points against them is mostly better than points against earlier\n&gt;&gt;entries, mostly.\n&gt;&gt;3) If 1 or more players in a gen beats all of the entries in the chain\n&gt;&gt;then one of these is selected to be a new entry on the end of the chain.\n&gt;&gt;If there is more than one candidate with the same high score then just\n&gt;&gt;pick one at random (actually pick the last one I think, this doesn&#39;t\n&gt;&gt;matter).\n&gt;&gt;    \n&gt;&gt;\n&gt;\n&gt;Why treat the chain as an ordered set of tests?  e.g. if a player could \n&gt;beat all _except_ the first in the chain, shouldn&#39;t that be regarded as \n&gt;very fit?\n&gt;  \n&gt;\nYes. I evaluate against *all* entries in the chain - I don&#39;t bail out on \nthe first failure. And by &#39;beat&#39; I mean a player scores more over all 16 \ngames. So that might be 15 draws and 1 win. When this happens the player \nwith the higher score is deemd to be better than the other - which of \ncourse may not be the case in a wider context, e.g. playing a really \ngood player with knowledge of lots of different strategies.\n\n&gt;I guess the answer is &quot;CPU&quot;?\n&gt;  \n&gt;\nIt&#39;s all about CPU really. But I have distributed NEAT and possibly some \nmore optimisation up my sleeve yet :)\n\n&gt;&gt;I think Ken & Risto use a dominace chain in &quot;Competetive Coevolution\n&gt;&gt;through Evolutionary Complexification&quot; (2004), but this is only for\n&gt;&gt;monitoring progress of the co-evolution search proper. I instead use\n&gt;&gt;this as the basis for evaluation. This has a few side effects:\n&gt;&gt;\n&gt;&gt;1) Populations cannot ebb and flow between a few strategies, e.g.\n&gt;&gt;strategy A beats B, B beats C and C beats A. Repeat ad infinitum.\n&gt;&gt;2) Fitness is relative to the dominance chain, and so a higher fitness\n&gt;&gt;implies a better genome overall not just within the context of the\n&gt;&gt;current population.\n&gt;&gt;    \n&gt;&gt;\n&gt;\n&gt;This is true and a useful property.  However it does have the drawback of \n&gt;making the fitness in two runs non-comparable with each other.\n&gt;  \n&gt;\nTrue but this is a drawback of most co-ev set ups. If we do want to \nmeasure the relative strength of players or populations from different \nexperiments then we can play them against each other in seperate \ntournaments. Of course a purely scientific and exact measure of any \ngiven stragety is a problem for science (and/or philosophy) as a whole \nnot just co-ev experiments, e.g. DeepBlue beat Kasparov, but who was the \nbetter player overall? and were they 10% better, 20%?\n\n&gt;&gt;[...]\n&gt;&gt;\n&gt;&gt;In my first experiments the chain length maxed out at around the\n&gt;&gt;mid-20&#39;s in length and the populations best players were poor. So why\n&gt;&gt;can&#39;t they beat the still relatively poor players in the chain? I\n&gt;&gt;hypothesized that they probably could, given enough time, but because of\n&gt;&gt;the narrow range of strategies represented by the chain most beneficial\n&gt;&gt;mutations/crossovers (against other strageties) are being discarded\n&gt;&gt;because the fitness function doesn&#39;t evaluate these aspects of play yet.\n&gt;&gt;    \n&gt;&gt;\n&gt;\n&gt;You do have the problem that until a strategy appears in the chain, there \n&gt;is no drive to create a solution to it.\n&gt;  \n&gt;\nThis is an inherent problem with all co-ev strategies. Perhaps \nexascerbated by the fact that the chain represents a smaller set of \nstrategies to evaluate against at any given time, in comparison say to a \ntournanment involving a whole poplulation.\n\n&gt;But I would have thought that for a &quot;simple&quot; game like TTT this would form \n&gt;only a minor probability barrier.  Is it possible that your representation \n&gt;is limiting evolution in some way?\n&gt;  \n&gt;\nNo co-ev experiment can evaluate performance against all possible \nstrategies at each evaluation. Hence when I did a simplistic 2 game eval \n(instead of 16) I was effectively testing less strategies and therefore \ndiscarding some good solutions. Now I&#39;m discarding less good solutions, \nbut it takes longer to evaluate. It&#39;s a balance, but the real question \nis - will a given technique lead us to good solutions within a \nreasonable amount of real time or will it lead us into a poor local optimum?\n\n&gt;[...]\n&gt;  \n&gt;\n&gt;&gt; Playing ANN&#39;s in all\n&gt;&gt;16 configurations gives a much better indication of their relative\n&gt;&gt;strength and also causes the ANNs to play a different/wider set of\n&gt;&gt;strategies.\n&gt;&gt;    \n&gt;&gt;\n&gt;\n&gt;This is a good way to increase the situations considered.\n&gt;But my view (which you probably know :) would be that we need a way of \n&gt;setting up the networks to be rotationally invariant before they would have \n&gt;much chance of finding the &quot;essence&quot; of the game.\n&gt;  \n&gt;\nI&#39;m not sure I understand this point. Are you hinting at some higher \nlevel representation of the game where rotation is factored out. \nInteresting, but if I have to construct complex representation models \nfor every problem I approach, then that takes a lot of the fun out of \nthe idea that I can just throw together a reasonably simple/sensible \nmodel and go do something else while NEAT does the hard work for me!\n\n&gt;Damn, you motivated me, I want to work on this now!\n&gt;  \n&gt;\nSorry.\n\n&gt;I&#39;d like to work in C++, what NEAT version would be best.  Just scanning \n&gt;the list there&#39;s Ken&#39;s and Mat&#39;s.  I&#39;m generally on Windows, OTOH I don&#39;t \n&gt;especially care about graphics for this, so....\n&gt;  \n&gt;\nHey look, I just spent a day of my life chasing correct combinations of \nunix packages to build mono, which just re-affirms my faith in Java and \n.Net - you can actually get on and do what you want to do, instead of \nscanning google for references to some obscure error from a makefile or \nconfig script! [takes deep breath... and relax]  ;)\n\n&gt;  \n&gt;\n&gt;&gt;[Back to the dominance chain idea...]\n&gt;&gt;    \n&gt;&gt;\n&gt;\n&gt;Could you keep stats on how many of the incoming players each member of the \n&gt;chain is able to defeat.  Then the one to trim would be the one showing the \n&gt;least relevance to recent populations.\n&gt;  \n&gt;\nYeh I was thinking of ways I could &#39;collapse&#39; the chain - extract the \nwheat from the chaff so to speak. I&#39;ll have a think about that. It did \noccur to me today that a more pure form of the dominance chain is a \ndominance n-ary tree, but that would generate even more players to eval \nagainst. On the other hand such a technique may be necessary for games \nthat are less trivial than TTT.\n\n&gt;Another idea might be to make the chain a set, and test all players against \n&gt;all set members.\n&gt;\nYep, as I say, this is how it&#39;s currently set up.\n\n&gt;  That costs more, BUT if you limit the size of the set, \n&gt;AND consider new entries to the set on the ability to beat a _different_ \n&gt;subset of the players from the other members of the set...\n&gt;  \n&gt;\nWe need some way of clustering the strategies based on strategy and then \nwe can just chuck out all but one or networks from each cluster. We need \nsomethin like NEAT&#39;s genome compatibility measure, but a measure of \nstrategy compatibiity. Perhaps the genome compatibility is a good \nheuristic for this? Ken & Risto uses this idea in the co-ev paper I \nrefered to previously.\n\nActually further point I&#39;d like to make is that the chain may contain a \nwider variety of strategies than you migth think, since each new entry \nmust beat all other entries. As soon as a new entry is placed on the \nchain the new goal for evolution is to beat the champion from the \nprevious generation, which may actually represent the predominant \nstrategy in the population. The population is now forced to find new \nstrategies, but without comprimsing performance against old strategies \nstill rpesent on teh dominance chain. \n\nAnother point is that early entries in the chain are likely to be really \n&#39;stupid&#39; strategies - and keeping these may actually be good since if \nyou evolve against good players you ight not be looking out for &#39;stupid&#39; \nmoves. So throwing away old entries on the chain in a &#39;sliding window&#39; \napproach might not be ideal - the wheat/chaff approach looks more \npromising to me.\n\nColin.\n\n\n"}}