{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[{"name":"READ"}]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"userId":230616336,"authorName":"lars_v_hansen","from":"&quot;lars_v_hansen&quot; &lt;lvh@...&gt;","profile":"lars_v_hansen","replyTo":"LIST","senderId":"eQsnGDG7_J7KRivcEf1meerIvVODI_pJJY6Q88uH4A4ACXttHKZQtYDXTohQ_o39VTf5_anicsdd8M2zwOUGv4uECRW_6gSF","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: NEAT Applied to Texas Hold&#39;em Poker","postDate":"1121366058","msgId":2084,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGRiNmI3YSt0M2hoQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDE5YjEwZDUxMDUwNzE0MDcwOTQ4YTkzM2RkQG1haWwuZ21haWwuY29tPg=="},"prevInTopic":2082,"nextInTopic":2104,"prevInTime":2083,"nextInTime":2085,"topicId":2080,"numMessagesInTopic":7,"msgSnippet":"... Hi Derek Thank you for the swift reply ;-) There I thought I wrote a therral posting but I guess I missed a few things... ... Our thesis is due in","rawEmail":"Return-Path: &lt;lvh@...&gt;\r\nX-Sender: lvh@...\r\nX-Apparently-To: neat@yahoogroups.com\r\nReceived: (qmail 81795 invoked from network); 14 Jul 2005 18:35:21 -0000\r\nReceived: from unknown (66.218.66.166)\n  by m25.grp.scd.yahoo.com with QMQP; 14 Jul 2005 18:35:21 -0000\r\nReceived: from unknown (HELO n13a.bulk.scd.yahoo.com) (66.94.237.24)\n  by mta5.grp.scd.yahoo.com with SMTP; 14 Jul 2005 18:35:21 -0000\r\nComment: DomainKeys? See http://antispam.yahoo.com/domainkeys\r\nReceived: from [66.218.69.4] by n13.bulk.scd.yahoo.com with NNFMP; 14 Jul 2005 18:34:19 -0000\r\nReceived: from [66.218.66.74] by mailer4.bulk.scd.yahoo.com with NNFMP; 14 Jul 2005 18:34:19 -0000\r\nDate: Thu, 14 Jul 2005 18:34:18 -0000\r\nTo: neat@yahoogroups.com\r\nMessage-ID: &lt;db6b7a+t3hh@...&gt;\r\nIn-Reply-To: &lt;19b10d51050714070948a933dd@...&gt;\r\nUser-Agent: eGroups-EW/0.82\r\nMIME-Version: 1.0\r\nContent-Type: text/plain; charset=ISO-8859-1\r\nContent-Length: 9076\r\nX-Mailer: Yahoo Groups Message Poster\r\nX-Yahoo-Newman-Property: groups-compose\r\nX-eGroups-Msg-Info: 1:12:0\r\nFrom: &quot;lars_v_hansen&quot; &lt;lvh@...&gt;\r\nSubject: Re: NEAT Applied to Texas Hold&#39;em Poker\r\nX-Yahoo-Group-Post: member; u=230616336; y=rgeRn4bB5PBTy_uZYaBsa--ytUTtbP7AMeEDpqSPk4K_z94zrWRy1Q\r\nX-Yahoo-Profile: lars_v_hansen\r\n\r\n--- In neat@yahoogroups.com, Derek James &lt;djames@g...&gt; wrote:\n&gt; On 7/14/05, lars_v_hansen &lt;lvh@d...&gt; wrote:\n&gt; &gt; Hi Everyone\n&gt; &gt; \n&gt; &gt; My name is Lars and I am a student at Department of Computer Science,\n&gt; &gt; University of Aarhus, Denmark. I am writing my Master Thesis with my\n&gt; &gt; good friend Mathias who is also a student here ;-). As you probably\n&gt; &gt; already noticed this thesis is about poker (Texas Hold&#39;em) and GAs.\n&gt; \n&gt; Hi Lars...welcome to the group. :)  Yes, we are very interested in\n&gt; applying neuroevolution to Poker in general and Texas Hold &#39;Em in\n&gt; particular.  It&#39;s nice to hear you&#39;re working on this problem, and\n&gt; that you&#39;re already familiar with the work of the Alberta group.\n\nHi Derek\n\nThank you for the swift reply ;-)\n\nThere I thought I wrote a therral posting but I guess I missed a few\nthings...\n\n&gt;  \n&gt; &gt; We just recently discovered NEAT (sadly :-() \n&gt; \n&gt; \n&gt; When is your thesis due? ;)\n&gt; \n\n\nOur thesis is due in September or October depending on how we progress :-)\n\n\n\n&gt; Before I comment on the rest of your mail, I have a few questions:\n&gt; \n&gt; 1) You don&#39;t say how well your evolved networks perform...how are you\n&gt; evaluating the performance of your resulting networks?  Are you\n&gt; playing them on the Poki server?\n&gt; \n\nWe haven&#39;t achieved much yet which is why we havent done much\nevaluating except from letting them play against the pot-odds players\n- they never won against these players. \n\nWhen (and IF) we get players that are able to play better than the\nPO-players we would like to evaluate them on the Poki server - we also\nbought the Poki software in order to be prepared for our monster\nplayers but they havent spawned from our little test-bed yet!\n\n&gt; 2) Is the domain limit/pot limit/no limit?  Maybe you mentioned this\n&gt; and I missed it, but it&#39;s a pretty big deal.  I think it would be much\n&gt; more difficult to gauge fitness as the amount to be able to bet in a\n&gt; single turn increases.  Limit is probably the least noisy of the three\n&gt; variations.\n&gt; \n\n\n\n\nOur domain is limit. \n\n\n\n\n&gt; 3) Do your networks use recurrent connections?\n&gt; \n\nWe have allowed for recurrent connections.\n\n&gt; 4) So do your networks always play 10 opponents?  If players are\n&gt; eliminated at a table (they run out of money), do the networks play\n&gt; 9-way hands?  Do the winners eventually play heads up?\n&gt; \n\n\n\n\nNo sometimes the players went broke and the rest continued but they\nalmost NEVER in the millions of evaluations ended in heads up since\nour players always exit the table first and when our five players\nexited we stop the game on the table.\n\n\n\n\n\n&gt; &gt; and yesterday we finished\n&gt; &gt; a new player based on jNEAT. The player ANN takes the following\n&gt; &gt; inputs:\n&gt; &gt; \n&gt; &gt; 1 pot / bet\n&gt; \n&gt; This seems fine.\n&gt; \n&gt; &gt; 1 position\n&gt; \n&gt; Is this relative or absolute?  If this input is just an integer value\n&gt; between 0 and 9 that may not be as useful as knowing it&#39;s distance to\n&gt; the button each hand.\n\n\n\nThe players position is normalized to the size of the active players\n(in the current round) at the table. This gives us a worse position if\nwe are 1 out of 10 than if we are 1 out of 5.\n\n\n\n\n\n&gt; \n&gt; &gt; 9 player actions this round\n&gt; \n&gt; So all the actions are taken and then input to the network on its\nturn?  \n\n\n\nThe actions up until the current players turn (to take action) are\nencoded - the rest aren&#39;t.\n\n\n\n&gt; \n&gt; &gt; 9 player passive / aggressive index\n&gt; &gt; 9 player tight / loose index\n&gt; \n&gt; How are you getting these values?  Are you using other networks for\n&gt; opponent modeling, as Billings et al are doing?\n\n\n\nThese indexes are computed by the following numbers:\nTight / Loosindex: aPlayer.flopsSeen / table.handNumber\nPassive / Aggressive: aPlayer.postFlopBets / aPlayer.flopsSeen;\n\n\n&gt; \n&gt; &gt; 2 suit count (4 or 5 siuted cards)\n&gt; &gt; 2 connector count (4 or 5 connected cards)\n&gt; &gt; 4 card associations (pair, two pairs, three of a kind, four of a kind)\n&gt; \n&gt; Well, the problem I see with this representation right off the bat is\n&gt; that there is no information about the order/strength of the cards,\n&gt; unless I&#39;m not understanding.\n&gt; \n&gt; Would the network receive the same input for a pair of jacks as for a\n&gt; pair of 2&#39;s?  If so, the representation is seriously flawed.\n\n\n\nI just forgot a couple of inputs ;-) Here they come:\n\nMOST_SIGNIFICANT_CARD: Most significant card in any hand\n\nLEAST_SIGNIFICANT_CARD: least significant in hands with combinations\nlike two pairs or full house\n\nKICKER: kicker only applies to hands that does not use all 5 cards: a\npair, two pairs, three of a kind, four of a kind\n\n\n\n\n&gt; \n&gt; Also, connectivity is important, but again rank is also important. \n&gt; A/2/3/4 is much worse than 8/9/10/J not only because it&#39;s lower but\n&gt; because the latter is open-ended (a straight can be made with a 7 or\n&gt; Q, while for the first one a straight can only be made with a 5).\n&gt; \n&gt; Philip and I have talked over the representation of Hold Em a bit.  I\n&gt; don&#39;t have any easy answers, but I do think you need at least one\n&gt; input for the strength of your best combination.  So an input for\n&gt; pairs might tell the network it has a pair, and another input would\n&gt; scale between 0 and 1 to indicate the strength (and you might want to\n&gt; skew this toward higher pairs).\n&gt; \n&gt; &gt; 2 hole cards in use ( are we using 1 or 2 hole cards in our hand?)\n&gt; &gt; 3 game stage (FLOP/TURN/RIVER)\n&gt; \n&gt; These seem all right, though possibly superflous.  Others may have\nthoughts.\n&gt; \n&gt; &gt; The outputs from the ANN are straight forward:\n&gt; &gt; 3 neurons:\n&gt; &gt; FOLD | CALL | BET/RAISE\n&gt; \n&gt; Yep...sounds good. \n&gt; \n&gt; &gt; The 50 players play against each other and a pot-odds-player\n&gt; &gt; (PO-player) - five of each at each table. They play 600 hands but not\n&gt; &gt; at one table only - we mix them between the tables five times such\n&gt; &gt; that they get to meet different individuals from the entire\n&gt; &gt; population.\n&gt; \n&gt; How often do you switch them?  It often takes a while for someone to\n&gt; get a read on another player, and in this case they are playing full\n&gt; tables.  If the individual networks are having to assess the\n&gt; tightness/looseness aggressiveness/passiveness of the players at their\n&gt; table, this is a big burden on the network, and if they are switching\n&gt; opponents every 10 hands or so, it is even more difficult.\n&gt; \n\n\n\nWe usually do not switch the players unless they have played at least\n120 hands (600 hands / five different tables).\n\n\n\n&gt; &gt; The reason we have the PO-players at each table is for the players to\n&gt; &gt; be forced to learn faster and play tighter from the very beginning.\n&gt; \n&gt; Yes, this makes sense.  And personally I would not remove this player\n&gt; from your evolutionary runs.  It makes sense to have a hand-coded\n&gt; standard in among the other players as a baseline.  It&#39;s performance\n&gt; across generations should give you a decent idea of how your algorithm\n&gt; is progressing.\n\n\n\nOK - this is a bit of a problem because then we still have twice as\nmany players as the actual population for evolution - but I guess we\ncannot get around this.\n\n\n\n&gt; \n&gt; &gt; A major concern is the fitness: We have talked about it for hours and\n&gt; &gt; days but we always come back to the cash of the player. If we cannot\n&gt; &gt; apply expert knowledge - we cannot think of anything else than the\n&gt; &gt; amount earned after x hands.\n&gt; \n&gt; Well, that is the standard of fitness for real Poker players, isn&#39;t\nit? :)\n&gt; \n&gt; I would think this would make the most sense as the primary fitness\n&gt; value.  Another alternative would be to simply play an elimination\n&gt; tournament and then assign fitness based on the place each network\n&gt; finished.  It depends on whether you want to evolve networks geared\n&gt; more toward tournament play or come-and-go style Poker.\n&gt; \n&gt; &gt; 1) Is it possible to achieve results with a 45-&gt;N-&gt;3 ANN in NEAT?\n&gt; \n&gt; I wouldn&#39;t see why not.  Have you achieved any results?  I think you\n&gt; could reduce your input space for opponent actions, especially since\n&gt; in cases where the network is playing heads up, 24 of your inputs\n&gt; aren&#39;t even going to be used each hand.\n&gt; \n&gt; &gt; 2) Any general comments regarding the population size for the above\n&gt; &gt; ANN?\n&gt; \n&gt; I would think the general consensus would be that large populations\n&gt; are better for difficult problems, and in the case of NEAT tolerate\n&gt; higher mutation rates and more diversity.  But it kind of depends on\n&gt; your computational resources, doesn&#39;t it?  How long does a run with\n&gt; 600 individuals take?\n&gt; \n&gt; Also, you mention Fogel and his evolved Checkers player.  Those runs\n&gt; only had a population of 30.\n&gt; \n&gt; &gt; 3) Any parameters we should put in a particular favourable setting?\n&gt; \n&gt; Parameters like mutation rates and speciation variables seem pretty\n&gt; idiosyncratic to me.  Again, if it&#39;s a large population, it&#39;s more\n&gt; tolerant to higher mutation rates and greater speciation, but I do\n&gt; think there&#39;s a certain amount of hand tuning of these parameters that\n&gt; you just can&#39;t get around.\n&gt; \n&gt; Anyway, it&#39;s nice to hear someone working on this.  We&#39;re definitely\n&gt; interested in hearing more.\n&gt; \n&gt; Derek\n\nThank you very much for your insights - I will incorporate some of\nyour ideas and report back how it progresses.\n\n\nBest regards\n\nLars\n\n\n\n\n\n"}}