{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[{"name":"READ"}]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"userId":170210925,"authorName":"Ashot_Petrosian","from":"&quot;Ashot_Petrosian&quot; &lt;ashot@...&gt;","profile":"Ashot_Petrosian","replyTo":"LIST","senderId":"mmn0FtpQDENIVATH0hyXSHsTk8sr_OGv5iuI9m1aYPA3wPuiTWYWoWerm6lwmDN5aNVBZg8ilESNjogQLaLI-0FGAsRyxaPUBy5x77dHN7E","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Introduction/Some Questions","postDate":"1121411022","msgId":2088,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGRiN240ZStqOXNmQGVHcm91cHMuY29tPg=="},"prevInTopic":0,"nextInTopic":2090,"prevInTime":2087,"nextInTime":2089,"topicId":2088,"numMessagesInTopic":13,"msgSnippet":"Hi everyone, I ve been reading this list for the past few weeks and now seems like a good time to pipe in.  My name is Ashot and I ve been working on a ","rawEmail":"Return-Path: &lt;ashot@...&gt;\r\nX-Sender: ashot@...\r\nX-Apparently-To: neat@yahoogroups.com\r\nReceived: (qmail 4042 invoked from network); 15 Jul 2005 07:04:27 -0000\r\nReceived: from unknown (66.218.66.166)\n  by m26.grp.scd.yahoo.com with QMQP; 15 Jul 2005 07:04:27 -0000\r\nReceived: from unknown (HELO n6a.bulk.scd.yahoo.com) (66.94.237.40)\n  by mta5.grp.scd.yahoo.com with SMTP; 15 Jul 2005 07:04:27 -0000\r\nComment: DomainKeys? See http://antispam.yahoo.com/domainkeys\r\nReceived: from [66.218.69.1] by n6.bulk.scd.yahoo.com with NNFMP; 15 Jul 2005 07:03:44 -0000\r\nReceived: from [66.218.66.70] by mailer1.bulk.scd.yahoo.com with NNFMP; 15 Jul 2005 07:03:44 -0000\r\nDate: Fri, 15 Jul 2005 07:03:42 -0000\r\nTo: neat@yahoogroups.com\r\nMessage-ID: &lt;db7n4e+j9sf@...&gt;\r\nUser-Agent: eGroups-EW/0.82\r\nMIME-Version: 1.0\r\nContent-Type: text/plain; charset=ISO-8859-1\r\nContent-Length: 4700\r\nX-Mailer: Yahoo Groups Message Poster\r\nX-Yahoo-Newman-Property: groups-compose\r\nX-eGroups-Msg-Info: 1:12:0\r\nFrom: &quot;Ashot_Petrosian&quot; &lt;ashot@...&gt;\r\nSubject: Introduction/Some Questions\r\nX-Yahoo-Group-Post: member; u=170210925; y=2PQwtE9ZAJVDrs0L62cmDkLv9X6JeyZRPSZuzIXjQJyj1vuElW7l8Sa8\r\nX-Yahoo-Profile: Ashot_Petrosian\r\n\r\nHi everyone,\n\tI&#39;ve been reading this list for the past few weeks and now seems like \na good time to pipe in.  My name is Ashot and I&#39;ve been working on a \nresearch project with Risto officially since January but in reality \nessentially over the past month or so.  At this point I have \nreimplemented and recreated the base functionality in the papers (see \nmy other post for more details) and now I need to pick a concrete \ndirection for my research, which I am having trouble with because I \nhave so many brilliant ideas ;)  I thought I would sound off some of \nmy thoughts/questions here to help me decide.  I have read some, but \nnot all of the posts on the list and I&#39;m relatively new to the field, \nso I&#39;m sorry if any of this is redundant, naive, or just incorrect.\n\tMy initial idea was a type of modular NEAT. Essentially the way it \nworks is that each new innovation actually creates a coevolving NEAT \npopulation which starts as simple but can complexify (which then have \nnodes which can complexify).  Every network that uses this innovation \nwould actually share the same &#39;module&#39; which would be the module with \nthe best average fitness across all networks.  Modules would be \nevolved for several generations before the &#39;top&#39; NEAT population was \ngiven one generation.  The benefits here are that this would allow \nevolution to choose the level of modularity that was fitting for the \nproblem, would be a continous &#39;evolution&#39;(pardon) on NEAT rather than \na radical change (in other words it reduces to NEAT), and would solve \nthe problem of adding on new modules while maintaining smooth mutation \n(by starting them small).  Sort of an ESP meets NEAT idea perhaps.  \nI&#39;ve looked over some of Joe&#39;s stuff, but I think this is different in \nthat modularity is optional rather than forced.\n\tThe main questions with this approach is what the base building block \nshould be and how to produce the inital selection pressure for \nmodularity (since the &#39;module&#39; would be used in the same network).  \nThe building block can be just a node, just a link, or more.  By more \nperhaps the new module should have the option of connecting from a \nrandom set of up to n to another random set of up to n nodes.  By \nchanging the n we can have different binding specificty for the \nmodules.\n\t\n\tThink along these lines brought up some other questions.  When NEAT \nadds a node it actually is functionally no different then a weight \nmutation (with the exception of the non-linearity of the sigmoid).  \nFor a node to really add functionality above what direct link can \naccomplish it must at least have two inputs or two outputs.  So for \nNEAT to take advantage of a new node mutation it actually has to get \nlucky twice, once to add node in the right place, and another two add \na link to/from it.  I think in general this problem is sidestepped by \nhaving a much higher add-connection rate.  If I&#39;m right on this (am I?\n) then perhaps the mutation should  be changed to add a node which \nconnects two inputs/outputs simulatneously, or n inputs/outputs? \n\tAlong the same lines of thinking, has anyone tried using more \npowerful functions at the nodes rather than just a threshold? For \nexample an average, or maximum, or minimum, or a switch, or so on?  \nThe only place I could find something similar to this was in Karl Sims \nold stuff on virtual creatures, but it was only a sidenote and not the \nfocus of the paper.  Essentially it seems like more powerful operators \nshould give the networks much more power and we can still keep the \nmutations incremental by being clever.  The only drawback I see here \nis that this is less biologically &#39;accurate&#39;, but this is irrelevant \nfor us right?  I can think of several functions that would be \nparticularly useful in combining modules together, or resuing modules \nin new places.\n\tMore along the same lines, and with some insipration from this paper: \nhttp://nn.cs.utexas.edu/lookup?whiteson:gecco03, what I am leaning \ntowards now is writing a switch network on top of the regular NEAT \npopulation.  The algorithm would start with just one NEAT population \nwhich attempts to solve the entire problem, then after n generations, \nor after stagnation, a switch network would complexify on top of this \npopulation. At each &#39;switch&#39; an NN also evolves which makes the \ndecision on which network to choose to perform the task.  I think the \ndifficuly here is the chicken and egg problem in getting the system \noff the ground.  What I&#39;m aiming for is to solve the 3v1 keepaway task \n(from the paper) without using hand coded sub-tasks.  I&#39;m not sure \nI&#39;ve atriculated this very well, but hopefully the gist comes across.  \nThanks for any thoughts.\n\n-Ashot Petrosian\n\n\n\n"}}