{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[{"name":"READ"}]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"userId":7192225,"authorName":"Ian Badcoe","from":"Ian Badcoe &lt;ian_badcoe@...&gt;","profile":"ian_badcoe","replyTo":"LIST","senderId":"pc3xjVED7Wl81qssXMJcj3nIW_paRcdQ4g5HErCv2Poaha0TSBMN_TQ4gEG7GDFHGBJuyQP7xiVu7RIWIyq37Wb5-OD3d9WkI74","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [neat] Introduction/Some Questions","postDate":"1121686351","msgId":2110,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDYuMi4wLjE0LjAuMjAwNTA3MTgxMjEzMTEuMDMzNWE1MjBAcG9wLm1haWwueWFob28uY28udWs+","inReplyToHeader":"PGRiN240ZStqOXNmQGVHcm91cHMuY29tPg==","referencesHeader":"PGRiN240ZStqOXNmQGVHcm91cHMuY29tPg=="},"prevInTopic":2107,"nextInTopic":2111,"prevInTime":2109,"nextInTime":2111,"topicId":2088,"numMessagesInTopic":13,"msgSnippet":"Welcome!\n\n which I am having trouble with because I\n have so many brilliant ideas ;)\n\nI think that s quite a common problem around here.  I think it indicates","rawEmail":"Return-Path: &lt;ian_badcoe@...&gt;\r\nX-Sender: ian_badcoe@...\r\nX-Apparently-To: neat@yahoogroups.com\r\nReceived: (qmail 39153 invoked from network); 18 Jul 2005 11:31:01 -0000\r\nReceived: from unknown (66.218.66.172)\n  by m33.grp.scd.yahoo.com with QMQP; 18 Jul 2005 11:31:01 -0000\r\nReceived: from unknown (HELO smtp001.mail.ukl.yahoo.com) (217.12.11.32)\n  by mta4.grp.scd.yahoo.com with SMTP; 18 Jul 2005 11:31:01 -0000\r\nReceived: (qmail 88431 invoked from network); 18 Jul 2005 11:31:00 -0000\r\nReceived: from unknown (HELO ian2k.yahoo.co.uk) (ian?badcoe@212.159.73.108 with login)\n  by smtp001.mail.ukl.yahoo.com with SMTP; 18 Jul 2005 11:31:00 -0000\r\nMessage-Id: &lt;6.2.0.14.0.20050718121311.0335a520@...&gt;\r\nX-Mailer: QUALCOMM Windows Eudora Version 6.2.0.14\r\nDate: Mon, 18 Jul 2005 12:32:31 +0100\r\nTo: neat@yahoogroups.com\r\nIn-Reply-To: &lt;db7n4e+j9sf@...&gt;\r\nReferences: &lt;db7n4e+j9sf@...&gt;\r\nMime-Version: 1.0\r\nContent-Type: text/plain; charset=&quot;us-ascii&quot;; format=flowed\r\nX-eGroups-Msg-Info: 1:12:0\r\nFrom: Ian Badcoe &lt;ian_badcoe@...&gt;\r\nSubject: Re: [neat] Introduction/Some Questions\r\nX-Yahoo-Group-Post: member; u=7192225; y=S0U_RjKoMlMCAQFXNYmv8AmYPz_Fyd9hWqMMEU5K1LIu8EwTCw\r\nX-Yahoo-Profile: ian_badcoe\r\n\r\nWelcome!\n\n&gt;which I am having trouble with because I\n&gt;have so many brilliant ideas ;)\n\nI think that&#39;s quite a common problem around here.  I think it indicates \nthat the subject is so rich in potential that we all see many many more \npossibilities than we have time to try...\n\n&gt;         My initial idea was a type of modular NEAT. Essentially the way it\n&gt;works is that each new innovation actually creates a coevolving NEAT\n&gt;population which starts as simple but can complexify (which then have\n&gt;nodes which can complexify).\n\nSo this is a two-level system, with the top network built only from modules \nand the modules then containing nodes and connections in the traditional \nmanner.  For me this raises quite a lot of questions:\n\n- how are module&lt;-&gt;module connections coded?\n- can a module change its &quot;signature&quot; and display new inputs/outputs?\n- can a module appear more than once in a genome?\n\n&gt;Every network that uses this innovation\n&gt;would actually share the same &#39;module&#39; which would be the module with\n&gt;the best average fitness across all networks.\n\nSo can there be more than one &quot;allele&quot; of the same module in the \npopulation, competing with one another?\n\n&gt;   Modules would be\n&gt;evolved for several generations before the &#39;top&#39; NEAT population was\n&gt;given one generation.\n\nThat sounds quite promising, although you can make the reverse argument \njust as easily:\n\ncurrent - evolve modules faster than genomes so that they can adapt to best \nfill the slots they occupy\nreverse - evolve genomes faster than modules so they can explore the best \nusage of the modules they have\n\n:)\n\n&gt;   The benefits here are that this would allow\n&gt;evolution to choose the level of modularity that was fitting for the\n&gt;problem, would be a continous &#39;evolution&#39;(pardon) on NEAT rather than\n&gt;a radical change (in other words it reduces to NEAT), and would solve\n&gt;the problem of adding on new modules while maintaining smooth mutation\n&gt;(by starting them small).\n\nThat is a very good take on modules.  Another variant of the same thing \nthat occurs to me is, introduce a new module by selecting a sub-net of an \nexisting genome.  All entry-points to that sub-net are the module inputs \nand all exit-points are its outputs.  The modules initial contents are the \noriginal contents of the subnet.  Thus the initial addition of the module \nis guaranteed not to change the network.\n\n[[note that if the sub-net is one node then the module is the smallest \npossible non-inert fragment and if the sub-net is one link then the module \nis starting as a &quot;piece of wire&quot; which is _very_ simple, but has only one \ninput and one output]]\n\n&gt;   Sort of an ESP meets NEAT idea perhaps.\n&gt;I&#39;ve looked over some of Joe&#39;s stuff, but I think this is different in\n&gt;that modularity is optional rather than forced.\n&gt;         The main questions with this approach is what the base building \n&gt; block\n&gt;should be and how to produce the inital selection pressure for\n&gt;modularity (since the &#39;module&#39; would be used in the same network).\n&gt;The building block can be just a node, just a link, or more.  By more\n&gt;perhaps the new module should have the option of connecting from a\n&gt;random set of up to n to another random set of up to n nodes.  By\n&gt;changing the n we can have different binding specificty for the\n&gt;modules.\n\nThis might be answering some of my questions, but I can&#39;t quite follow \nyou.  What&#39;s the &quot;building block&quot;?\n\n&gt;         Think along these lines brought up some other questions.  When NEAT\n&gt;adds a node it actually is functionally no different then a weight\n&gt;mutation (with the exception of the non-linearity of the sigmoid).\n&gt;For a node to really add functionality above what direct link can\n&gt;accomplish it must at least have two inputs or two outputs.  So for\n&gt;NEAT to take advantage of a new node mutation it actually has to get\n&gt;lucky twice, once to add node in the right place, and another two add\n&gt;a link to/from it.  I think in general this problem is sidestepped by\n&gt;having a much higher add-connection rate.  If I&#39;m right on this (am I?\n&gt;) then perhaps the mutation should  be changed to add a node which\n&gt;connects two inputs/outputs simulatneously, or n inputs/outputs?\n\nI think this was discussed a year or two back (about when I first started \nlurking on the group).\n\nOne counter argument is the theory that the accumulation of neutral \nmutations is essential as a mechanism for searching-out adaptive \nones.  e.g. that (i) neutral mutations provide a library of diversity in \nthe population and (ii) only a faction of adaptive changes could be found \nby one mutation, however complex you tweak the mutations to be, so passage \nthrough the intermediate step of accumulating neutral changes is always \ngoing to be necessary...\n\n&gt;         Along the same lines of thinking, has anyone tried using more\n&gt;powerful functions at the nodes rather than just a threshold? For\n&gt;example an average, or maximum, or minimum, or a switch, or so on?\n\nWe discussed this as well and I believe some people started to try it.  I \nplan to try it.  I&#39;m not sure &quot;more powerful&quot; functions are the most \nimportant angle, however, I think just a choice of different simple \nfunctions can be useful.  Look for a discussion about how hard it is to \nevolve a network that multiplies two inputs...\n\n&gt;The only place I could find something similar to this was in Karl Sims\n&gt;old stuff on virtual creatures, but it was only a sidenote and not the\n&gt;focus of the paper.  Essentially it seems like more powerful operators\n&gt;should give the networks much more power and we can still keep the\n&gt;mutations incremental by being clever.  The only drawback I see here\n&gt;is that this is less biologically &#39;accurate&#39;, but this is irrelevant\n&gt;for us right?\n\nI think so.  But note that the traditional function is not that accurate \nanyway and that biology does use several types of neurone.\n\n&gt;   I can think of several functions that would be\n&gt;particularly useful in combining modules together, or resuing modules\n&gt;in new places.\n\nCan you exaplain.  I&#39;m not sure I see the link between activation function \nand modules.\n\n         Ian Badcoe\n\n\nIn fifteen minutes, everybody will be in the future.\n\n\n\n\t\t\n___________________________________________________________ \nHow much free photo storage do you get? Store your holiday \nsnaps for FREE with Yahoo! Photos http://uk.photos.yahoo.com\r\n\n"}}