{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[{"name":"READ"}]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"userId":54567749,"authorName":"Kenneth Stanley","from":"&quot;Kenneth Stanley&quot; &lt;kstanley@...&gt;","profile":"kenstanley01","replyTo":"LIST","senderId":"pzuTfTsZYH-zrqiSAGkVwqEyug5gkM8VfpK2VTYZbV2MZ4g5w-B2urait3g5bGaCqUJx4tGEG3boioyaskAnUVqv-emcRGJilyrmX97-WLU1","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: Speciation Compatibility Threshold Equation","postDate":"1069711216","msgId":222,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGJwdHYxZytxa2Y1QGVHcm91cHMuY29tPg==","inReplyToHeader":"PGJwdGRqMyszYjlnQGVHcm91cHMuY29tPg=="},"prevInTopic":221,"nextInTopic":223,"prevInTime":221,"nextInTime":223,"topicId":134,"numMessagesInTopic":37,"msgSnippet":"Hey guys, interesting discussion.  Now that I m back from Cali I can tell you a bit about the reasoning that went into my handling of speciation. Let me just","rawEmail":"Return-Path: &lt;kstanley@...&gt;\r\nX-Sender: kstanley@...\r\nX-Apparently-To: neat@yahoogroups.com\r\nReceived: (qmail 53180 invoked from network); 24 Nov 2003 22:00:19 -0000\r\nReceived: from unknown (66.218.66.218)\n  by m14.grp.scd.yahoo.com with QMQP; 24 Nov 2003 22:00:19 -0000\r\nReceived: from unknown (HELO n36.grp.scd.yahoo.com) (66.218.66.104)\n  by mta3.grp.scd.yahoo.com with SMTP; 24 Nov 2003 22:00:18 -0000\r\nReceived: from [66.218.66.124] by n36.grp.scd.yahoo.com with NNFMP; 24 Nov 2003 22:00:17 -0000\r\nDate: Mon, 24 Nov 2003 22:00:16 -0000\r\nTo: neat@yahoogroups.com\r\nSubject: Re: Speciation Compatibility Threshold Equation\r\nMessage-ID: &lt;bptv1g+qkf5@...&gt;\r\nIn-Reply-To: &lt;bptdj3+3b9g@...&gt;\r\nUser-Agent: eGroups-EW/0.82\r\nMIME-Version: 1.0\r\nContent-Type: text/plain; charset=ISO-8859-1\r\nContent-Length: 5912\r\nX-Mailer: Yahoo Groups Message Poster\r\nFrom: &quot;Kenneth Stanley&quot; &lt;kstanley@...&gt;\r\nX-Yahoo-Group-Post: member; u=54567749\r\nX-Yahoo-Profile: kenstanley01\r\n\r\nHey guys, interesting discussion.  Now that I&#39;m back from Cali I can\ntell you a bit about the reasoning that went into my handling of\nspeciation.\n\nLet me just explain up front what was going on with N being set to 1.\n It probably makes sense to you that in pole balancing, where\ntopologies do tend to have under 20 connections, setting N to 1 is\nfine.  In fact, I found it easier to get it working with N set to 1\nbecause the significance of a connection is not really proportional to\nthe size of a genome when genomes are small.  So adding a gene to a\ngenome of length 3 isn&#39;t really more significant than adding a gene to\na genome of length 6 in terms of how important that new connection may\nbe to the network&#39;s functionality.\n\nNow when we start talking about larger genomes, it may make sense to\nuse N.  In the robot duel, it is true that genomes became larger than\n200 connections or even 300 sometimes.  But we kept N set to 1.  Why?\n Because I felt that even in large genomes, a single new connection\n(or a few new connections) can be quite significant, and should have\nan opportunity to be protected just as in small genomes.  Also, we\nwere using the dynamic speciation theshold (let&#39;s call it DST), i.e.\nNEAT was moving around the threshold to keep a constant number of\nspecies.\nBut that still doesn&#39;t settle whether or not N would have been useful.\n\nThe truth is this is a research issue.  There should be experiments\ndone on large genomes with N clamped to 1, and without.  And we could\nsee the effect.  I included N in the forumlai in my papers because it\nis clearly important conceptually if not in practice.  But I do regret\nif it caused confusion.  Although- perhaps that confusion will inspire\nsome research.\n\nI think in NEAT it&#39;s hard to say that as you add genes they are less\nsignificant in impact.  (Because that is the underlying assumption of\nnormalizing with N).  Perhaps this is the case, but I&#39;m not sure.  I\nguess with *extremely* large networks, it is true, like over size\n1,000- but at what size does it begin to be true?  \n\nNow I&#39;ll respond to some questions below...\n\n--- In neat@yahoogroups.com, &quot;Derek James&quot; &lt;blue5432@y...&gt; wrote:\n&gt; --- In neat@yahoogroups.com, Colin Green &lt;cgreen@d...&gt; wrote:\n&gt; &gt; Ok now I&#39;ve woken up a bit... yes I agree with you here. Although \n&gt; one \n&gt; &gt; point I would like to make is that this only works for direct \n&gt; encoding \n&gt; &gt; schemes, NEAT is ok because a NEAT chromosome is a direct\nencoding \n&gt; of a \n&gt; &gt; NN. If you start to consider indirect encoding (as in biology)\nthen \n&gt; you \n&gt; &gt; find that small changes in the genetic make up can result in\nlarge \n&gt; &gt; changes in the phenotype. The solution is to compare phenotypes - \n&gt; which \n&gt; &gt; is something I didn&#39;t take into a account in my own code which IS \n&gt; does \n&gt; &gt; use indirect encoding.\n&gt; \n&gt; That&#39;s a good point.  In the real world, chromosomes don&#39;t have\nsex, \n&gt; organisms do.  So the speciation mechanism for an indirect encoding \n&gt; scheme would probably need to base speciation on phenotype.\n&gt; \n\nI strongly disagree with this.  Species in biology are organisms that\nshare genetic history.  Those organisms in separate species share less\ngenetic history.  And the history is *genetic* and not phenotypic- and\ngenetic history is exactly what historical markings measure.  If you\ngive up on that, you are left with massive analytic problem of\ncomparing phenotypic morphologies and functionalities that are wildly\ncomplex.  But why do that when we know genetic history?\n\nI also disagree with the idea that changing a gene in indirect\nencoding can have a huge impact on phenotype.  I think this is only\ntrue in a *bad* indirect encoding.  In a good indirect encoding, such\nas DNA, there is canalization, which means that it&#39;s difficult to get\nmassive perturbations in phenotype from small changes in genotype.  In\nother words, the system is more or less robust to change on the macro\nlevel.  It is important not to confuse current primitive indirect\nencodings with the potentially powerful indirect encodings we will\nultimately use.  An encoding where flipping a bit can result in an\nunrecognizable phenotypic mutant is terribly brittle, and should not\nbe the basis of our intuitions about complexification or speciation.\n\nI do agree, it is still aquestion whether N should be used or not in\nany encoding, whether direct or indirect.  I believe I&#39;ve heard that\nmonkeys have 99% of the genetic history as humans.  Assuming this is\ntrue, if we were normalizing for genome size, I think we&#39;d conclude\nthat monkeys and people were in the same species!\n\nThe issue behind the best way to use N (perhaps some nonlinear\nformula), if at all, is certainly an open question.  But I don&#39;t think\nthere is any future in comparing phenotypes instead of genotypes.\n\n&gt; &gt; &gt;That is, in the second case, a given species could\n&gt; &gt; &gt;have much more or much less topological difference\n&gt; &gt; &gt;between its individuals.  This approach seems less\n&gt; &gt; &gt;desirable to me, since it seems less\n&gt; &gt; &gt;biologically-inspired.  You&#39;re enforcing an arbitrary\n&gt; &gt; &gt;division of the population, rather than defining\n&gt; &gt; &gt;species primarily by a distance function.\n&gt; &gt; &gt;\n&gt; &gt; &gt;  \n&gt; &gt; &gt;\n&gt; &gt; Agreed.\n&gt; \n\nOne interesting question is how a DST would interact with a\nnormalization factor.  They may interact in interesting ways.\nI agree that the DST is biologically implausible.  But it does\nhelp in a practical sense, because you no longer how to worry about\nspecies explosions or implosions, and I&#39;ve found it quite effective in\na number of experiments.  That&#39;s not to say that there isn&#39;t\nnecessarily a better way.  Here are the options:\n\n-No DST and no N\n-DST and no N\n-No DST and N\n-DST and N\n\nThere is also the added issue of whether N should be made nonlinear in\nsome way, as I believe Colin suggested.\n\nIt may depend a bit on population size and on the complexity you are\naiming for which combination is best, and it&#39;s an open issue.  \n\nken\n\n\n"}}