{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[{"name":"READ"}]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"userId":34004016,"authorName":"Derek James","from":"Derek James &lt;blue5432@...&gt;","profile":"blue5432","replyTo":"LIST","senderId":"IuWxJb7tMCnn6WtHORD-bl21KXtexb4sx8vvCprNyofcybgY6wJWpBwiPuWqtnAhGlkL2s2wweGjzMA6X_AbyC0F40IDw5k","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [neat] Re: Speciation Compatibility Threshold Equation","postDate":"1069777184","msgId":224,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDIwMDMxMTI1MTYxOTQ0LjUwNTQ1LnFtYWlsQHdlYjYwNTA4Lm1haWwueWFob28uY29tPg==","inReplyToHeader":"PGJwdHYxZytxa2Y1QGVHcm91cHMuY29tPg=="},"prevInTopic":223,"nextInTopic":227,"prevInTime":223,"nextInTime":225,"topicId":134,"numMessagesInTopic":37,"msgSnippet":"... Welcome back, Ken. :) What were you in California for?  A conference? ... Thanks for replying so thoroughly to this question, Ken.  Though I *was* hoping","rawEmail":"Return-Path: &lt;blue5432@...&gt;\r\nX-Sender: blue5432@...\r\nX-Apparently-To: neat@yahoogroups.com\r\nReceived: (qmail 3283 invoked from network); 25 Nov 2003 16:37:44 -0000\r\nReceived: from unknown (66.218.66.167)\n  by m13.grp.scd.yahoo.com with QMQP; 25 Nov 2003 16:37:44 -0000\r\nReceived: from unknown (HELO web60508.mail.yahoo.com) (216.109.116.129)\n  by mta6.grp.scd.yahoo.com with SMTP; 25 Nov 2003 16:37:44 -0000\r\nMessage-ID: &lt;20031125161944.50545.qmail@...&gt;\r\nReceived: from [204.146.199.2] by web60508.mail.yahoo.com via HTTP; Tue, 25 Nov 2003 08:19:44 PST\r\nDate: Tue, 25 Nov 2003 08:19:44 -0800 (PST)\r\nSubject: Re: [neat] Re: Speciation Compatibility Threshold Equation\r\nTo: neat@yahoogroups.com\r\nIn-Reply-To: &lt;bptv1g+qkf5@...&gt;\r\nMIME-Version: 1.0\r\nContent-Type: text/plain; charset=us-ascii\r\nFrom: Derek James &lt;blue5432@...&gt;\r\nX-Yahoo-Group-Post: member; u=34004016\r\nX-Yahoo-Profile: blue5432\r\n\r\n--- Kenneth Stanley &lt;kstanley@...&gt; wrote:\n&gt; Hey guys, interesting discussion.  Now that I&#39;m back\n&gt; from Cali I can\n&gt; tell you a bit about the reasoning that went into my\n&gt; handling of speciation.\n\nWelcome back, Ken. :)\n\nWhat were you in California for?  A conference?\n\n&gt; The truth is this is a research issue.  There should\n&gt; be experiments\n&gt; done on large genomes with N clamped to 1, and\n&gt; without.  And we could\n&gt; see the effect.  \n\nThanks for replying so thoroughly to this question,\nKen.  Though I *was* hoping the issue was a little\nmore resolved.\n\nIt does sound like another research issue.  There&#39;s no\ndoubt, from your ablation experiments, that speciation\nis effective, but it sounds like there&#39;s no good\nhandle on which approaches to speciation are more or\nless effective than others.\n\nI think the basic approach Philip and I are going to\ntake is to calculate some sort of percentage\ndifference between chromosomes for usage as a\nspeciation threshold.  If we find that our populations\nare either underspeciation or overspeciating, then\nwe&#39;ll modify the threshold to be dynamic.\n\n&gt; I included N in the forumlai in my\n&gt; papers because it\n&gt; is clearly important conceptually if not in\n&gt; practice.  But I do regret\n&gt; if it caused confusion.  \n\nNo problem.  It makes the math a lot easier. :)\n\nSeriously, I instinctively think that normalizing for\nchromosome size is conceptually important, as you\nnote.  That&#39;s why I was mildly surprised to realize\nthat it had never been used.  \n\nLike I said, I think we&#39;re going to try to use that\napproach as the default for our first experiments in\nboard game domains, and we&#39;ll definitely report here\nabout the kinds of results we&#39;re getting.\n\n&gt; I think in NEAT it&#39;s hard to say that as you add\n&gt; genes they are less\n&gt; significant in impact.  (Because that is the\n&gt; underlying assumption of\n&gt; normalizing with N).  Perhaps this is the case, but\n&gt; I&#39;m not sure.  \n\nI&#39;m not sure either.  Intuitively, I&#39;d be inclined to\nsay that adding a node to a three-node network, in\ngeneral, has a more profound effect on its behavior\nthan adding a node to a 500-node network.  \n\nAfter all, one of the inherent features of distributed\ncomputing approaches like neural networks is their\nrobustness.  A few thousand brain cells die off here\nor there, a chunk of the mouse&#39;s brain is cut out, but\noverall function isn&#39;t impacted significantly.  And I\nwould think that the robustness of the network would\nonly increase as the size of the network increased,\nand more redundancy and distribution become features\nof the system.\n \n&gt; --- In neat@yahoogroups.com, &quot;Derek James&quot;\n&gt; &lt;blue5432@y...&gt; wrote:\nSo the speciation mechanism for an\n&gt; indirect encoding \n&gt; &gt; scheme would probably need to base speciation on\n&gt; phenotype.\n&gt; \n&gt; I strongly disagree with this.  Species in biology\n&gt; are organisms that\n&gt; share genetic history.  Those organisms in separate\n&gt; species share less\n&gt; genetic history.  And the history is *genetic* and\n&gt; not phenotypic- and\n&gt; genetic history is exactly what historical markings\n&gt; measure.  If you\n&gt; give up on that, you are left with massive analytic\n&gt; problem of\n&gt; comparing phenotypic morphologies and\n&gt; functionalities that are wildly\n&gt; complex.  But why do that when we know genetic\n&gt; history?\n\nHmm...I honestly hadn&#39;t thought about this much when I\nanswered Colin&#39;s point.  I guess I was thinking about\nsex in the real world, and the fact that what\ndetermines whether two organisms can successfully mate\nis their phenotype, rather than their genotype (e.g.,\na neutered dog is genetically compatible with a\nfertile one of the opposite sex, but its phenotypic,\num, limitations, keep it from mating).\n\nThat is, things that happen to phenotypes in their\nenvironment can lead to inabilities to actually mate. \nBut maybe carrying this level of literalness into the\nGA domain is a bit too much.\n\nBut I don&#39;t know.  Basically, if you use an indirect\nencoding scheme, the resultant organism is a\ncombination of genetic determinism and influences from\nthe environment.  If you base their compatibility\nsolely on their genetic similarities, aren&#39;t you\nignoring the environmental influences on the\ndevelopment of an organism?  And isn&#39;t how an\nindirectly-encoded phenotype develops and performs\nimportant to determining its fitness and the extent to\nwhich it should reproduce?\n\n&gt; I also disagree with the idea that changing a gene\n&gt; in indirect\n&gt; encoding can have a huge impact on phenotype.  I\n&gt; think this is only\n&gt; true in a *bad* indirect encoding.  In a good\n&gt; indirect encoding, such\n&gt; as DNA, there is canalization, which means that it&#39;s\n&gt; difficult to get\n&gt; massive perturbations in phenotype from small\n&gt; changes in genotype.  \n\nHmm...this is interesting.  How does this work in\nnature?  I&#39;m thinking, for example, of a millipede. \nIs it the case with the legs of a millipede that there\nis a strand of DNA that encodes for a single leg, that\nis then looped through to create all of the\nmillipede&#39;s legs?  If so, then wouldn&#39;t a mutation\nthat affects one leg then have a profound effect on\nthe organism as a whole?\n\nI don&#39;t claim to know much about this subject.  How is\nfault tolerance for indirect encoding handled by\nbiological organisms?  You refer to this as\n&quot;canalization&quot;, and I do remember you talking about\nthis in the artificial embryogeny paper, but I&#39;m not\nsure I understand the concept well.\n\n&gt; In\n&gt; other words, the system is more or less robust to\n&gt; change on the macro\n&gt; level.  It is important not to confuse current\n&gt; primitive indirect\n&gt; encodings with the potentially powerful indirect\n&gt; encodings we will\n&gt; ultimately use.  An encoding where flipping a bit\n&gt; can result in an\n&gt; unrecognizable phenotypic mutant is terribly\n&gt; brittle, and should not\n&gt; be the basis of our intuitions about\n&gt; complexification or speciation.\n\nAgain, I&#39;m wondering about how biological organisms\nattain this robustness.  Surely in the case of\nstructures (such as blood cells) that are produced\nmillions of times over, there is encoding for a single\nblood cell.  And if a mutation occurs in that genetic\nmaterial, how is it not going to result in massive\nperturbations in the phenotype?\n\n&gt; I do agree, it is still aquestion whether N should\n&gt; be used or not in\n&gt; any encoding, whether direct or indirect.  I believe\n&gt; I&#39;ve heard that\n&gt; monkeys have 99% of the genetic history as humans. \n&gt; Assuming this is\n&gt; true, if we were normalizing for genome size, I\n&gt; think we&#39;d conclude\n&gt; that monkeys and people were in the same species!\n\nWell, you probably could, with a little tweaking, get\na viable embryo that&#39;s a result of chimp and human DNA\n(this may not be far off in the future).  I think this\nwill tend to blur the line of what a true biological\nspecies is (which is already somewhat fuzzy).\n\n&gt; The issue behind the best way to use N (perhaps some\n&gt; nonlinear\n&gt; formula), if at all, is certainly an open question. \n&gt; But I don&#39;t think\n&gt; there is any future in comparing phenotypes instead\n&gt; of genotypes.\n\nI&#39;m not entirely sold, but I&#39;ll admit that it is a\nvery interesting question. :)\n\n&gt; One interesting question is how a DST would interact\n&gt; with a\n&gt; normalization factor.  They may interact in\n&gt; interesting ways.\n&gt; I agree that the DST is biologically implausible. \n&gt; But it does\n&gt; help in a practical sense, because you no longer how\n&gt; to worry about\n&gt; species explosions or implosions, and I&#39;ve found it\n&gt; quite effective in\n&gt; a number of experiments.  \n\nYeah, Philip and I have discussed this.  It may be\nthat from a practical standpoint we have to stabilize\nthe number of species forcibly, by either clamping the\nnumber of species, or as Joseph did, by modifying the\nspeciation threshold based on the amount of variation\npresent in the population.  I would strongly doubt\nthat a speciated algorithm is going to work well when\nonly one or two species is present in the population,\nor when the number of species explodes to nearly the\nsize of the population.\n\n&gt; -No DST and no N\n&gt; -DST and no N\n&gt; -No DST and N\n&gt; -DST and N\n\nRight.  So we&#39;re going to try door #3 first and see\nwhat happens experimentally, though probably we&#39;ll end\nup with the last option, or something like it.\n\nAnyway, yeah...interesting discussion. :)\n\nDerek\n\n__________________________________\nDo you Yahoo!?\nProtect your identity with Yahoo! Mail AddressGuard\nhttp://antispam.yahoo.com/whatsnewfree\n\n"}}