{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[{"name":"READ"}]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"userId":7192225,"authorName":"Ian Badcoe","from":"Ian Badcoe &lt;ian_badcoe@...&gt;","profile":"ian_badcoe","replyTo":"LIST","senderId":"RMmHKQirUXanqAMRB52GHAdjEASdj8E2FZoCu39tC23XyfxPEpBAM--xQRG6GfcEpKvH9iOBDhTd5mCEhnLU0PfRy35MSEvPhyg","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [neat] TicTacToe Perfect Player Scoring","postDate":"1127585784","msgId":2286,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDYuMi4wLjE0LjAuMjAwNTA5MjQxODQ5NTcuMDJlODVkZTBAcG9wLm1haWwueWFob28uY28udWs+","inReplyToHeader":"PDQzMzQ5N0M4LjkwMDAyMDRAZHNsLnBpcGV4LmNvbT4=","referencesHeader":"PDYuMi4wLjE0LjAuMjAwNTA5MTkxNjAxMjYuMDMzMzE0YzhAcG9wLm1haWwueWFob28uY28udWs+IDw0MzM0OTdDOC45MDAwMjA0QGRzbC5waXBleC5jb20+"},"prevInTopic":2285,"nextInTopic":2288,"prevInTime":2285,"nextInTime":2287,"topicId":2283,"numMessagesInTopic":12,"msgSnippet":"... No, I m not making them play whole games, I m just giving them isolated boards and asking them for one move.  Then I score their answer and average the","rawEmail":"Return-Path: &lt;ian_badcoe@...&gt;\r\nX-Sender: ian_badcoe@...\r\nX-Apparently-To: neat@yahoogroups.com\r\nReceived: (qmail 95529 invoked from network); 24 Sep 2005 18:21:32 -0000\r\nReceived: from unknown (66.218.66.217)\n  by m24.grp.scd.yahoo.com with QMQP; 24 Sep 2005 18:21:32 -0000\r\nReceived: from unknown (HELO cmailm1.svr.pol.co.uk) (195.92.193.18)\n  by mta2.grp.scd.yahoo.com with SMTP; 24 Sep 2005 18:21:31 -0000\r\nReceived: from modem-239.leopard.dialup.pol.co.uk ([217.135.144.239] helo=giles.yahoo.co.uk)\n\tby cmailm1.svr.pol.co.uk with esmtp (Exim 4.41)\n\tid 1EJEeN-0008LX-G8\n\tfor neat@yahoogroups.com; Sat, 24 Sep 2005 19:21:30 +0100\r\nMessage-Id: &lt;6.2.0.14.0.20050924184957.02e85de0@...&gt;\r\nX-Mailer: QUALCOMM Windows Eudora Version 6.2.0.14\r\nDate: Sat, 24 Sep 2005 19:16:24 +0100\r\nTo: neat@yahoogroups.com\r\nIn-Reply-To: &lt;433497C8.9000204@...&gt;\r\nReferences: &lt;6.2.0.14.0.20050919160126.033314c8@...&gt;\n &lt;433497C8.9000204@...&gt;\r\nMime-Version: 1.0\r\nContent-Type: text/plain; charset=&quot;us-ascii&quot;; format=flowed\r\nX-eGroups-Msg-Info: 2:12:4:0\r\nFrom: Ian Badcoe &lt;ian_badcoe@...&gt;\r\nSubject: Re: [neat] TicTacToe Perfect Player Scoring\r\nX-Yahoo-Group-Post: member; u=7192225; y=tVTdujF1-08G4Z2sTPw0A7jqbQxTiZo7YSfyWTR1v_aC7xZ53w\r\nX-Yahoo-Profile: ian_badcoe\r\n\r\nAt 01:03 24/09/2005, you wrote:\n&gt;Ian Badcoe wrote:\n&gt;\n&gt; &gt;       These scores all have the properties:\n&gt; &gt;1) a &quot;perfect&quot; player will score 1.0000.\n&gt; &gt;2) only illegal moves can drive a score negative.\n&gt; &gt;3) players that cannot make illegal moves (some approaches won&#39;t allow\n&gt; &gt;this) will score the same on legal and non-legal forms.\n&gt; &gt;\n&gt; &gt;\n&gt; &gt;\n&gt;Can you just clarify one point for me - is the score you describe\n&gt;assigned to each move? If so then won&#39;t the overall score be &gt;1 for a\n&gt;perfect player (total or average score for all moves).\n\nNo, I&#39;m not making them play whole games, I&#39;m just giving them isolated \nboards and asking them for one move.  Then I score their answer and average \nthe result across the N boards in the test.\n\n&gt;I reckon this is a step in the right direction re the need for some kind\n&gt;of universal evaluation scheme. Not sure about the evaluation of\n&gt;performance against poor players aspect. If we are evaluating against\n&gt;every board state then surely some of those states could only have been\n&gt;obtained by poor/illogical play (or what we would consider to be poor\n&gt;play under normal circumstances) and therefore we *are* evaluating\n&gt;performance against some poor players, aren&#39;t we?\n\nIn that sense we are testing against poor players, yes.\n\nBut in the sense that Derek pointed out before (look at the end of the \n&quot;Tic-Tac-Toe w/ board state normalisation - Update&quot; conversation) we are \nnot.  Derek and I didn&#39;t quite see eye-to-eye on that, but only because we \nare coming at the problem from slightly different positions.  His point, is \nthat if you have evolved to play against a particular population, and if \nyou can beat every member of that population with some strategy, then it \nhardly matters that the strategy would lose against a &quot;perfect&quot; player.\n\nMy viewpoint is that any situation such as this is transient, because the \nrest of the population will evolve to exploit your weakness.\n\nPossibly we should distinguish between two scenarios:\n\n1) evolving play with a presumption of a particular opponent(s)\n2) evolving play with no presumption except the rules of the game\n\nI think they are actually slightly different problems\n\nWhile in the second case, at any moment, individuals will be facing some de \nfacto set of particular opponents, but as an outsider, we would not \nconsider their evolution to have progressed very far unless they went on to \nperform consistently against any opponent...\n\n(&quot;consistently&quot; may be the wrong word, e.g. in a simple game like TTT we \nknow what is possible so we would look for that, not just &quot;consistency&quot;, \nand in a more complex game, like chess, our understanding of what is \npossible is far more intuitive, and game-to-game variation may also remain \nhigh, even when a player gets quite good...)\n\n&gt;I suppose a truly universal evaluation scheme would evaluate a player&#39;s\n&gt;ability to learn how other players play and thus exploit their\n&gt;weaknesses, but do you give each player an ID so we know which players\n&gt;we are playing against or do you leave it to the algorithm to analyse\n&gt;the style of play and to adjust it&#39;s playing strategy accordingly?\n\nThat&#39;s yet another class of problem again, you&#39;re now not only evolving to \nplay TTT, but also to assess other players and adjust the approach \naccordingly.  For me, that&#39;s not the problem I&#39;m chasing (and also I \nsuspect TTT is too simply to really allow it, maybe poker...)\n\n&gt;  Consider that I&#39;m a human playing TTT with an anonymous player over the\n&gt;internet, do I try some silly moves in an attenpt to find weaknesses or\n&gt;do I play primarily defensively and only offensively as a secondary\n&gt;strategy. I do the later but I do take advantage of any silly moves the\n&gt;opponent makes,  but if my defensive style of play doesn&#39;t expose the\n&gt;opponents silly moves then I never discover them.\n&gt;\n&gt;So what we are proposing is evaluation assuming a reasonably competent\n&gt;opponent and a fixed (non-adapting) strategy.\n\nAgain I don&#39;t think TTT is complex enough to show much of what you \ndescribe.  e.g. the minimax I used to generate the date _will_ exploit any \nmistake its opponent makes.  What it won&#39;t do is deliberately make a \nmistake in the hope the opponent won&#39;t understand it and thus make a bigger \nmistake and lose.  Obviously in chess that is a valid strategy, people do \nset traps (but note that the whole concept of a &quot;trap&quot; carries connotations \nof intelligence in the form of it matters how closely the opponent _looks_ \nat it).  In TTT, however, I am unsure how much score there is for making \nany mistake that does not immediately lead to an opponent win.  I did start \ntrying to come up with some analysis of the game tree that would count \nthese situations, you presumably have to look for places where both sides \ncan make sequential &quot;mistakes&quot;, but it gets bogged down with the line \nbetween &quot;mistake&quot; and &quot;implausibly stupid play&quot;, e.g. if the opponents \nmistake has to be not completing a line, is that really plausible?\n\nSo I think the minimax player for TTT is &quot;perfect&quot; in a very general sense \nand for the case of not .  It does the best it can against other &quot;perfect&quot; \nplayers.  And it immediately exploits any error an opponent makes.  But it \nwon&#39;t try to exploit any known weakness of an opponent, because it doesn&#39;t \ncome to the table with any expectation of meeting a particular opponent...\n\nIan\n\n&gt;Colin.\n&gt;\n&gt;\n&gt;\n&gt;\n&gt;\n&gt;\n&gt;Yahoo! Groups Links\n&gt;\n&gt;\n&gt;\n&gt;\n\nIn 15 minutes everybody will be in the future.\n\n\n\n"}}