{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[{"name":"READ"}]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"userId":127853030,"authorName":"Colin Green","from":"Colin Green &lt;cgreen@...&gt;","profile":"alienseedpod","replyTo":"LIST","senderId":"xMEi319ItXWryCseSSGMQebsiS8eJyHFTwUYDEzy6FpZQThXKp-2EjFJhig7BXYS3MPOrqDi2gZ9wJDd4X_8rNy3ZTAoNKAqaA","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [neat] TicTacToe Perfect Player Scoring","postDate":"1127607354","msgId":2288,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDQzMzVFQzNBLjcwNzA3MDRAZHNsLnBpcGV4LmNvbT4=","inReplyToHeader":"PDYuMi4wLjE0LjAuMjAwNTA5MjQxODQ5NTcuMDJlODVkZTBAcG9wLm1haWwueWFob28uY28udWs+","referencesHeader":"PDYuMi4wLjE0LjAuMjAwNTA5MTkxNjAxMjYuMDMzMzE0YzhAcG9wLm1haWwueWFob28uY28udWs+IDw0MzM0OTdDOC45MDAwMjA0QGRzbC5waXBleC5jb20+IDw2LjIuMC4xNC4wLjIwMDUwOTI0MTg0OTU3LjAyZTg1ZGUwQHBvcC5tYWlsLnlhaG9vLmNvLnVrPg=="},"prevInTopic":2286,"nextInTopic":2291,"prevInTime":2287,"nextInTime":2289,"topicId":2283,"numMessagesInTopic":12,"msgSnippet":"... It was the perfect score of 1.0 that threw me, I see now that a perfect player scores 1.0 for every board state under the TTP-PPS(flat) scheme, so the","rawEmail":"Return-Path: &lt;cgreen@...&gt;\r\nX-Sender: cgreen@...\r\nX-Apparently-To: neat@yahoogroups.com\r\nReceived: (qmail 35787 invoked from network); 25 Sep 2005 00:16:20 -0000\r\nReceived: from unknown (66.218.66.172)\n  by m35.grp.scd.yahoo.com with QMQP; 25 Sep 2005 00:16:20 -0000\r\nReceived: from unknown (HELO astro.systems.pipex.net) (62.241.163.6)\n  by mta4.grp.scd.yahoo.com with SMTP; 25 Sep 2005 00:16:20 -0000\r\nReceived: from [10.0.0.10] (81-86-161-87.dsl.pipex.com [81.86.161.87])\n\tby astro.systems.pipex.net (Postfix) with ESMTP id 6CB49E0000C6\n\tfor &lt;neat@yahoogroups.com&gt;; Sun, 25 Sep 2005 01:15:48 +0100 (BST)\r\nMessage-ID: &lt;4335EC3A.7070704@...&gt;\r\nDate: Sun, 25 Sep 2005 01:15:54 +0100\r\nUser-Agent: Mozilla Thunderbird 1.0.2 (Windows/20050317)\r\nX-Accept-Language: en-us, en\r\nMIME-Version: 1.0\r\nTo: neat@yahoogroups.com\r\nReferences: &lt;6.2.0.14.0.20050919160126.033314c8@...&gt; &lt;433497C8.9000204@...&gt; &lt;6.2.0.14.0.20050924184957.02e85de0@...&gt;\r\nIn-Reply-To: &lt;6.2.0.14.0.20050924184957.02e85de0@...&gt;\r\nContent-Type: text/plain; charset=ISO-8859-1; format=flowed\r\nContent-Transfer-Encoding: 7bit\r\nX-eGroups-Msg-Info: 1:12:0:0\r\nFrom: Colin Green &lt;cgreen@...&gt;\r\nSubject: Re: [neat] TicTacToe Perfect Player Scoring\r\nX-Yahoo-Group-Post: member; u=127853030; y=vayWXgqxxxZMeRAiWdHcCNLCP3RG0WTO6bUPsDknsREYORDf4MAF\r\nX-Yahoo-Profile: alienseedpod\r\n\r\nIan Badcoe wrote:\n\n&gt;At 01:03 24/09/2005, you wrote:\n&gt;  \n&gt;\n&gt;&gt;Ian Badcoe wrote:\n&gt;&gt;    \n&gt;&gt;\n&gt;&gt;Can you just clarify one point for me - is the score you describe\n&gt;&gt;assigned to each move? If so then won&#39;t the overall score be &gt;1 for a\n&gt;&gt;perfect player (total or average score for all moves).\n&gt;&gt;    \n&gt;&gt;\n&gt;\n&gt;No, I&#39;m not making them play whole games, I&#39;m just giving them isolated \n&gt;boards and asking them for one move.  Then I score their answer and average \n&gt;the result across the N boards in the test.\n&gt;  \n&gt;\nIt was the perfect score of 1.0 that threw me, I see now that a \n&#39;perfect&#39; player scores 1.0 for every board state under the \nTTP-PPS(flat) scheme, so the average score is 1.0.\n\n&gt;Possibly we should distinguish between two scenarios:\n&gt;\n&gt;1) evolving play with a presumption of a particular opponent(s)\n&gt;2) evolving play with no presumption except the rules of the game\n&gt;\n&gt;I think they are actually slightly different problems\n&gt;\n&gt;While in the second case, at any moment, individuals will be facing some de \n&gt;facto set of particular opponents, but as an outsider, we would not \n&gt;consider their evolution to have progressed very far unless they went on to \n&gt;perform consistently against any opponent...\n&gt;\n&gt;(&quot;consistently&quot; may be the wrong word, e.g. in a simple game like TTT we \n&gt;know what is possible so we would look for that, not just &quot;consistency&quot;, \n&gt;and in a more complex game, like chess, our understanding of what is \n&gt;possible is far more intuitive, and game-to-game variation may also remain \n&gt;high, even when a player gets quite good...)\n&gt;  \n&gt;\nPerhaps. Certainly the path of play will vary because there are many \nboard states from which present many equally strong moves, but \nconsistency of outcome I&#39;m not sure about. Certainly if two chess \ngrandmasters compete mutliple times you will get varying results. Just \nbecause one player is &#39;better&#39; and wins more often doesn&#39;t mean s/he \nwill win every time. This variation will partly be due to circumstance - \ntiredness, fatigue, ability to handle stress, etc. If we factor that out \nso we are left with a purer form of each player&#39;s overall playing \nstrategy would we still get variation?\n\nI think the answer depends on the type of game Staying with chess, if \nthe path of play moves into an area a player is unfamiliar with then \nthey will do badly, the opponent makes note of this and adapts future \ngames to take this into account. However, another valid strategy is to \nblock progress to situations that you are unfamiliar with. For certain \ngames then a player can be very good with only limited knowledge about a \nfew situations combined with knowledge of how to block progress of play \ninto areas they are not good at.\n\nOk I&#39;m drifting here. My main point is that this notion of lack of \nknowledge in certain areas of play is a property of the type of player \n(human or CPU) combined with the type of game and the ability of the \nplayer to evaluate the game. E.g. TTT seems trivially simple to a human \nbecause we can quickly determine which are the best moves with absolute \ncertainty that a move is the best one can do. Chess seems different to \nus because the number of possible games is so large,  we therefore have \nto rely on memory(knowledge, intuition or whatever yo uwant to call it) \nto recognise certain game states so we can focus in on a few possible \npaths of play out of the many that are possible. But if you take a \nreally fast computer that can evaluate all possible paths of play, then \nfor that CPU player chess is as trivial as TTT is for us.\n\nUmm right, so my point is that the lack of consistency witnessed in some \ngames is a result of the players having a limited analytic capability in \nthe context of the game being played and therefore having to adopt \nstrategies to make up for this, strategies that rely heavily on memory \nin substitution for thorough analysis. Of course, the memory may be very \nexpansive and may cover all situations, or at least the knowledge to \nblock/limit play so that it always stays within the bounds of a players \nmemory - in which case consistency can be gained without thorough analysis.\n\nYou could argue that memories where laid down following past analyses, \neither by yourself or by learning moves from another player, in which \ncase you could say that using memory is a way of obtaining the result of \na past analysis, so it&#39;s really just a way of speeding up or expanding \nthe scope of  analysis at game time.\n\nErr sorry, this turned out to be a bit of an essay. I fully uderstand if \nno-one read this far. :)\n\n\n&gt;&gt;I suppose a truly universal evaluation scheme would evaluate a player&#39;s\n&gt;&gt;ability to learn how other players play and thus exploit their\n&gt;&gt;weaknesses, but do you give each player an ID so we know which players\n&gt;&gt;we are playing against or do you leave it to the algorithm to analyse\n&gt;&gt;the style of play and to adjust it&#39;s playing strategy accordingly?\n&gt;&gt;    \n&gt;&gt;\n&gt;\n&gt;That&#39;s yet another class of problem again, you&#39;re now not only evolving to \n&gt;play TTT, but also to assess other players and adjust the approach \n&gt;accordingly.  For me, that&#39;s not the problem I&#39;m chasing (and also I \n&gt;suspect TTT is too simply to really allow it, maybe poker...)\n&gt;  \n&gt;\nI think the crux is that the game is too short. By the time you&#39;ve \nrecognised a flaw or possible flaw in a strategy the game is over. So \nunless you know that you are repeatedly playing the same player or are \ntold the identify of the player then you can&#39;t learn anything that can \nhelp you win.\n\n&gt;&gt; Consider that I&#39;m a human playing TTT with an anonymous player over the\n&gt;&gt;internet, do I try some silly moves in an attenpt to find weaknesses or\n&gt;&gt;do I play primarily defensively and only offensively as a secondary\n&gt;&gt;strategy. I do the later but I do take advantage of any silly moves the\n&gt;&gt;opponent makes,  but if my defensive style of play doesn&#39;t expose the\n&gt;&gt;opponents silly moves then I never discover them.\n&gt;&gt;\n&gt;&gt;So what we are proposing is evaluation assuming a reasonably competent\n&gt;&gt;opponent and a fixed (non-adapting) strategy.\n&gt;&gt;    \n&gt;&gt;\n&gt;\n&gt;Again I don&#39;t think TTT is complex enough to show much of what you \n&gt;describe.  e.g. the minimax I used to generate the date _will_ exploit any \n&gt;mistake its opponent makes.  What it won&#39;t do is deliberately make a \n&gt;mistake in the hope the opponent won&#39;t understand it and thus make a bigger \n&gt;mistake and lose.  Obviously in chess that is a valid strategy, people do \n&gt;set traps (but note that the whole concept of a &quot;trap&quot; carries connotations \n&gt;of intelligence in the form of it matters how closely the opponent _looks_ \n&gt;at it).\n&gt;\nYes, this comes down to the analytic ability I was talking about. Traps \nonly work because you&#39;re opponent has limited analytic ability. An \nexperienced human player would be suspicious and focus their limited \nability on looking specifically for a trap in the absence of the \nanalytic ability to determine this for sure.\n\n&gt;  In TTT, however, I am unsure how much score there is for making \n&gt;any mistake that does not immediately lead to an opponent win.  I did start \n&gt;trying to come up with some analysis of the game tree that would count \n&gt;these situations, you presumably have to look for places where both sides \n&gt;can make sequential &quot;mistakes&quot;, but it gets bogged down with the line \n&gt;between &quot;mistake&quot; and &quot;implausibly stupid play&quot;, e.g. if the opponents \n&gt;mistake has to be not completing a line, is that really plausible?\n&gt;  \n&gt;\nGiving up a win is indeed stupid - my ANN&#39;s do this all the time though \nso I wouldn&#39;t say it&#39;s implausible! I was thinking more along the lines \nof placing a first move into a sqaure other than the center or four \ncorners, something like that.\n\nAgain, it comes down to the analytic ability of the opponent. For a trap \nto work there must be many possible paths of game play from that board \nstate on - more states than the opponent can analyse. That way, if only \na small proportion of the possible paths lead to you winning then the \nopponent might not spot the trap. Unfortunately some ANNs really are \nthis stupid even when playing TTT, thus the issue is a real one.\n\nNote though that the ANN&#39;s do have the analytic ability available to \nthem (N activations of the network to select a move), it&#39;s just that \nthey aren&#39;t utilising it very well. So they may actually fall into \nreally obvious traps, even ones where the number of poor outcomes for \nthem is 100%. This factor, coupled with a high degree of inconsistency \nmeans they may play really well overall but may have just one blind spot \nwhere they don&#39;t make a really obvious move, e.g. a win. You wouldn&#39;t \nexpect this from a human because their strategy is based on \nunderstanding of the game, and certain types of play allude to a level \nof understanding that is inconsistent with making really stupid moves. \nANN&#39;s on the other hand are bascially just a bunch of instructions/rules \non how to react to each board state, and it&#39;s quite possible for some \nreally obvious rules to be missing while other less obvious ones are in \nplace.\n\n\n&gt;So I think the minimax player for TTT is &quot;perfect&quot; in a very general sense \n&gt;and for the case of not .  It does the best it can against other &quot;perfect&quot; \n&gt;players.  And it immediately exploits any error an opponent makes.  But it \n&gt;won&#39;t try to exploit any known weakness of an opponent, because it doesn&#39;t \n&gt;come to the table with any expectation of meeting a particular opponent...\n&gt;\n&gt;  \n&gt;\nWill the scheme you described identify ANN&#39;s with blind spots as \ndescribed above? Certainly not making a winning move will be spotted, \nbut how about (when presented with the empty board state) selecting a \nsquare other than the center and corners? Could those &#39;mid&#39; squares be \nallocated a lesser score due to them leading to fewer possible winning \ngames than a corner or center square?\n\nColin\n\n"}}