{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[{"name":"READ"}]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"userId":54567749,"authorName":"Kenneth Stanley","from":"&quot;Kenneth Stanley&quot; &lt;kstanley@...&gt;","profile":"kenstanley01","replyTo":"LIST","senderId":"WZABK97O-cC5aQ_GHiv29_dBxWrOFlZheQuZDd-XTEcahM1Yo3CDUPIiAVcf3BK6ctE23lHOxildhE1ETAYtDFI9jO2jNzHfvhm0khbQG649","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: Patents and suchlike...","postDate":"1128547359","msgId":2321,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGRpMWc2ditvN2lnQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDYuMi4zLjQuMC4yMDA1MTAwNTE1MzczMi4wMzJmZTY2OEBwb3AubWFpbC55YWhvby5jby51az4="},"prevInTopic":2320,"nextInTopic":2322,"prevInTime":2320,"nextInTime":2322,"topicId":2292,"numMessagesInTopic":11,"msgSnippet":"I can understand why you wouldn t want something like rtNEAT patented but let me try to explain a bit.  First, original NEAT is not patented and is in the","rawEmail":"Return-Path: &lt;kstanley@...&gt;\r\nX-Sender: kstanley@...\r\nX-Apparently-To: neat@yahoogroups.com\r\nReceived: (qmail 16698 invoked from network); 5 Oct 2005 21:23:56 -0000\r\nReceived: from unknown (66.218.66.218)\n  by m28.grp.scd.yahoo.com with QMQP; 5 Oct 2005 21:23:56 -0000\r\nReceived: from unknown (HELO n1a.bulk.scd.yahoo.com) (66.94.237.35)\n  by mta3.grp.scd.yahoo.com with SMTP; 5 Oct 2005 21:23:55 -0000\r\nComment: DomainKeys? See http://antispam.yahoo.com/domainkeys\r\nReceived: from [66.218.69.3] by n1.bulk.scd.yahoo.com with NNFMP; 05 Oct 2005 21:22:39 -0000\r\nReceived: from [66.218.66.84] by mailer3.bulk.scd.yahoo.com with NNFMP; 05 Oct 2005 21:22:39 -0000\r\nDate: Wed, 05 Oct 2005 21:22:39 -0000\r\nTo: neat@yahoogroups.com\r\nMessage-ID: &lt;di1g6v+o7ig@...&gt;\r\nIn-Reply-To: &lt;6.2.3.4.0.20051005153732.032fe668@...&gt;\r\nUser-Agent: eGroups-EW/0.82\r\nMIME-Version: 1.0\r\nContent-Type: text/plain; charset=ISO-8859-1\r\nContent-Length: 7333\r\nX-Mailer: Yahoo Groups Message Poster\r\nX-Yahoo-Newman-Property: groups-compose\r\nX-eGroups-Msg-Info: 1:12:0:0\r\nFrom: &quot;Kenneth Stanley&quot; &lt;kstanley@...&gt;\r\nSubject: Re: Patents and suchlike...\r\nX-Yahoo-Group-Post: member; u=54567749; y=9r73TS2Ej9rvVc-NI_eZ_CE3s7EFx3mAi5tu9QY7-r3QdIOBRkKz\r\nX-Yahoo-Profile: kenstanley01\r\n\r\nI can understand why you wouldn&#39;t want something like rtNEAT \npatented but let me try to explain a bit.  First, original NEAT is \nnot patented and is in the public domain.  That is not an accident \nof timing, but rather intentional; I always wanted all my work in \nthe public domain.  So let me explain what happened.\n\nFirst, the good news is that there is no need for concern about \nsharing on this group, since sharing anything immediately makes it \nimpossible for anyone to patent.  You can&#39;t patent something that \nhas been publicly disclosed.  That means that it would be illegal \nfor anyone here to patent anything that anyone else posted, and \nthere is a record to prove it.  If you personally did want to patent \nyour own stuff, just like anyone else who gets a patent, you&#39;d need \nto first disclose it to the patent office, so they&#39;d have a record \nof when you had your idea, which is called a &quot;provisional patent.&quot;  \nThen you&#39;d be protected in the sense that the date is established \nand you could start sharing your idea.  If you have no ambitions to \npatent something, then you have nothing to fear about other people \npatenting your ideas if they were disclosed publicly.  The concern \nyou bring up generally comes about only in private disclosures, e.g. \nI verbally tell my friend my idea and he goes and patents it.  Then \nthere is no record of the disclosure so I can&#39;t prove that I in fact \nsupplied the idea.  This group as a public forum (meaning there is a \nrecord kept) precludes that from happening. So no one can go steal a \npatent from you or anyone who participates here.\n\nThe real-time enhancement of NEAT, which is called rtNEAT, is the \nonly thing that&#39;s patented.  If something in your design looks like \nrtNEAT in that it uses the same methodology in its continuous \naspect, that aspect of it (and only that aspect) may be covered by \nthe patent.   That is obviously a complicated legal question, in the \nsense that &quot;looks like&quot; is a legal opinion.  However, other details \nof your algorithm, such as the genetic representation, would not be \ncovered.  Presumably there is nothing about the genetic code that \nrequires a continuous formatted algorithm in the style of rtNEAT.  \nSo those things are separable, legally.  \n\nSo why is the real-time enhancement of NEAT patented?  It happened \nbecause of NERO.  I had no intention of patenting anything, as \nusual, when I created rtNEAT for NERO.  But what happened was a lot \nof companies started visiting our lab and expressing interest in \nrtNEAT after seeing early demos of NERO.  It became clear to me \nquickly that several parties (I won&#39;t go into specifics) were going \nto make a concerted effort to make money off of rtNEAT.  I am not \nsaying anything bad about these parties; it&#39;s only natural they \nwould want to do that.  But as the inventor, I can assure you, if \nyou see that a bunch of people are going to try to go off and make \nmoney off of your ideas and you are going to get nothing for it, you \nwill move to protect yourself.  So I was essentially forced to \ninitiate the patent process.  It is even likely that if I didn&#39;t do \nit, someone else would have, because the people who own IP created \nat a University is the *University* and not me.  That is still true \neven if I initiate the process: The University of Texas at Austin \nowns the rights to the patent, not me.  However, by getting involved \nin it early, I established that I at least *deserve* to participate \nin any enterprise that results down the road.  As I said, I would \nnot have been surprised if they patented it without me, because UT \nrecognized they had something that could make money on their hands.\n\nI&#39;ll tell you why I felt so strognly to protect myself.  rtNEAT was \nthe result of years and years of my life&#39;s research, certainly not a \nsmall idea from a post.  It goes back to my early work on real-time \nevolution in 1997, running through NEAT, and finally enhancing NEAT \nto combine it with my earlier ideas.  I had always planned to \ncombine NEAT with those ideas in the future, and the thoughts on how \nhad been materializing for years.  It was a huge struggle to get \ninto a position where I could actually create a game that would \nmerit finally creating the technology, and a further struggle to \npromote the game in Texas and around the world, generating interest. \nThus, after years of my life culminating in a situation where \nsuddenly people were circling around the results of so much labor, \nthere was little choice but to move to protect my involvement with \nthe IP.  It is difficult to convey how it feels when years of hard \nwork are about to be captilized on without you.  It was the only \ncommon sense choice to protect yourself.  \n\nIn any case, even though rtNEAT is patent-pending, it is still free \nto use for research purposes and will always be.  That&#39;s the policy \nof any university.  So it should not hamper people&#39;s desire to \nexplore the idea.  And the most important point is, no one can \npatent anything you post here.  That would be illegal, and there is \nan easy way to prove that they ripped you off, so anyone who tried \nsomething like that would be foolish.   The free flow of ideas on \nthis group therefore is not and should not be hampered.\n\nken\n\n--- In neat@yahoogroups.com, Ian Badcoe &lt;ian_badcoe@y...&gt; wrote:\n&gt; \n&gt; &gt;Another thing, which should not affect anyone, but is worth \npointing\n&gt; &gt;out, is that rtNEAT is patent pending and the patent is held by \nUT-\n&gt; &gt;Austin.  That means if you wanted to make money off of it, you&#39;d\n&gt; &gt;have to talk to them to get a license.  Of course research doesn&#39;t\n&gt; &gt;require any permission, so this shouldnt matter to most people.  \nBut\n&gt; &gt;it&#39;s something to consider if you have greater ambitions.\n&gt; \n&gt; Hi,\n&gt; \n&gt; Obviously if anybody should patent parts of NEAT, it should be Ken.\n&gt; \n&gt; But I&#39;m still not sure I feel happy about it....\n&gt; \n&gt; Did you patent the original NEAT?  Presumably if you didn&#39;t, you \n&gt; can&#39;t now because its well in the public domain?\n&gt; \n&gt; Hopefully this patent covers only the very specific implementation \n&gt; details of rtNEAT and could never impinge on anything so unrelated \nas \n&gt; continuous SLEAT?\n&gt; \n&gt; The reason this matters is, for example, I have always freely \nshared \n&gt; all my ideas and insights with the group.  But would I want to do \n&gt; that if there was any possibility of my ideas becoming somebody \n&gt; else&#39;s intellectual property?  I hurry to say I&#39;m not saying this \nhas \n&gt; happened, I don&#39;t recall making any suggestions about this exact \n&gt; area. I&#39;m just saying that given we have a community here, which \nto \n&gt; some extent develops together, I&#39;m not at all encouraged by the \nidea \n&gt; of some areas of our work becoming the property of less than us \nall.\n&gt; \n&gt;          [[In fact, since this whole group is accessibly to \nanybody \n&gt; who chooses to subscribe, we are effectively putting everything we \n&gt; say here into the public domain, and I&#39;d hate to see that limiting \n&gt; what people think they can say, also.]]\n&gt; \n&gt; Ian (hoping not to have to put a licensing agreement into his \nemails).\n&gt; \n&gt; \n&gt; In fifteen minutes, everybody will be in the future.\n&gt; \n&gt; \n&gt; \n&gt; \t\t\n&gt; ___________________________________________________________ \n&gt; To help you stay safe and secure online, we&#39;ve developed the all \nnew Yahoo! Security Centre. http://uk.security.yahoo.com\n\n\n\n"}}