{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[{"name":"READ"}]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"userId":34004016,"authorName":"Derek James","from":"Derek James &lt;blue5432@...&gt;","profile":"blue5432","replyTo":"LIST","senderId":"blptuJcO9q5WTm2DOZVBql3XTatevlYM_D25XW4atxhARjzDKlZ6Cn9DWVFuw1R7gizNug0EZWMki-ZeaE0zJMoRUIZmJFk","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [neat] Re: Speciation Compatibility Threshold Equation","postDate":"1070215605","msgId":234,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDIwMDMxMTMwMTgwNjQ1LjM1MzE0LnFtYWlsQHdlYjYwNTA2Lm1haWwueWFob28uY29tPg==","inReplyToHeader":"PGJxNXVvcittdXY4QGVHcm91cHMuY29tPg=="},"prevInTopic":229,"nextInTopic":236,"prevInTime":233,"nextInTime":235,"topicId":134,"numMessagesInTopic":37,"msgSnippet":"Hope everybody had a happy Thanksgiving. :) ... I m not sure what you mean by this.  Basically, I think we re going to normalize for chromosome size, and set","rawEmail":"Return-Path: &lt;blue5432@...&gt;\r\nX-Sender: blue5432@...\r\nX-Apparently-To: neat@yahoogroups.com\r\nReceived: (qmail 91815 invoked from network); 30 Nov 2003 18:06:46 -0000\r\nReceived: from unknown (66.218.66.218)\n  by m3.grp.scd.yahoo.com with QMQP; 30 Nov 2003 18:06:46 -0000\r\nReceived: from unknown (HELO web60506.mail.yahoo.com) (216.109.116.127)\n  by mta3.grp.scd.yahoo.com with SMTP; 30 Nov 2003 18:06:46 -0000\r\nMessage-ID: &lt;20031130180645.35314.qmail@...&gt;\r\nReceived: from [68.92.0.25] by web60506.mail.yahoo.com via HTTP; Sun, 30 Nov 2003 10:06:45 PST\r\nDate: Sun, 30 Nov 2003 10:06:45 -0800 (PST)\r\nSubject: Re: [neat] Re: Speciation Compatibility Threshold Equation\r\nTo: neat@yahoogroups.com\r\nIn-Reply-To: &lt;bq5uor+muv8@...&gt;\r\nMIME-Version: 1.0\r\nContent-Type: text/plain; charset=us-ascii\r\nX-eGroups-Remote-IP: 216.109.116.127\r\nFrom: Derek James &lt;blue5432@...&gt;\r\nX-Yahoo-Group-Post: member; u=34004016\r\nX-Yahoo-Profile: blue5432\r\n\r\nHope everybody had a happy Thanksgiving. :)\n\n&gt; --- In neat@yahoogroups.com, Derek James\n&gt; &lt;blue5432@y...&gt; wrote:\n&gt; &gt; I think the basic approach Philip and I are going\n&gt; to\n&gt; &gt; take is to calculate some sort of percentage\n&gt; &gt; difference between chromosomes for usage as a\n&gt; &gt; speciation threshold.  If we find that our\n&gt; populations\n&gt; &gt; are either underspeciation or overspeciating, then\n&gt; &gt; we&#39;ll modify the threshold to be dynamic.\n&gt; &gt; \n--- Kenneth Stanley &lt;kstanley@...&gt; wrote:\n&gt;\n&gt; When will you calculate this difference?  During\n&gt; evolution\n&gt; itself?  Or some kind of preprocessing?  \n\nI&#39;m not sure what you mean by this.  Basically, I\nthink we&#39;re going to normalize for chromosome size,\nand set the compatibility threshold to something like\n0.1.  We&#39;ll do a number of runs in a couple of\ndifferent domains, keeping an eye on the number of\nspecies that form throughout the run.  If the\npopulation is either underspeciating or\noverspeciating, we&#39;ll probably employ some sort of\ndynamic threshold that modifies its value based on the\nnumber of species in the population.\n\n&gt; Yes true I agree.  But there is a number under which\n&gt; I think realtive size is less important.  I just\n&gt; don&#39;t\n&gt; know what that number is.\n\nYes, you&#39;re probably right that there is a number\nunder which relative size isn&#39;t that important.  20\nwas your cutoff point in your original NEAT paper,\nwhich sounds reasonable to me.\n\nYou said that in your robot duel experiments, genomes\ngrew to 200-300 genes, and you still had N set to 1. \nBut you also said that you were using a dynamic\nspeciation threshold, right?  So the compatibility\nthreshold fluctuated, probably between 3.0 and some\nlarger values.  This essentially has the same\npractical effect of normalizing for chromosome size,\ndoesn&#39;t it?  It&#39;s a way of comparing the difference in\ntwo individuals relative to the size of the\nchromosomes (as well as keeping the number of species\nstable).  \n\n&gt; But the NN&#39;s we are evolving\n&gt; right now are \n&gt; far from being capable of &quot;deciding&quot; on their own\n&gt; whom to mate with,\n&gt; so something has to make the decision for them.\n\nI wasn&#39;t really talking about sexual selection.  What\nI was getting at is that often in nature, two\nindividuals are genetically compatible, but\nphenotypically incompatible.\n\nFor example, until most organisms reach some sort of\ndevelopmental maturity, they are incapable of\nreproducing (this goes not only for\nsexually-reproducing organisms, but many\nasexually-reproducing ones).\n\nTwo infants of a given species may be incapable of\nphysically reproducing, even though they are\ngenetically compatible.\n\nMany organisms do not end up reproducing because of\ndevelopmental problems.  Their genotype hasn&#39;t\nproperly encoded for an organism that is able to\ndevelop to the point of reproductive viability.\n\nShould an indirectly-encoded GA that includes some\nsort of developmental stage for phenotypes not also\nhave similar standards for reproduction?  That is, if\na genotype cannot encode for an individual that\ndevelops into a mature, functioning phenotype, should\nit be allowed to reproduce?\n\n&gt; You cannot mate two phenotypes unless you have a\n&gt; direct encoding. \n&gt; When people mate, it&#39;s their DNA that&#39;s recombining\n&gt; not their bodies.\n&gt; I&#39;m not sure where environmental influence comes\n&gt; into play.\n&gt; If the DNA are not compatible, they won&#39;t produce an\n&gt; offspring\n&gt; regardless of the environment.  I suppose if their\n&gt; DNA is compatible\n&gt; there could still be some kind of physical injury or\n&gt; pathology in\n&gt; one of the organisms preventing mating, but this\n&gt; hardly seems\n&gt; important for artificial evolution.  So I don&#39;t\n&gt; think the environment\n&gt; is relevant here.  \n\nWell, that&#39;s what I was getting at above.  It&#39;s not\njust pathology or injury that keeps phenotypes from\nmating, but also their stage of development.  And the\ndevelopment is dependent upon the environment.\n\nIs this important in artificial evolution?  I don&#39;t\nknow.  But it&#39;s extremely important in natural\nevolution (e.g., a significant percentage of\nphenotypes never make it beyond the very first\ndevelopmental stages).  Many genotypes are selected\nagainst based on their inability to construct viable\nphenotypes.\n\nSo far, our evolutionary models are not very rich. \nThere aren&#39;t many EAs that employ the sort of\nartificial embryogeny that you wrote about.  But as\nthe models do become more complex, maybe some of these\nconcepts from natural evolution (such as embryonic\nviability) will become more important.\n\n&gt; I agree that how something develops contributes to\n&gt; its fitness\n&gt; and the extent to which it should reproduce.  But\n&gt; the genome is what\n&gt; determines how it should develop!  \n\nThat, and its environment, right?  You&#39;re not saying\nthat the genome is the *only* thing that determines\ndevelopment, are you?\n\n&gt; All humans (more or less) are\n&gt; compatible for\n&gt; mating, whether the least intelligent and most\n&gt; physically unfit, or\n&gt; the geniuses with olympic potential.  They are all\n&gt; the same species.\n&gt; DNA doesn&#39;t care who&#39;s more fit when the mating\n&gt; happens.\n\nWell, humans that are of a particular sexual\ndevelopment.  Humans that have not reached puberty are\nincapable of mating, as are women who reach menopause,\nand of course all those phenotypes that are sterile or\nimpotent for one reason or another.\n\nIn principle, you&#39;re right.  But part of the beauty of\nthe way NEAT handles compatibility is also a problem. \nBasically, *any* two individuals are inherently\ncapable of reproducing in NEAT.  We&#39;re forcing\nsomewhat arbitrary decisions about which reproductive\ngroups to fence off, based on differences in their\ngenotypes.\n\nIn NEAT, from a reproductive standpoint, all genotypes\nare theoretically compatible.  It is only the\nspeciation compatibility threshold that determines who\ngets to mate with whom.  In nature, it&#39;s not an\nanalysis of genetic compatibility that decides whether\nor not a butterfly can mate with a goat.  \n\n&gt; Here&#39;s the important point:  Can you imagine a\n&gt; single amino acid\n&gt; mutation in a human that actually creates a new\n&gt; species!? \n\nWhat you&#39;re basically saying (if I&#39;m hearing you\nright) is that nature favors mutations that\nindividually do not have a significant impact on the\ndevelopment of the phenotype, as opposed to the\n&quot;hopeful monster&quot; hypothesis (that drastic mutations\ncan sometimes provide larger jumps in evolution).  As\nfar as I know, this issue is still debated among\nevolutionary biologists.\n\nThe late Stephen J. Gould was a proponent of the idea\nthat macromutations led to drastic changes in\nmorphology by affecting the genes that controlled\nembryonic development.  I&#39;m not saying I agree with\nGould.  I&#39;m just saying that the issue isn&#39;t\nnecessarily a clear-cut one.  \n\nIf I&#39;m hearing you right, though, the idea of\ncanalization is that mutations never have a drastic\nimpact on the phenotype, no matter whether the gene\nthey affect encodes for a single trait or is copied\nmillions of times over to produce the resulting\nphenotype.  In the case of neuroevolution, this would\nseem to argue for very low mutation rates, wouldn&#39;t\nit?  Especially with indirect encoding schemes.\n \n&gt; In contrast, if you look at an indirect encoding\n&gt; like L-systems\n&gt; for example, changing a single character in the\n&gt; string can\n&gt; have massive impact, creating *unrecognizable*\n&gt; offspring.  I think\n&gt; that&#39;s a pretty good sign that L-systems are not\n&gt; canalized like\n&gt; DNA, and that we have to develop better encodings.\n\nI haven&#39;t ever taken a embryology class, though I&#39;m\ninterested to know the average rate of fatal\nmutations.  I know that there is a significant rate of\nmiscarriages among humans (many are not even noticed),\nand I wonder to what extent this is caused by\nmutations that adversely affect development. \nBasically, I&#39;m interested to know just how robust DNA\nis.\n\n&gt; I mentioned 3 things in that paper that can lead to\n&gt; canalization:\n&gt; Stochasticity, Resource Allocation, and\n&gt; Overproduction.\n\nI&#39;ll definitely revisit your paper and have a look.\n  \n&gt; Also canalization means different parts of the\n&gt; system can\n&gt; pick up slack when other parts are altered.  So even\n&gt; if the\n&gt; blood cell type alters slightly, the parts the blood\n&gt; cells interact\n&gt; with may themselves be flexible in those\n&gt; interactions, such that\n&gt; they can deal with a slightly altered counterpart.\n\nOkay, well that makes sense.  It seems to me that with\nneuroevolution, we&#39;re dealing with an inherently\nrobust phenotype, wouldn&#39;t you say?  That is, if we\nwere using NEAT to produce evolvable hardware (say, a\nwalking machine), that sort of phenotype may be more\nbrittle, in terms of the effects of new mutations on\nan individual&#39;s fitness.\n\n&gt; To me it&#39;s\n&gt; inconceivable; it is clear\n&gt; that evolution requires the accumulation of many\n&gt; many mutations over\n&gt; many generations to get an entirely new character.\n\nWell, I&#39;d never argue that a single mutation leads to\na new species in natural biology.  Natural speciation\nis much more complex than that.  It&#39;s also much more\ncomplex than the model for speciation we&#39;re using\ncurrently with NEAT.  In NEAT, a single mutation *can*\nlead to a new species.\n\nIn natural ecosystems, it is sometimes geographical\nconstraints that lead to the reproductive isolation of\na given subpopulation that then leads to the emergence\nof a new species.  Obviously, our model doesn&#39;t\naccount for this sort of spatio-temporal aspect\neither.  \n\n&gt; It&#39;s not exactly &quot;where you draw the line&quot; that \n&gt; matters, but that\n&gt; you do draw it somewhere and with some regularity.\n\nWell, I think it is an interesting question of how\n&quot;where you draw the line&quot; affects evolution.\n\n&gt; Here my big concern:  If you really propose to\n&gt; compare\n&gt; phenotypes for speciation, you are back to the\n&gt; competing\n&gt; conventions problem with different topologies \n&gt; that NEAT solves.  We are literally back at square\n&gt; one.\n&gt; Can you imagine the kind of graph theory analysis\n&gt; necessary\n&gt; to establish that two morphologies are the same\n&gt; species?\n&gt; It isn&#39;t even about macro-level similarity.  A human\n&gt; with\n&gt; no arms or legs is still human.  \n\nBut a human with no reproductive organs cannot\nreproduce, even though it may be\ngenetically-compatible with other humans.\n\nI&#39;m not proposing reproductive organs for our neural\nnets, though this is very much how nature determines\nwhether or not individuals can reproduce (and with\nwhom).  Very far down the line, the way artificial\norganisms are divided into reproductive populations\nmay be based on the way natural species are divided,\nand not by an algorithm that determines genetic\ncompatibility.  But I&#39;d concede that it is a much more\nefficient, much more likely paradigm for the near\nfuture.\n\nJust curious...I&#39;m guessing that most people here in\nthe group come from a computer science background.  Is\nthat an incorrect assumption?  Neuroevolution is a\nmulti-disciplinary field, so are there any people here\nwith more experience in say, biology, psychology, or\nneuroscience than in computer science?\n\nDerek\n\n__________________________________\nDo you Yahoo!?\nProtect your identity with Yahoo! Mail AddressGuard\nhttp://antispam.yahoo.com/whatsnewfree\n\n"}}