{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[{"name":"READ"}]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"userId":127853030,"authorName":"Colin Green","from":"Colin Green &lt;cgreen@...&gt;","profile":"alienseedpod","replyTo":"LIST","senderId":"QMVkKO6vWdBMvrbKQiaxzLBqOSbbktoSuzp4t4p7Bi6P28Canb9icL1k_7kD6_dKJcQdIXr3KQVI2YwtBZbZyrVTAEwEXRritw","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [neat] Re: Causes of bloat...","postDate":"1138665775","msgId":2510,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDQzREVBOTJGLjIwNTAyMDhAZHNsLnBpcGV4LmNvbT4=","inReplyToHeader":"PDYuMi4zLjQuMC4yMDA2MDEyNzIyNDU0OC4wMzViNzBkMEBwb3AubWFpbC55YWhvby5jby51az4=","referencesHeader":"PGRyNmhwZytmOHYyQGVHcm91cHMuY29tPiA8NDNEODE0NkEuNDAwMDIwMEBkc2wucGlwZXguY29tPiA8MTliMTBkNTEwNjAxMjUxODM5dDJjZDdmNDcycWZhY2NlY2I0MjFhYjQ2NDBAbWFpbC5nbWFpbC5jb20+IDw2LjIuMy40LjAuMjAwNjAxMjcyMjQ1NDguMDM1YjcwZDBAcG9wLm1haWwueWFob28uY28udWs+"},"prevInTopic":2509,"nextInTopic":0,"prevInTime":2509,"nextInTime":2511,"topicId":2494,"numMessagesInTopic":17,"msgSnippet":"... I was coming from the agle of  Ken s canonical NEAT which creates offspring from the elite of each species, culling the rest of the species to make way for","rawEmail":"Return-Path: &lt;cgreen@...&gt;\r\nX-Sender: cgreen@...\r\nX-Apparently-To: neat@yahoogroups.com\r\nReceived: (qmail 32381 invoked from network); 31 Jan 2006 00:02:59 -0000\r\nReceived: from unknown (66.218.67.33)\n  by m26.grp.scd.yahoo.com with QMQP; 31 Jan 2006 00:02:59 -0000\r\nReceived: from unknown (HELO galaxy.systems.pipex.net) (62.241.162.31)\n  by mta7.grp.scd.yahoo.com with SMTP; 31 Jan 2006 00:02:59 -0000\r\nReceived: from [10.0.0.11] (81-86-161-87.dsl.pipex.com [81.86.161.87])\n\tby galaxy.systems.pipex.net (Postfix) with ESMTP id 3CC6AE000338\n\tfor &lt;neat@yahoogroups.com&gt;; Tue, 31 Jan 2006 00:02:54 +0000 (GMT)\r\nMessage-ID: &lt;43DEA92F.2050208@...&gt;\r\nDate: Tue, 31 Jan 2006 00:02:55 +0000\r\nUser-Agent: Mozilla Thunderbird 1.0.7 (Windows/20050923)\r\nX-Accept-Language: en-us, en\r\nMIME-Version: 1.0\r\nTo: neat@yahoogroups.com\r\nReferences: &lt;dr6hpg+f8v2@...&gt; &lt;43D8146A.4000200@...&gt; &lt;19b10d510601251839t2cd7f472qfaccecb421ab4640@...&gt; &lt;6.2.3.4.0.20060127224548.035b70d0@...&gt;\r\nIn-Reply-To: &lt;6.2.3.4.0.20060127224548.035b70d0@...&gt;\r\nContent-Type: text/plain; charset=ISO-8859-1; format=flowed\r\nContent-Transfer-Encoding: 7bit\r\nX-eGroups-Msg-Info: 1:12:0:0\r\nFrom: Colin Green &lt;cgreen@...&gt;\r\nSubject: Re: [neat] Re: Causes of bloat...\r\nX-Yahoo-Group-Post: member; u=127853030; y=sHGzv-1Asi8m37PrXSmZtNTu8jVX1dp0_B6gqpMsIbu7Io_HEncp\r\nX-Yahoo-Profile: alienseedpod\r\n\r\nIan Badcoe wrote:\n\n&gt;At 02:39 26/01/2006, Derek wrote:\n&gt;  \n&gt;\n&gt;&gt;On 1/25/06, Colin Green \n&gt;&gt;&lt;&lt;mailto:cgreen@...&gt;cgreen@...&gt; wrote:\n&gt;&gt;\n&gt;&gt;Ok but consider these points:\n&gt;&gt;\n&gt;&gt;1) If you clone a genome and the offspring replaces an existing genome\n&gt;&gt;that had less structure, then you have increased overall complexity\n&gt;&gt;within the population.\n&gt;&gt;\n&gt;&gt;\n&gt;&gt;To replace an existing genome, an offspring should have a higher \n&gt;&gt;fitness than the one it replaced.  In this case, the additional \n&gt;&gt;complexity should be helping increase fitness, so it shouldn&#39;t be \n&gt;&gt;considered bloat.\n&gt;&gt;    \n&gt;&gt;\n&gt;\n&gt;I also allow a new genome to replace an old one if they are of equal \n&gt;fitness (my current fitness scheme is quantized, so I get a lot of \n&gt;equal fitnesses).  I do this because it means that the population is \n&gt;changing (e.g. searching) even when it is not making progress.\n&gt;\n&gt;  \n&gt;\nI was coming from the agle of  Ken&#39;s canonical NEAT which creates \noffspring from the elite of each species, culling the rest of the \nspecies to make way for the offspring. There is no direct control on how \nfit the new offspring must be to be part of the next generation - they \ncould be a whole lot worse.\n\n\n\n&gt;  \n&gt;\n&gt;&gt;2) Now if we consider that some additive mutations are neutral then we\n&gt;&gt;can assume that these will get cloned and propagated through a\n&gt;&gt;population over time.\n&gt;&gt;3) Overall, mutation is more likely to find neutral additions than\n&gt;&gt;neutral deletions - assuming equal amount of both types.\n&gt;&gt;\n&gt;&gt;\n&gt;&gt;What are your justifications for #3?\n&gt;&gt;    \n&gt;&gt;\n&gt;\n&gt;I think he&#39;s thinking of the case where, if you have a genome where \n&gt;most parts are functional, then the chances are that a deletion will \n&gt;be deleterious.  In the same case, however, there is a good chance of \n&gt;an addition being neutral, because there is a good chance of an \n&gt;addition being functionless.   However, if we imagine that population \n&gt;persisting for some time, then it will acquire more and more \n&gt;non-functional structure (for the reasons just outlined) and to my \n&gt;mind it ought to eventually arrive at an equilibrium point where the \n&gt;chances for adding or deleting structure are roughly \n&gt;equal.  Personally I have never seen that, however...\n&gt;\nYeh you got what I was thinking about. I&#39;m not sure about an equlibrium \nbeing found though, maybe. Certainly early on in a search (with small \ninitial genomes) you can imagine that new additions represent a far \nlarger set of possible neutral mutations than deletions, just on the \nbasis of there not being much structure to delete! This initial \ncomplexifying pressure would drop away as structure size increased. \nHowever, I suspect that evolution of connection weights may cause \nneutral additions to become integrated within a network, such that \nsubsequent attempt at removing them is actually detrimental even though \nthey didn&#39;t actually increase fitness when they were added. This is why \nwhen sharpneat enters pruning mode I still allow normal weight mutation \nand selection of the fittest to occur - to try an evolve back to smaller \nstructures before starting again with complexiying mutations.\n\nAlso if you think about conection splitting - this is often going to be \na neutral mutation that can be repeated ad infinitum to create long \nchains of redundant neurons where only one connection was needed. But \ndeleting any one of those conenctions breaks the whole chain. To try and \novercome this I have semi-intelligent mutations that try to maintain \nconnectivity, &#39;collapsing&#39; neurons out of a structure.\n\n\n\n\n\n\n&gt;.\n&gt;\n&gt;Now!  Here&#39;s an analysis that might explain the situation, and \n&gt;sure-enough, I think the explanation comes down to crossover.\n&gt;\n&gt;--\n&gt;\n&gt;Suppose that we think about some subset of a population.  Without \n&gt;crossover we can imagine that this subset will come to an equilibrium \n&gt;point where there is enough non-functional structure that deletion \n&gt;has increased to match additions.\n&gt;\n&gt;To reach this point, the subset will have acquired some set, A of \n&gt;non-functional genes (a1, a2, a3...).\n&gt;\n&gt;OK, now suppose that another subset of the population is also at \n&gt;equilibrium, it will also have a set of non-functional genes B (b1, b2, b3...).\n&gt;\n&gt;Now, what are the chances that the sets A and B contain the same \n&gt;genes?  Essentially zero!\n&gt;\n&gt;So, as soon as there is a crossover between A and B, if the new \n&gt;individual is keeping a significant number of the unmatched genes, it \n&gt;will immediately have a greater than equilibrium proportion of \n&gt;non-functional genes.\n&gt;\n&gt;--\n&gt;\n&gt;Obviously in reality there is no neat subdivision of the population \n&gt;into completely disjunct subpopulations, but I think I have \n&gt;illustrated an extreme case and that the more general interpretation would be:\n&gt;\n&gt;1) as long as two breeding individuals each have some gene unmatched \n&gt;in the other, then the offspring will be bigger than either parent.\n&gt;2) the more different the two parents are, then the more we might \n&gt;expect the offspring to grow by.\n&gt;\n&gt;--\n&gt;\n&gt;I&#39;m thinking this brings me back around to my idea of not taking all \n&gt;unmatched genes regardless.  Do we think that with a 50% change of \n&gt;keeping each unmatched gene, that will balance things.  e.g. if we \n&gt;assume that each individual is contributing roughly the same number \n&gt;of them, then simple arithmetic should suggest we have twice as many \n&gt;as we need, so halving them...\n&gt;\n&gt;  \n&gt;\nI think that whatever you do the &#39;system&#39; taken as a whole will be at \nleast slightly out of balance in one direction or the other and will \ntend towards no structure or bloat - unless there are indeed mechanisms \nin place that cause an equlibrium to be found - in the absence of \nselection pressure anyhow. The problem is that any slight bug or change \nto an algorithm could set it off balance. Really I suppose I&#39;m thinking \nabout entropy here - unless there is a mechanism to keep things in order \nthen entropy will usually increase, as a general rule anyway.\n\nClear as mud?\n\nColin\n\n"}}