{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[{"name":"READ"}]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"userId":7192225,"authorName":"Ian Badcoe","from":"Ian Badcoe &lt;ian_badcoe@...&gt;","profile":"ian_badcoe","replyTo":"LIST","senderId":"M_90pn3YNDDqISVAr4imswCGtvY7vdGYu0B5hfSkk8ywDP9d-7RM1L08tmcV1954jWp-d_ZUQe0JBoFxk6DSKgZLRJYfvYBILok","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [neat] SLEAT TTT first results","postDate":"1147904625","msgId":2637,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDYuMi4zLjQuMC4yMDA2MDUxNzIyMzQyNy4wMmM2NTZkOEBwb3AubWFpbC55YWhvby5jby51az4=","inReplyToHeader":"PDIwMDYwNTE2MTk1NTAxLjU3MDQxLnFtYWlsQHdlYjI1MTA5Lm1haWwudWtsLnlhaG9vLmNvbT4=","referencesHeader":"PDIwMDYwNTE2MTk1NTAxLjU3MDQxLnFtYWlsQHdlYjI1MTA5Lm1haWwudWtsLnlhaG9vLmNvbT4="},"prevInTopic":2636,"nextInTopic":2638,"prevInTime":2636,"nextInTime":2638,"topicId":2635,"numMessagesInTopic":7,"msgSnippet":"Hi, OK so I finally have to results to ponder.  Let me tell you what I think in no particular order... ...and ask everyone for anything they can think of to","rawEmail":"Return-Path: &lt;ian_badcoe@...&gt;\r\nX-Sender: ian_badcoe@...\r\nX-Apparently-To: neat@yahoogroups.com\r\nReceived: (qmail 7107 invoked from network); 17 May 2006 22:21:22 -0000\r\nReceived: from unknown (66.218.67.34)\n  by m24.grp.scd.yahoo.com with QMQP; 17 May 2006 22:21:22 -0000\r\nReceived: from unknown (HELO mail.idnet.net.uk) (212.69.36.63)\n  by mta8.grp.scd.yahoo.com with SMTP; 17 May 2006 22:21:21 -0000\r\nReceived: from [212.69.55.164] by mail.idnet.net.uk (GMS\n 11.01.3365/NU3963.00.7ca42f0c) with ESMTP id besarlaa for\n neat@yahoogroups.com; Wed, 17 May 2006 23:21:02 +0100\r\nMessage-Id: &lt;6.2.3.4.0.20060517223427.02c656d8@...&gt;\r\nX-Mailer: QUALCOMM Windows Eudora Version 6.2.3.4\r\nDate: Wed, 17 May 2006 23:23:45 +0100\r\nTo: neat@yahoogroups.com\r\nIn-Reply-To: &lt;20060516195501.57041.qmail@...&gt;\r\nReferences: &lt;20060516195501.57041.qmail@...&gt;\r\nMime-Version: 1.0\r\nContent-Type: text/plain; charset=&quot;us-ascii&quot;; format=flowed\r\nX-eGroups-Msg-Info: 1:12:0:0\r\nFrom: Ian Badcoe &lt;ian_badcoe@...&gt;\r\nSubject: Re: [neat] SLEAT TTT first results\r\nX-Yahoo-Group-Post: member; u=7192225; y=M456phlsmrH-ikJ0vXE8QKYqCKXOusjxqX24NpCT6taTKdF0fg\r\nX-Yahoo-Profile: ian_badcoe\r\n\r\nHi,\n\n\tOK so I finally have to results to ponder.  Let me tell you what I \nthink in no particular order...\n\n...and ask everyone for anything they can think of to add.\n\nThese experiments were to create TicTacToe players, using the \n&quot;cheating&quot; method of evaluating with the &quot;Perfect Player Score&quot; \n(TTT-PPS) that I outlined before.\n\n\tWhat I&#39;ve been doing is fishing for reasonable parameters.  So I set \nup a basic configuration, and (to avoid a combinatorial explosion of \ntests) just varied one parameter at a time.\n\n--\n\n\tI was also using:\n\nSLEAT - where multiple chromosomes communicate to one another via \nrewritten versions of the input data.\n\nVariance - where all weights and FIDs (FIDs are a detail of SLEAT) \nhave an accompanying &quot;variance&quot; and every time they are reproduced \nthey are varied within a normal distribution centered on their \ncurrent value and with a width based on the variance (this is like \nEvolutionary Computation (EC)).\n\nControl of genome size via only 50% chance of inclusion of unpaired \ngenes in cross breeding.\n\nMultiple node modes (sigmoid, and, or, xor, ...)\n\nThe simplest form of my &quot;advanced speciation&quot;\n\nAnd I ran three different random number seeds for each one.  And ran \neach run up to 10,000,000 cycles (call that 100,000-ish generations).\n\n--\n\nThe parameters I varied were:\n\n1) population size\n2) how much to mutate to create a new species\n3) mutation rate\n4) how long to keep trying with a stalled species\n5) whether to mostly crossover/mutate or mostly clone/mutate\n6) whether to keep champions when merging species (preserving merge)\n7) whether to punish illegal moves (PPS parameter)\n8) whether to reward partial success (PPS parameter)\n\nAnd the results of this are in the file I uploaded.  For each there \nare two graphs (i) the whole thing, (ii) zoomed on the 0.9 to 0.95 \nregion of fitness.  The latter is because it is clear that my biggest \nproblem is the way the search slows at high scores.\n\n--\n\nConclusions and puzzlements:\n\n1) population of 50 is best (this is per species, I use up to 2 \nspecies at a time at the moment).  You can see how small population \nsizes work, but are unreliable and a size of 100 works but is slower...\n\n2) there is no overall conclusion from the degree of mutation for a \nnew species, as &quot;20 mutations&quot; is highest at the end, we could call \nthat a winner, but as one of my other conclusions is going to be a \nmore general &quot;mutate more&quot;, I think I reserve judgement on this.\n\n3) low mutation just failed, I&#39;m not 100% sure why, but I&#39;m thinking \nthat individual added genes were so rare they never met one another...\n\nHigh mutation is better, so my conclusion is to try higher mutation \nrates still and try to find an optimum.\n\n4) no overall conclusion about how long to wait on a stalled species \nbefore spawning a new one, less patient might be better but overall I \nwould say this wasn&#39;t conclusive yet.  Trying higher mutation rates \nmight change the scale of these anyway.\n\n5) Too much breeding verses just clone/mutate is slightly worse, but \nonly slightly.\n\n6) Not keeping champions during species merges is slightly better.  I \nhave no idea why, except that maybe the species merge doesn&#39;t tend to \nlose anything even without this (thus it doesn&#39;t help) and keeping \nchampions occasionally gets in the way of a less fit hybrid that has \nthe _potential_ to be more fit.  I&#39;m going to keep champions until I \nhave firmed up the other params, and then try this again in more detail.\n\n7/8) These change the scoring system and cannot be simply compared \nwith the other absolute score values.  I will recalculate their final \nresults in the same system as the others as a guide.  Generally, \nhowever, neither of these curves looks especially better or \nworse.  Punishing illegal moves shifts the whole curve down, \nrewarding partial success pushes the whole curve up, but generally my \nguess is this is just due to the change in the score system and the \nresults are about the same.\n\n--\n\nOne embarrassment I have from this is I underestimated how much I \nneeded to change the random numbers to get a genuinly different \nrun.  e.g. for my data set #2 I just advanced the random number \nsequence by a couple of hundred thousand, thinking that although the \nsequences would overlap, every number would be used in a different \ncontext and hence very different.  In fact, some of my curves in \nthese two sets start as time-shifted versions of one another, and \nmanage to hold on to that similarity for up to half the run!\n\nSo the lesson there is &quot;always use completely different random number seeds&quot;!\n\n--\n\nThis represents about 18 CPU-weeks of work...\n\n--\n\nSpecial thanks to Colin for providing 1/3 of the CPU.  My next step \nis a smaller series of higer mutation studies, then look at \nspeciation params again, then look at keeping champions in some \ndetail...  The current best player I have seen has a PPS of 94.8%.  I \nneed to upgrade some software before I can take it on man to man...\n\n\tIan\nIn 15 minutes everybody will be in the future.\n\n\n\n"}}