{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[{"name":"READ"}]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"userId":243207931,"authorName":"John Peberdy","from":"&quot;John Peberdy&quot; &lt;john@...&gt;","profile":"johnpeberdy","replyTo":"LIST","senderId":"8ubSRELqxVPLF1aLS4TVf7MHsuvWa2B-dhxRNr5f2_O347b6jYJjrKrhMOfk_Q7UJp5Z9d7bMfwk_PwB6DXzq6VLJX6sCDw","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [neat] Evolving a Trading Strategy: Update","postDate":"1158088978","msgId":2743,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGRlMzExZjkzMDYwOTEyMTIyMnBhOWY4YzE0dzcxNjRhOWY2MjQ5YTdlYzBAbWFpbC5nbWFpbC5jb20+","inReplyToHeader":"PDAwMDAwMWM2ZDVmNSQzODBkZjM2MCQwMzAyYThjMEBtb2JpbGU+","referencesHeader":"PDQ0RkY0ODNCLjMwNDA0MDZAZHNsLnBpcGV4LmNvbT4JIDwwMDBhMDFjNmQzYmUkM2E4ODgzZjAkMDIwMmE4YzBASG91c2U+CSA8NDUwMkI1NjEuNDA0MDAwN0Bkc2wucGlwZXguY29tPgkgPDAwMDAwMWM2ZDVmNSQzODBkZjM2MCQwMzAyYThjMEBtb2JpbGU+"},"prevInTopic":2742,"nextInTopic":2744,"prevInTime":2742,"nextInTime":2744,"topicId":2733,"numMessagesInTopic":13,"msgSnippet":"Sort of off topic here but has anyone noticed that finance.yahoo.com has changed the adjusted closes of some companies around February 2006. I first downloaded","rawEmail":"Return-Path: &lt;johnpeb@...&gt;\r\nX-Sender: johnpeb@...\r\nX-Apparently-To: neat@yahoogroups.com\r\nReceived: (qmail 64525 invoked from network); 12 Sep 2006 19:24:05 -0000\r\nReceived: from unknown (66.218.66.166)\n  by m38.grp.scd.yahoo.com with QMQP; 12 Sep 2006 19:24:05 -0000\r\nReceived: from unknown (HELO wx-out-0506.google.com) (66.249.82.226)\n  by mta5.grp.scd.yahoo.com with SMTP; 12 Sep 2006 19:24:05 -0000\r\nReceived: by wx-out-0506.google.com with SMTP id s12so2065900wxc\n        for &lt;neat@yahoogroups.com&gt;; Tue, 12 Sep 2006 12:22:59 -0700 (PDT)\r\nReceived: by 10.90.90.3 with SMTP id n3mr2411452agb;\n        Tue, 12 Sep 2006 12:22:58 -0700 (PDT)\r\nReceived: by 10.90.68.3 with HTTP; Tue, 12 Sep 2006 12:22:58 -0700 (PDT)\r\nMessage-ID: &lt;de311f930609121222pa9f8c14w7164a9f6249a7ec0@...&gt;\r\nDate: Tue, 12 Sep 2006 15:22:58 -0400\r\nTo: neat@yahoogroups.com\r\nIn-Reply-To: &lt;000001c6d5f5$380df360$0302a8c0@mobile&gt;\r\nMIME-Version: 1.0\r\nContent-Type: text/plain; charset=ISO-8859-1; format=flowed\r\nContent-Transfer-Encoding: 7bit\r\nContent-Disposition: inline\r\nReferences: &lt;44FF483B.3040406@...&gt;\n\t &lt;000a01c6d3be$3a8883f0$0202a8c0@House&gt;\n\t &lt;4502B561.4040007@...&gt;\n\t &lt;000001c6d5f5$380df360$0302a8c0@mobile&gt;\r\nX-eGroups-Msg-Info: 1:0:0:0\r\nX-eGroups-From: &quot;John Peberdy&quot; &lt;johnpeb@...&gt;\r\nFrom: &quot;John Peberdy&quot; &lt;john@...&gt;\r\nReply-To: john@...\r\nSubject: Re: [neat] Evolving a Trading Strategy: Update\r\nX-Yahoo-Group-Post: member; u=243207931; y=H3fltj1vhvtJZu_lEteV4DvrtyDr9OhI_P-rKz5t5xMw0kWYcNw\r\nX-Yahoo-Profile: johnpeberdy\r\n\r\nSort of off topic here but has anyone noticed that finance.yahoo.com\nhas changed the adjusted closes of some companies around February\n2006. I first downloaded a bunch of data around that time and inserted\nit into a database. Recently I&#39;ve written a script to update my\ndatabase and at least one of the adjusted closes for about 50% of the\ncompanies are off, but all the other data is fine!\n\nI&#39;m currently working on a script to to check the\ndatabase-finance.yahoo consistency further but I&#39;ll get back to you if\nI notice any order to the changing data\n\nJohn\n\n\nOn 9/10/06, Jeff Morton &lt;jeffrmorton@...&gt; wrote:\n&gt;\n&gt;\n&gt;\n&gt;\n&gt; There really aren&#39;t any studies I can  personally attest to since I have really just begun this learning process  myself.  I will note that it appears to me based solely on observation that  using just the technical bar data is inadequate.  This kind of reminds me  of the problem faced when trying to use neural networks to recognize  speech.  In this instance a simple frame by frame fourier transform of the  data will not produce the patterns necessary for detection.  You  actually have to analyze the spectrogram of varying time periods for those  patterns to develop properly.\n&gt;\n&gt; It might be more useful to include standard  indicators over differing time periods with other fundamental financial data,  etc.  Perhaps using statistics like those used in digital signal processing  would be a better idea as well.\n&gt;\n&gt; I think the biggest problem at this point is that  PCs just aren&#39;t quite fast enough or are limited by available RAM.  this is  bound to change very quickly though so developing these systems now makes a lot  of sense to me.\n&gt;\n&gt; As far as my current implementation is  concerned.  Bascially what I&#39;ve done is developed a backtesting engine  which is utilized by an agent of sorts which randomly selects techical  indicators with varying parameters and runs them against the market data.   This has been marginally effective and I think this has just brought home the  point to me that technical indicators alone are not enough.\n&gt;\n&gt; My current idea is to replace those algorithmic  technical indicators with small neural networks that I can train to act as  technical indicators.  Not because I necessarily believe this will produce  better results but because I intend to modify my current system to handle neural  networks instead of the predefined indicator classes I&#39;m currently using.   NEAT looks like a good place to start digging into code to do this.\n&gt;\n&gt; BTW, I&#39;m working in C#.\n&gt;\n&gt; As far as the time series data, if all you are  looking for are a couple of data sets than you should definately check out  finance.yahoo.com.  You can download CSV files for free.  The oldest I  have going back to the 1960&#39;s (IBM on the NYSE).\n&gt;\n&gt; If you think you might have a need for ALL of it  then we can make arangements for me to transmit this to you over the  internet.  That file which covers all historical data for all US markets  compressed to just over 500meg using RAR.\n&gt;\n&gt;\n&gt;\n&gt;\n&gt; ----- Original Message -----\n&gt; From:    Colin    Green\n&gt; To: neat@yahoogroups.com\n&gt;\n&gt; Sent: Saturday, September 09, 2006 8:36    AM\n&gt; Subject: Re: [neat] Evolving a Trading    Strategy: Update\n&gt;\n&gt;\n&gt;\n&gt;\n&gt; Hi Jeff,\n&gt;\n&gt; Jeff Morton wrote:\n&gt;\n&gt; &gt;I&#39;d like to introduce myself    since I&#39;m basically doing the same thing you are and would like to interact    with other idividuals about this. I&#39;ve read a significant number of published    academic papers on the subject of using neural networks to forecast financial    markets, and it appears to me that the majority of experiments produce results    which are better than chance.\n&gt; &gt;\n&gt;\n&gt; I have to admit to not having    read any papers on the subject for some\n&gt; years. Largely on the basis that    anyone with a profitable system will\n&gt; probably keep the details to    themselves and the institution/fund they\n&gt; work for - or they may    approach some fund managment company on finding a\n&gt; good system, e.g. if it    only works on a short term real time basis and\n&gt; therefore needs expensive    data feeds and other infrastructure to be useful.\n&gt;\n&gt; Just out of interest    are there any papers in particular that you would\n&gt; suggest    reading?\n&gt;\n&gt; &gt; I&#39;ve also read several news articles in recent past about    these techniques being used by financial institutions, but the actual    information on how they work is always missing. Clearly there is a natural    human instinct to defend information which is advantageous to survival, and I    believe the evidence for this occuring here is intuitively obvious.\n&gt; &gt;\n&gt; &gt;\n&gt;\n&gt; Indeed.\n&gt;\n&gt; &gt;I&#39;ve been working on an application (a    toolbox of sorts) which is capable of evolving trading strategies based on    common technical indicators with variable time frames through the use of basic    genetic algorithms. I am interested in creating component indicators based on    simple neural networks and intend to utilize the ShaprNEAT code (btw, thank    you to the author who ported this) to build these networks.\n&gt; &gt;\n&gt; &gt;\n&gt;\n&gt; Ok perhaps you could explain in a bit more detail what you    mean by\n&gt; &quot;component indicators based on simple neural networks&quot;? Do you    mean\n&gt; evolving ANNs produce a technical indicator, the outputs of which can\n&gt; then be used elsewhere? Sounds a bit like modular NEAT.\n&gt;\n&gt; &gt;Since    you are already doing this I was wondering if you would be willing to share    the code you&#39;ve developed so far. You mentioned that you were lacking in    market data to train your networks. I&#39;ve developed a simple tool to import US    market data from YAHOO finance if you are interested. Compressed, the data is    approximately 500 megs and contians the nasdaq, nyse, amex, nasdaq fund    market, and some of the otcbb issues. I have a tool to scan this data for    logical anomalies and the data seems very clean.\n&gt; &gt;\n&gt; &gt;\n&gt;\n&gt; Yes    I&#39;d be interested in some form of collaboration, about how far back\n&gt; does    your collected data go? Also if you have a reasonably fast PC you\n&gt; should    be able to compress that data down to a more manageable size\n&gt; using 7zip    (www.7zip.org), although 500mb is fairly manageable in these\n&gt; days of    broadband.\n&gt;\n&gt; Regards,\n&gt;\n&gt; Colin.\n&gt;\n&gt;\n&gt;\n&gt;\n&gt;                   \n\n\n\n-- \nJohn Peberdy\n\n"}}