{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[{"name":"READ"}]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"userId":82117382,"authorName":"Jim O&#39;Flaherty, Jr.","from":"&quot;Jim O&#39;Flaherty, Jr.&quot; &lt;jim_oflaherty_jr@...&gt;","profile":"jim_oflaherty_jr","replyTo":"LIST","senderId":"X1QFPSWoojTfoKIo6lPkTkyQjJNh5yFv0QFRgEcEN9O3Aq8HI91ocrHJZ21l_3m0DQd9IqefiV7Nz7pS6KqW_cE0LQ0DOu1fGFoyn8YDtvXWoizQtY2Fb_4","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [neat] Definition of Evolution","postDate":"1075393378","msgId":348,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDIwMDQwMTI5MTYyMjU4Ljg2OTM1LnFtYWlsQHdlYjE0MzA2Lm1haWwueWFob28uY29tPg==","inReplyToHeader":"PDIwMDQwMTI4MTcxMDQ1Ljk0MzA3LnFtYWlsQHdlYjYwNTA4Lm1haWwueWFob28uY29tPg=="},"prevInTopic":347,"nextInTopic":350,"prevInTime":347,"nextInTime":349,"topicId":336,"numMessagesInTopic":27,"msgSnippet":"Derek, I sense there is over-emphasis on the definition of the word evolution in this conversation. That said, here goes... I both strongly agree and mildly","rawEmail":"Return-Path: &lt;jim_oflaherty_jr@...&gt;\r\nX-Sender: jim_oflaherty_jr@...\r\nX-Apparently-To: neat@yahoogroups.com\r\nReceived: (qmail 95982 invoked from network); 29 Jan 2004 16:23:06 -0000\r\nReceived: from unknown (66.218.66.172)\n  by m7.grp.scd.yahoo.com with QMQP; 29 Jan 2004 16:23:06 -0000\r\nReceived: from unknown (HELO web14306.mail.yahoo.com) (216.136.173.82)\n  by mta4.grp.scd.yahoo.com with SMTP; 29 Jan 2004 16:23:05 -0000\r\nMessage-ID: &lt;20040129162258.86935.qmail@...&gt;\r\nReceived: from [205.158.160.209] by web14306.mail.yahoo.com via HTTP; Thu, 29 Jan 2004 08:22:58 PST\r\nDate: Thu, 29 Jan 2004 08:22:58 -0800 (PST)\r\nTo: neat@yahoogroups.com\r\nIn-Reply-To: &lt;20040128171045.94307.qmail@...&gt;\r\nMIME-Version: 1.0\r\nContent-Type: text/plain; charset=us-ascii\r\nX-eGroups-Remote-IP: 216.136.173.82\r\nFrom: &quot;Jim O&#39;Flaherty, Jr.&quot; &lt;jim_oflaherty_jr@...&gt;\r\nSubject: Re: [neat] Definition of Evolution\r\nX-Yahoo-Group-Post: member; u=82117382\r\nX-Yahoo-Profile: jim_oflaherty_jr\r\n\r\nDerek,\n\nI sense there is &quot;over-emphasis&quot; on the definition of the word evolution in this conversation. \nThat said, here goes...\n\n\nI both strongly agree and mildly disagree with what you have asserted.  ;^)\n\nI would start with agreement - When placing the notion of evolution in a &quot;volitional\nconsciousness&quot; metaphor, it seems logically consistent to state &quot;...And that&#39;s all evolution is. \nNo intent.  No direction.&quot;  It seems obvious to me &quot;evolution&quot; (a vastly simplified notion\ndescribing a supremely complex highly parallel massively distributed non-deterministic phenomenon)\nhas no appearance of being &quot;guided&quot; by some meta-evolutionary system.\n\nThe system just is.  It has components.  The components have some affinities for other components.\n Some of the components interoperate closely, and others distantly.  All sorts of &quot;grossly\nsimplified&quot; scientific explanations using causality (again, a vast oversimplification to\ndemonstrate some degree if higher probability in predicting outcomes) can be had to describe this\nunintended and undirected process.  It is breathtaking how beautifully complex and consistent the\nsystem seems to be and behave.\n\n\nAs for my disagreement - Evolution may remain an unintended process  I feel this just describes\nits origins.  However, I do not think it can be said accurately it remains undirected.\n\nOnce homo-sapien became verbally capable and followed very shortly, at least in geological time\nframes, symbolically capable, evolution started being mildly guided (as opposed to undirected). \nAnd with the discover of genetics, DNA and then biotech, evolution is now more strongly guided\nprocess and will remain so unless humans (or automatic reproductive entities utilizing symbolic\nprocessing) are eliminated.  The domain and lineage of volitionally conscious symbolic thought is\nitself remarkably similar to that of DNA and genetics.  There is a new fields, mimetics (rhymes\nwith genetics), which strives to describe the &quot;evolution&quot; of symbolic thought in terms similiar to\nthat of genetics.\n\nI think evolution (and eventually even its fundamental definition) is forever altered (and\ndirected) by the emergence of mimetics.\n\nJust as a rudimentary philosophy is directly depended upon basic psychology, and advanced\npsychology is dependent upon the rudementary philosophy, in a continuous upwards cycle (called a\n&quot;strange loop&quot; by Dr. Hoffstadtler), I think genetics and mimetics are a form of strange loop.\n\nI think Hofstadler&#39;s work &quot;Godel, Escher, Bach: Eternal Golden Braid&quot; does a fantastic job\ndemonstrating the notions of self-referentiality, emergence, strange loops and demonstrating\nGodel&#39;s central premise of the &quot;incompleteness&quot; of a system&#39;s (and thereby a word&#39;s) definition as\nclosed (or complete).\n\nGiven homo-sapien&#39;s very small time present as a species, we certainly has dramatically impacted\nevolution here on the third rock out from Sol.  And now that we can reason about the &quot;concept&quot;\nevolution, we will continue to further harness and exploit it and use it for the powerful tool it\nis.  Why?  Because we are tool fixated organisms.  And we like feeling powerful!  :^)\n\nAnd I *LOVE* being a powerful tool fixated organism!\n\n\nJim O&#39;Flaherty\n\n\n--- Derek James &lt;blue5432@...&gt; wrote:\n&gt; Well actually the most widely-accepted definition of\n&gt; evolution is simply a change in the frequency of genes\n&gt; in a population.  Evolution is not inherently\n&gt; directional; it is simply change.\n&gt; \n&gt; And change could easily be demonstrated in NEAT\n&gt; without a fitness function.  Given a population of 100\n&gt; individuals, 20% could simply be randomly selected to\n&gt; produce offspring via the NEAT mating method, which\n&gt; would then be subject to NEAT&#39;s mutation operators,\n&gt; refilling the population to its original size.  20%\n&gt; could then be randomly selected to survive into the\n&gt; next generation...and so on.\n&gt; \n&gt; Even with no fitness function, the population will\n&gt; evolve.  That is, the gene frequencies of the final\n&gt; generation will be different from the original\n&gt; population (just how different will depend on\n&gt; parameter settings, such as mutation rates).\n&gt; \n&gt; And that&#39;s all evolution is.  No intent.  No\n&gt; direction.\n&gt; \n&gt; Of course, for our purposes, we want the change to go\n&gt; in a particular direction, to optimize a particular\n&gt; behavior or set of behaviors, and we try to tailor a\n&gt; fitness function that we think best captures the\n&gt; features of those behaviors.  We&#39;re interested in\n&gt; directional change.\n&gt; \n&gt; But strictly speaking, biological evolution is not.\n&gt; \n&gt; Derek\n&gt; \n&gt; __________________________________\n&gt; Do you Yahoo!?\n&gt; Yahoo! SiteBuilder - Free web site building tool. Try it!\n&gt; http://webhosting.yahoo.com/ps/sb/\n&gt; \n\n\n\n__________________________________\nDo you Yahoo!?\nYahoo! SiteBuilder - Free web site building tool. Try it!\nhttp://webhosting.yahoo.com/ps/sb/\n\n"}}