{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[{"name":"READ"}]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"userId":211599040,"authorName":"Jeff Clune","from":"Jeff Clune &lt;jclune@...&gt;","profile":"jeffreyclune","replyTo":"LIST","senderId":"Eps7_kJ_PEvyOyEG6ZqYJQPg11YmwZp14mqL7xyKDV-GyI9ja03szDjkTEsBvtiiVU8DtaKJV1O_3Fp7NGZHwsV3","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [neat] What&#39;s Natural About Interactive Evolution (Warning: LONG message)","postDate":"1187126779","msgId":3515,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEMyRTc5NjNCLjFCQ0UwJWpjbHVuZUBtc3UuZWR1Pg==","inReplyToHeader":"PGY5cDRrOCtuZ2FpQGVHcm91cHMuY29tPg=="},"prevInTopic":3512,"nextInTopic":3516,"prevInTime":3514,"nextInTime":3516,"topicId":3478,"numMessagesInTopic":28,"msgSnippet":"See below. ... But I ll bet you can t reproduce images using IEC either...I tried to get to a tiger looking shape and did not get very far (though I only stuck","rawEmail":"Return-Path: &lt;jclune@...&gt;\r\nX-Sender: jclune@...\r\nX-Apparently-To: neat@yahoogroups.com\r\nReceived: (qmail 14135 invoked from network); 14 Aug 2007 21:28:27 -0000\r\nReceived: from unknown (66.218.67.35)\n  by m39.grp.scd.yahoo.com with QMQP; 14 Aug 2007 21:28:27 -0000\r\nReceived: from unknown (HELO el-out-1112.google.com) (209.85.162.176)\n  by mta9.grp.scd.yahoo.com with SMTP; 14 Aug 2007 21:28:27 -0000\r\nReceived: by el-out-1112.google.com with SMTP id r23so344849elf\n        for &lt;neat@yahoogroups.com&gt;; Tue, 14 Aug 2007 14:26:26 -0700 (PDT)\r\nDKIM-Signature: a=rsa-sha1; c=relaxed/relaxed;\n        d=gmail.com; s=beta;\n        h=domainkey-signature:received:received:user-agent:date:subject:from:to:message-id:thread-topic:thread-index:in-reply-to:mime-version:content-type:content-transfer-encoding:sender;\n        b=rDy74869QpIEVLYmfjiebIy566XkrRGU7TH7OxpsS1N1GWsijUVoZmYbb3gK2w85FKNMEGlB8Z8QtgRjBP33PQZ382XGgZq1J3GfDg+JTMzLCq7cgYk4C+HPyeI6HzNrFSRgAlFRpFOmEO30CgMyzumJ4GA3AB61h5UnhcqZcmU=\r\nReceived: by 10.90.68.15 with SMTP id q15mr4224081aga.1187126785855;\n        Tue, 14 Aug 2007 14:26:25 -0700 (PDT)\r\nReturn-Path: &lt;jclune@...&gt;\r\nReceived: from ?192.168.2.10? ( [24.23.79.232])\n        by mx.google.com with ESMTPS id 15sm28268633nzo.2007.08.14.14.26.22\n        (version=TLSv1/SSLv3 cipher=OTHER);\n        Tue, 14 Aug 2007 14:26:23 -0700 (PDT)\r\nUser-Agent: Microsoft-Entourage/11.3.3.061214\r\nDate: Tue, 14 Aug 2007 17:26:19 -0400\r\nTo: &quot;neat@yahoogroups.com&quot; &lt;neat@yahoogroups.com&gt;,\n\tKenneth Stanley &lt;kstanley@...&gt;\r\nMessage-ID: &lt;C2E7963B.1BCE0%jclune@...&gt;\r\nThread-Topic: [neat] What&#39;s Natural About Interactive Evolution (Warning:\n LONG message)\r\nThread-Index: AcfeucDm/5EIlkqsEdy7bgAX8sZ+PA==\r\nIn-Reply-To: &lt;f9p4k8+ngai@...&gt;\r\nMime-version: 1.0\r\nContent-type: text/plain;\n\tcharset=&quot;US-ASCII&quot;\r\nContent-transfer-encoding: 7bit\r\nX-eGroups-Msg-Info: 1:0:0:0\r\nFrom: Jeff Clune &lt;jclune@...&gt;\r\nSubject: Re: [neat] What&#39;s Natural About Interactive Evolution (Warning:\n LONG message)\r\nX-Yahoo-Group-Post: member; u=211599040; y=WBFL5En3NK6_BIN728LkwF0NRiKDajzCpJTH4hZbfhMTxezbmTAx\r\nX-Yahoo-Profile: jeffreyclune\r\n\r\nSee below. \n\n&gt; image as a target and evaluate against that.  Could we then evolve a\n&gt; CPPN (or ANN if you prefer) that produces the desired image?\n&gt; \n&gt; The answer is surprising (we&#39;ve tried it!).  It turns out to be very\n&gt; hard with anything but the simplest of images.  What you discover\n&gt; quickly is that the fitness function isn&#39;t rewarding the right\n&gt; things.  The images tends to devolve into a gray cloud that minimizes\n&gt; error by choosing an intermediate shade- not what you want at all.\n&gt; \n&gt; Yet the issue is deeper than that.  In fact, here is what is really\n&gt; interesting: If you take any image (except the simplest ones) on\n&gt; Picbreeder- images that were evolved through IEC with NEAT- you will\n&gt; not be able to evolve to those same images through TBE with NEAT!  I\n&gt; challenge anyone to disprove me on this; I&#39;d be very interested.\n&gt; \n&gt; That is a remarkable observation: NEAT can&#39;t reproduce it&#39;s own\n&gt; results!  The only conclusion is that the selection method is the\n&gt; culprit.  That is, it has to do with how you decide what&#39;s good in\n&gt; any particular generation, which of course is different in IEC and\n&gt; TBE.\n\nBut I&#39;ll bet you can&#39;t reproduce images using IEC either...I tried to get to\na tiger looking shape and did not get very far (though I only stuck around\nfor about 40 generations). Note: a tiger&#39;s entire body in profile, not a\nface. \n\n&gt; So let&#39;s look more closely at this issue:  How did we evolve images\n&gt; interactively that could not be reached through regular TBE?  The\n&gt; answer is that humans have a different way of rewarding intermediate\n&gt; results.  In particular, human breeders in IEC examine what is good\n&gt; *in the present* and make their decision based on that whereas TBE\n&gt; compares what you have in the present to a long-term future goal.\n&gt; \n&gt; Perhaps if you&#39;ve used Picbreeder or IEC you may think that you were\n&gt; actually evolving to a target and thus that I am wrong.  But\n&gt; Picbreeder disproves this view.  As soon as *someone else* branches\n&gt; from your image, whatever &quot;target&quot; you may have had in mind (if any)\n&gt; is irrelevant.  They have their own ideas about what is good.  So it\n&gt; isn&#39;t possible that what the next person in the chain evolved was\n&gt; your original intent.\n&gt; \n&gt; On the other hand I may not need to go that far to make the point\n&gt; because if you&#39;re like me, you kind of discover what&#39;s cool as you\n&gt; go.  I may have a vague idea in mind, but on the road to that idea I\n&gt; see that something cool I hadn&#39;t thought of before pops up, so I go\n&gt; off in that direction instead.  What matters most is what&#39;s good in\n&gt; the present.\n&gt; \n&gt; Now here is the connection to natural evolution:  Natural evolution\n&gt; is also completely unconcerned with ultimate goals or targets.  It\n&gt; only concerns itself with whether the present candidates are good in\n&gt; the present.  \n&gt; \n&gt; I am going to argue that that is a major source of its power; it\n&gt; explains in part its prolific creativity and its astounding ability\n&gt; to elaborate indefinitely.  Yes, I am claiming that it can do all\n&gt; that because it *doesn&#39;t* have a target.\n\nTrue, but the problem is not IEC vs TBE...it is long-term targets vs.\nsomething like co-evolution.\n\n&gt; So then what&#39;s so great about not having a target?  What&#39;s great is\n&gt; that you get rewarded for doing what you *can* do.  And a good\n&gt; encoding can do a lot.  However, what&#39;s very difficult, even for a\n&gt; good encoding, is to do a completely arbitrary complex thing that is\n&gt; nowhere close to the current population in the search space.\n&gt; \n&gt; That is why I called TBE a liability:  It evaluates the current\n&gt; candidates against something that ignores their current strengths\n&gt; completely.  For example, imagine if the first bilateria (bilaterally-\n&gt; symmetric organisms) were evaluated for their humanity.  They would\n&gt; all fail miserably and they would all therefore be eliminated.\n&gt; Humanity would never have evolved even though we in fact did evolve\n&gt; from the first bilateria!  If TBE were in charge and humans were the\n&gt; goal, we wouldn&#39;t exist right now.\n&gt; \n&gt; Try going back even farther.  Can you imagine evaluating single\n&gt; celled organisms for their &quot;human-ness?&quot;  That would be silly.\n&gt; \n&gt; Yet that is exactly what we are doing in most evolutionary\n&gt; experiments.  We do nothing to capture good intermediate ideas from\n&gt; which it would be possible to build our ultimate objectives.  So we\n&gt; are hampered from getting anywhere truly interesting.\n\nIs that true in experiments like Karl Sims, or in the Golem Project, were\ngoals were things like &quot;whatever can move the farthest from the starting\npoint in x seconds is more fit&quot;? It seems like you can equally judge\nbilaterals vs. humans on this goals (and man do those bilaterals suck...but\nthey are probably better than single cells).\n\n&gt; \n&gt; Then you might ask, that&#39;s all well and good, but how in the world\n&gt; can we reward the intermediate serendipitous discoveries if we don&#39;t\n&gt; know what they should be?  The  answer is: Respect the fact that you\n&gt; don&#39;t know what they are.  Stop trying to *tell* evolution what it\n&gt; can do and let it *show* you what it can do.  When it shows you\n&gt; something cool, then keep that for later.  Keep everything with any\n&gt; promise for later.  You never know what might be a foundation for the\n&gt; next level up.\n&gt; \n&gt; That&#39;s exactly what natural evolution did and that&#39;s exactly what IEC\n&gt; (Picbreeder variety) does:  In nature what happened was that there\n&gt; were many ways of doing a good job (at surviving) and there was room\n&gt; enough on Earth to support a lot of them at once.  Nobody &quot;knew&quot;\n&gt; which ones would form a good foundation for something more complex\n&gt; (and many lineages didn&#39;t go anywhere), but because a lot of cool\n&gt; ideas were able to hang around, some of them happened to be good\n&gt; stepping stones to the next big thing.  The issue was where the DNA\n&gt; encoding could go next from where it is now.\n&gt; \n&gt; Same with IEC in Picbreeder:  We don&#39;t know what we want to evolve\n&gt; collectively.  I think it&#39;s fair to say that we have no collective\n&gt; common goal at all.  We are all just trying different paths.  Some of\n&gt; us, when we see a cool path, take that path a bit farther and a bit\n&gt; farther still.  We keep all the intermediate stages around forever\n&gt; and we therefore preserve all possible stepping stones.  Some happen\n&gt; to be genuinely good foundations for future progress, like those that\n&gt; produced the car, or the recent skull.  Yet who would have seen that\n&gt; coming?  If we had tried to evolve to them from the start, we&#39;d be\n&gt; nowhere (we&#39;d be in the usual TBE trap).\n&gt; \n&gt; For this reason, what&#39;s going on in Picbreeder is really intriguing.\n&gt; It&#39;s the first artificial evolutionary experiment that is really\n&gt; doing something like natural evolution!  We may have some amazing\n\nKarl Sims had exhibits where the length of time people stood in front of an\nimage determined its fitness...and there have been others that put the\nfitness evaluation in the hands of distributed users (one at Gecco this\nyear, for example)...so, while I think that (because of the CPPN)\npicbreeder&#39;s images are cooler than what others are producing, isn&#39;t it a\nstretch to call it the first?\n\n&gt; encodings out there, but we don&#39;t get to see it because all we do is\n&gt; TBE, where we keep losing the intermediate foundations we would need\n&gt; to get to a new level.  Picbreeder is the first time that we let\n&gt; evolution show us what it can do instead of telling it what we want\n&gt; it to do.  We are respecting the encoding just as nature respected\n&gt; DNA.\n&gt; \n&gt; There are some important corollaries: First, TBE is not just about\n&gt; images.  In effect, all regular fitness functions have the same TBE\n&gt; liability.  Do you think you can evolve an amazing neural network\n&gt; with NEAT or with HyperNEAT?  Or something else?  Well, if you have a\n&gt; target behavior that you evaluate against, you are never going to\n&gt; know how amazing things could be.  This is a sobering realization.\n&gt; But it&#39;s just as true with behaviors as it is with images.  (This\n&gt; insight suggests that evolving behaviors interactively instead of\n&gt; through a fitness function is a really promising path)\n&gt; \n&gt; One exception is competitive coevolution, wherein individuals\n&gt; actually are evaluated against other individuals, so it&#39;s not really\n&gt; target-based.  In a sense individuals are recognized for being as\n&gt; good as they can be in the present.  Of course, nature is a kind of\n&gt; coevolution.\n&gt; \n&gt; Yet I don&#39;t want to pretend that competitive coevolution is the\n&gt; perfect pathway to complexity because the task may be defined in such\n&gt; a way that it might as well be necessary to solve some gigantic\n&gt; problem to become good.  For example, competitive coevolution on Go\n&gt; may not really end up rewarding individuals for finding really basic\n&gt; regularities that are necessary to eventually evolving a good Go\n&gt; player.\n\nThis is a good place to reiterate my claim from above: would humans be any\nbetter at providing the right pathway to complexity for Go? I think you and\nI agree that the hard part is knowing what cookie crumb trail to leave the\npopulations...but I don&#39;t know that IEC is better than co-evolution or\n(well-done) TBE at rewarding good intermediate steps. Maybe a good Go\nteacher could do a good job because it knows the correct path to\ncomplexity...but that is simply because they have learned how to teach\n(reward) Go players...so using them seems to be cheating a bit. Ironically,\nit is because they know the long term goal, and how to get there, that they\ncan help players take longer routes through many valleys to higher peaks\ninstead of rushing up the closest peak. So, here, it seems like long-term\ntargets might actually be one of the reasons IEC is better! Except in humans\nit is a knowledge of long term goals *plus* a decent idea of the path to get\nthere. For example, if an engineer was able to interactively evolve Karl\nSims creature it could, with the right representations, make something like\na ferrari....but the whole point of evolutionary computation to figure out\nhow nature did it without long-term goals. No? As such, it seems less\nnatural to me. \n\nAs for why things complexified on Earth and they don&#39;t in EC...my leading\ntheory (theories?) is that the Earth is just more massive (which leads to\nmore parallel processing), spatially structured (which allows more\ndiversity), co-evolving, has been running for a long time (if you chop off\nthe last 20% of the run you don&#39;t get most higher-order life), and\nfine-grained (which increases the possibilities). Much of that does not\nexist in EC yet. \n\n\n \n&gt; \n&gt; The key to natural evolution was that there were a lot of easy ways\n&gt; to do well in the beginning.  So we got a diversity of viable jumping\n&gt; off points.  That is also true on Picbreeder:  You can easily get a\n&gt; picture that&#39;s good enough to be worth showing others.  So it&#39;s got a\n&gt; very natural property: It proliferates jumping-off points too.\n&gt; \n&gt; If you like, you can think of Picbreeder as an ecology where the\n&gt; environment is just the preferences of its myriad users.  The\n&gt; environment in nature is just Earth and physics.  These are quite\n&gt; different environments, but their effect on the dynamics of selection\n&gt; form an analogy.  So at that level, it doesn&#39;t matter if a human is\n&gt; in the loop or not.  What humans like is just the environment.  And\n&gt; the nice things is, humans are very sensitive to regularity and\n&gt; organization at all levels: exactly what a good environment should\n&gt; reward if we want to build up.\n&gt; \n&gt; I don&#39;t know where Picbreeder will go because part of it depends on\n&gt; how many users we get and how much they persevere.  So it may never\n&gt; produce great works of art; I&#39;d be surprised if it did.  Yet it has\n&gt; these intriguing ingredients that we have not had before, so it is a\n&gt; much more significant experiment than just a bunch of people playing\n&gt; with an art toy.\n&gt; \n&gt; Hopefully this endless message answers the question with some extra\n&gt; food for thought to boot.  I know there are a lot of controversial\n&gt; ideas here and please forgive me for not reminding you as I went that\n&gt; many such claims were merely speculation: I realize that they are,\n&gt; but if I acknowledged that every time I speculated this near-novel\n&gt; would be twice as long!  You can be sure that I am not trying to\n&gt; present these ideas as settled facts by any means.\n\nI enjoy the conversation. Thanks for starting it. :-)\n\n&gt; \n&gt; ken\n&gt; \n&gt; --- In neat@yahoogroups.com, &quot;Derek James&quot; &lt;djames@...&gt; wrote:\n&gt;&gt; \n&gt;&gt; Ken wrote:\n&gt;&gt; \n&gt;&gt;&gt; Of course the reason it was possible is because humans are doing\n&gt; the\n&gt;&gt;&gt; evaluation- which yields another lesson: The fitness function in\n&gt; most\n&gt;&gt;&gt; evolutionary computation is a liability against getting to high-\n&gt; level\n&gt;&gt;&gt; complexity. There are deep reasons that human evaluation is\n&gt; actually\n&gt;&gt;&gt; more analogous to what happened over natural evolution than any\n&gt; other\n&gt;&gt;&gt; type of evaluation scheme we run on computers. We are often misled\n&gt;&gt;&gt; into believing that interactive evolution is less &quot;natural&quot; than\n&gt;&gt;&gt; normal EC. Actually, the opposite is true.\n&gt;&gt; \n&gt;&gt; Like Jeff, I&#39;d be interested in hearing you expand your thoughts on\n&gt; this.  I\n&gt;&gt; think the demonstration is no less impressive, but it seems to me\n&gt; that the\n&gt;&gt; distinction between natural and artificial selection is an important\n&gt;&gt; conceptual one.  Natural selection is based on the attributes of the\n&gt;&gt; environment, while artificial selection is the result of attributes\n&gt; selected\n&gt;&gt; by an agent (akin to animal breeding or horticulture).  In fact, in\n&gt; The\n&gt;&gt; Origin of Species, Darwin used many many examples of rapid\n&gt; evolutionary\n&gt;&gt; change in domesticated species such as pigeons and dogs to bolster\n&gt; his\n&gt;&gt; argument for his theory.\n&gt;&gt; \n&gt;&gt; Maybe you&#39;re taking issue with the terms &quot;natural&quot;\n&gt; and &quot;artificial&quot;, and\n&gt;&gt; maybe there are better ways to make the distinction (&quot;agent-\n&gt; directed&quot; vs.\n&gt;&gt; &quot;environment-directed&quot;, &quot;conscious&quot; vs. &quot;unconscious&quot; evolution...I\n&gt; don&#39;t\n&gt;&gt; know).  But while I don&#39;t think artificial selection is any less\n&gt; effective\n&gt;&gt; or powerful, probably moreso in some cases, I think it&#39;s useful to\n&gt; maintain\n&gt;&gt; that distinction.\n&gt;&gt; \n&gt;&gt; --Derek\n&gt;&gt; \n&gt; \n&gt; \n\n\n\n"}}