{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[{"name":"READ"}]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"userId":197999825,"authorName":"John Arrowwood","from":"&quot;John Arrowwood&quot; &lt;jarrowwx@...&gt;","profile":"jarrowwx","replyTo":"LIST","senderId":"eMUo2imBksck1xjMRsUraQA3LTBRkW0sYWyxvKCEuBfGYg6PcIQj4eGyr7MfbLiK9yzWpv7UDEQOmIbAKDvIWCrxsu_WHKSTvBNSww","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [neat] Re: Picbreeder comments","postDate":"1191284543","msgId":3571,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDUxN2ZhNmYxMDcxMDAxMTcyMmw3YWM5YTc1MWo1OWI2Y2NiNmZmNTYzZGFhQG1haWwuZ21haWwuY29tPg==","inReplyToHeader":"PGZkam9rcitpbGdoQGVHcm91cHMuY29tPg==","referencesHeader":"PDUxN2ZhNmYxMDcwOTI4MTA0M2o3YjY3YTRjMWhiZTkyZmQxNjJmYjEzNTQ4QG1haWwuZ21haWwuY29tPgkgPGZkam9rcitpbGdoQGVHcm91cHMuY29tPg=="},"prevInTopic":3569,"nextInTopic":0,"prevInTime":3570,"nextInTime":3572,"topicId":3544,"numMessagesInTopic":17,"msgSnippet":"... This is somewhat of a mechanistic model.  The wave in question is the flowing neurochemical signal that travels through a biological neural network. ","rawEmail":"Return-Path: &lt;jarrowwx@...&gt;\r\nX-Sender: jarrowwx@...\r\nX-Apparently-To: neat@yahoogroups.com\r\nReceived: (qmail 63518 invoked from network); 2 Oct 2007 00:22:24 -0000\r\nReceived: from unknown (69.147.108.201)\n  by m49.grp.scd.yahoo.com with QMQP; 2 Oct 2007 00:22:24 -0000\r\nReceived: from unknown (HELO fk-out-0910.google.com) (209.85.128.185)\n  by mta2.grp.re1.yahoo.com with SMTP; 2 Oct 2007 00:22:24 -0000\r\nReceived: by fk-out-0910.google.com with SMTP id 18so4047355fks\n        for &lt;neat@yahoogroups.com&gt;; Mon, 01 Oct 2007 17:22:23 -0700 (PDT)\r\nReceived: by 10.82.174.20 with SMTP id w20mr17124235bue.1191284543213;\n        Mon, 01 Oct 2007 17:22:23 -0700 (PDT)\r\nReceived: by 10.82.114.15 with HTTP; Mon, 1 Oct 2007 17:22:23 -0700 (PDT)\r\nMessage-ID: &lt;517fa6f10710011722l7ac9a751j59b6ccb6ff563daa@...&gt;\r\nDate: Mon, 1 Oct 2007 17:22:23 -0700\r\nTo: neat@yahoogroups.com\r\nIn-Reply-To: &lt;fdjokr+ilgh@...&gt;\r\nMIME-Version: 1.0\r\nContent-Type: text/plain; charset=ISO-8859-1\r\nContent-Transfer-Encoding: 7bit\r\nContent-Disposition: inline\r\nReferences: &lt;517fa6f10709281043j7b67a4c1hbe92fd162fb13548@...&gt;\n\t &lt;fdjokr+ilgh@...&gt;\r\nX-Google-Sender-Auth: 17827aa99669372f\r\nX-eGroups-Msg-Info: 1:12:0:0:0\r\nX-eGroups-From: &quot;John Arrowwood&quot; &lt;John@...&gt;\r\nFrom: &quot;John Arrowwood&quot; &lt;jarrowwx@...&gt;\r\nSubject: Re: [neat] Re: Picbreeder comments\r\nX-Yahoo-Group-Post: member; u=197999825; y=ORM7ymNwLIgJTFACLm8Niy3HxTMZdMz5xCwUfnoeibH3r9I\r\nX-Yahoo-Profile: jarrowwx\r\n\r\nOn 9/28/07, Kenneth Stanley &lt;kstanley@...&gt; wrote:\n&gt; John, how instrumental in your view of emotion is the idea that it is\n&gt;  a &quot;wave&quot; as opposed to some other conduit of information?  What is\n&gt;  about waves and wave functions that makes you feel they are the right\n&gt;  level of abstraction for emotion?\n\nThis is somewhat of a mechanistic model.  The &#39;wave&#39; in question is\nthe &#39;flowing neurochemical signal&#39; that travels through a biological\nneural network.\n\nKnowing that the &#39;wave&#39; is implemented via neurochemicals which take\ntime to be taken back into the cells once they fire, it is easy to see\nhow these &#39;waves&#39; would exhibit some of the same behaviors of our\nclassic &#39;waves&#39;, such as additivity.  When two classic waves enter\ninto the same space, they bend their medium in such a way as to either\naugment or cancel out.  In the brain, when two signals arrive at the\nsame location in near time, the signal from the first has not yet\nfinished being taken up, so the second signal adds to what is left of\nthe first, potentially triggering that neuron to fire when the first\nsignal alone could not.  Thus, they are additive.\n\nMusic is something we do because we like it.  Every human emotion can\nbe triggered through music.  Music theory tells us that we will find\ntwo notes &#39;pleasant&#39; if their frequencies are a fraction of two\nrelatively small integers apart from one another (I may not have\nworded that exactly correct, but try to extract the intent. :)  This\nis best understood by graphing sine waves.  The sound wave goes from\nhigh density to low density in a cyclic pattern, a frequency, like a\nsine wave.  If you add another sine wave, much like mixing multiple\nsounds together, then the one either adds to or cancels out the other\nat any given moment.  The characteristics of the resultant wave\ndetermines whether or not it will be deemed &#39;consonant&#39; or\n&#39;dissonant,&#39; &#39;pleasant&#39; or &#39;unpleasant.&#39;  Which it will be is well\nunderstood.\n\nIn the brain, any regularly occurring sensation will set up a\n&#39;frequency following response&#39; (you can google it) which is in essence\na &#39;standing wave&#39; in the brain whose characteristic frequency matches\nthe frequency of the original sensation. This means that if you hear\none frequency in one ear (e.g. 440 hz), and another similar frequency\n(e.g. 450 hz) in the other ear, then you will have two standing waves\nin your brain.  The one will interact with the other in a 10 hz cycle,\ngoing from &#39;reinforcing&#39; to &#39;canceling out&#39; at a rate of 10 times a\nsecond.  The individual will perceive this as a &#39;beat frequency&#39;\n(google: &quot;binaural beat&quot; and &quot;brainwave entrainment&quot;).  The signals\ninteract in the brain EXACTLY like they interact in your mathematical\nmodel of adding sine waves together.  There are significant\nimplications to this fact.\n\nAdd to this an interesting concept:  Synesthesia.  Normally, one part\nof the brain is dedicated to processing one type of signal, and\ndifferent regions don&#39;t typically interact except in well defined\nways.  However, sometimes, when the amount of real-estate that has\nbeen coopted into participating in the processing of the signals\nbrings the one processing region into close proximity to another\nregion, then signals may bleed from the one to the other.  This would\nbe experienced as a &#39;mixing up&#39; of senses, such that you can hear a\ncolor, or see a shape when you hear a sound.  People who take certain\nsubstances into their bloodstream experience this as a side-effect\n(trippy!) while others naturally experience it as part of their\nevery-day experience.  But everyone is capable of experiencing it if\nthey allow themselves to &#39;fully experience&#39; their senses.\n\nThe point is that the signals from one part of the brain are not\nincompatible with other parts of the brain.  The &#39;language of\ncomputation&#39; of the brain is the same for the whole brain, not just\nthe audio-processing center.  Thus, the rules for music are the same\nas the rules for &#39;shape&#39; or &#39;color&#39; or &#39;scent&#39; or &#39;texture.&#39;  The\nprinciples that determine our emotional response to music are the same\nrules that could be used to predict our emotional response to ANY\nstimuli, if we can understand how the stimuli gets translated into\ninternal &#39;waves&#39; of information within the brain.\n\nI propose that the translation mechanism is designed or evolved so as\nto maximize &#39;compatibility&#39; between the various senses, so that one\ncan use the signals from one and mix them with the others in order to\nfind correlation and learn from them.  Likewise, I propose that memory\nis the re-creation of old wave patterns, and that our experience of\nemotions (vs. pleasure/pain) is founded on the same exact principle,\njust applied to the &#39;memory&#39; wave as it interacts with the\n&#39;perception&#39; waves (at whatever level of abstraction is appropriate).\n\nAs a test, take a long hard look at the things that make you happy vs.\nthe things that make you sad.  You will find that the things which\nmake you unhappy are things where your belief about how they SHOULD be\ndoes not line up with how you perceive things to be.  But like music,\nthere is a degree of &#39;difference&#39; beyond which the two don&#39;t seem to\ninteract.  If they are too different, reality doesn&#39;t &#39;effect&#39; you.\nThere is another region wherein they become &#39;dissonant&#39; or\n&#39;discordant&#39; and therefore unpleasant, and yet another &#39;consonant&#39; or\n&#39;resonant&#39; region which is generally experienced as joyous.  The more\nof your beliefs that are &#39;confirmed&#39; by or resonant to your\nperception, the larger the magnitude of the experience of joy.  The\ncloser to resonant it is while still being off, the more dissonant it\nis.\n\nThis theory completely explains why Saturday-morning cartoons are just\nas &#39;believable&#39; as live-action films, but a C.G. that is too close to\nreal but is off triggers a rejection, a negative response.  It is in\nthat &#39;dissonant&#39; area, where the &#39;waves&#39; in the brain triggered by the\nsensation are setting up too many expectations which the signals are\nnot meeting.  It explains the difference between a good actor and a\nbad one, because the good one more fully meets our expectations.  It\nexplains our appreciation of beauty, because the mathematical\ncharacteristics of the wave form that forms in our minds from our\nsensations has some kind of positive (predictable) relationship with\nour expectation, which is itself based on past experiences as a kind\nof Bayesian &#39;average&#39;.\n\nWhich is why I believe that it is possible to build a neural network\nthat could learn to recognize the characteristics of &#39;good&#39; images.\nBecause ultimately, it&#39;s all math.\n\nDoes that make sense?\n\n&gt;  Also, I wasn&#39;t sure, by &quot;wave function&quot; are you referring to quantum\n&gt;  mechanics? Or I could be misunderstanding.\n\nNo, I&#39;m referring to waves and how they function.  Key elements are\nthe fact that a wave is technically a &#39;construct&#39; or &#39;configuration&#39;\nof a medium, which &#39;travels&#39; through the medium.  I&#39;m talking about\nthe &#39;functionality&#39; of &#39;waves&#39; and the way that mathematical\n&#39;functions&#39; can describe them.\n\n-- \nJohn Arrowwood\nJohn (at) Hanlons Razor (dot) com\nJohn (at) Arrowwood Photography (dot) com\n--\nhttp://arrowwood.blogspot.com\n\n"}}