{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[{"name":"READ"}]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"userId":54567749,"authorName":"Kenneth Stanley","from":"&quot;Kenneth Stanley&quot; &lt;kstanley@...&gt;","profile":"kenstanley01","replyTo":"LIST","senderId":"rjyIbt4mcW_ee3npU0nyF98KaZ5Ww9AzrhjmlmMPAj7L-XBdPrO-F8BBUu_-KBKUrP99BwRerTs5LxbnYu8yry6S3jy5UUqSXK5u5-nKxjY7","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: Random Complexification","postDate":"1077087657","msgId":392,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGMwdjJqOStoNzF0QGVHcm91cHMuY29tPg==","inReplyToHeader":"PDIwMDQwMjE3MjIxMTIyLjgxNjExLnFtYWlsQHdlYjYwNTA0Lm1haWwueWFob28uY29tPg=="},"prevInTopic":390,"nextInTopic":395,"prevInTime":391,"nextInTime":393,"topicId":371,"numMessagesInTopic":22,"msgSnippet":"Derek, good question and I definitely understand where you re coming from. The key point that is perhaps not clear is that the lines in the middle are *not*","rawEmail":"Return-Path: &lt;kstanley@...&gt;\r\nX-Sender: kstanley@...\r\nX-Apparently-To: neat@yahoogroups.com\r\nReceived: (qmail 96755 invoked from network); 18 Feb 2004 07:00:57 -0000\r\nReceived: from unknown (66.218.66.167)\n  by m8.grp.scd.yahoo.com with QMQP; 18 Feb 2004 07:00:57 -0000\r\nReceived: from unknown (HELO n40.grp.scd.yahoo.com) (66.218.66.108)\n  by mta6.grp.scd.yahoo.com with SMTP; 18 Feb 2004 07:00:57 -0000\r\nReceived: from [66.218.67.141] by n40.grp.scd.yahoo.com with NNFMP; 18 Feb 2004 07:00:57 -0000\r\nDate: Wed, 18 Feb 2004 07:00:57 -0000\r\nTo: neat@yahoogroups.com\r\nMessage-ID: &lt;c0v2j9+h71t@...&gt;\r\nIn-Reply-To: &lt;20040217221122.81611.qmail@...&gt;\r\nUser-Agent: eGroups-EW/0.82\r\nMIME-Version: 1.0\r\nContent-Type: text/plain; charset=ISO-8859-1\r\nContent-Length: 6447\r\nX-Mailer: Yahoo Groups Message Poster\r\nX-eGroups-Remote-IP: 66.218.66.108\r\nFrom: &quot;Kenneth Stanley&quot; &lt;kstanley@...&gt;\r\nSubject: Re: Random Complexification\r\nX-Yahoo-Group-Post: member; u=54567749\r\nX-Yahoo-Profile: kenstanley01\r\n\r\nDerek, good question and I definitely understand where you&#39;re\ncoming from.  \n\nThe key point that is perhaps not clear is that the lines\nin the middle are *not* graphs of average complexity, but \nrather of *dominant&#39;s complexity*.  In other words, they\nshow the complexity of strictly superior strategies.  \nThe point is, yes of course, those runs as well may have a\nbroad range of complexity, but the question is, is there\nreason to believe that the *new high levels of dominance*\nshould by necessity be more complex?\n\nThe random run lines clearly indicate the answer is no, \nbecause the population maintains a broad range of complexity\nwhen there is no correlation between complexity and fitness.\n\nYou see the key underlying issue is that IF complexity did\nNOT correlate to superiority in the robot duel, then it is\n*possible* in NEAT for the complexity of the highest dominant\nsolutions NOT to go up.  And the reason it is possible is\nbecause, as the random run lines show, NEAT keeps simple \nsolutions around as long as they are competitive.  \n\nI think maybe there is some confusion about what is being \nclaimed; the claim is not that average complexity in NEAT\nruns does not go up.  Rather, the claim is that increasing\nsophistication is a result of increasing complexity, and\nfurther that the reason increasing complexity pairs with\nincreasing sophistication is NOT because of some nuance of\nNEAT; it is because it is fundamentally advantageous to have \nmore structure in this domain.\n\nSo in other words, in a stagnating population, of course\naverage complexity goes up- but that makes sense- when you\nare stagnating, you want to open up more options.  But\nwhat about when you are NOT stagnating- that&#39;s what&#39;s \ninteresting- in that case, adding structure opens the door\nto more and more sophisticated behavior.\n\nI don&#39;t think anyone who uses NEAT really finds that \ncontroversial; after all, that&#39;s the whole reason we\nare using NEAT isn&#39;t it?  ...because we want to be able\nto find more and more complex solutions, because we \nbelieve that will lead to more and more interesting \nbehavior.  So that&#39;s all this result is meant to \nestablish- that indeed, increasing complexity does\nlead to increasing dominance.\n\n--- In neat@yahoogroups.com, Derek James &lt;blue5432@y...&gt; wrote:\n&gt; I was reading Ken&#39;s updated paper on Competitive\n&gt; Coevolution through Evolutionary Complexification, and\n&gt; I came across the Evolution of Complexity section\n&gt; (6.1):\n&gt; \n&gt;\nhttp://www-2.cs.cmu.edu/afs/cs/project/jair/pub/vo\nlume21/stanley04a-html/node6.html#SECTION00063000000000000000\n&gt; \n&gt; It bears on a previous discussion we&#39;ve had here on\n&gt; the list, and I&#39;d like to point out a couple of\n&gt; observations and ask a couple of questions.\n&gt; \n&gt; In this section, Ken asks: &quot;An important question is:\n&gt; Because NEAT searches by adding structure only, not by\n&gt; removing it, does the complexity always increase\n&gt; whether it helps in finding good solutions or not?&quot;\n&gt; \n&gt; Good question, but I&#39;m not sure I agree that the data\n&gt; presented answers the question one way or the other.\n&gt; \n&gt; Figure 5 shows two graphs.  The first plots the\n&gt; average number of connections among generational\n&gt; champions from 13 runs.  This is compared to the\n&gt; complexity of 5 runs in which fitness was assigned\n&gt; randomly, with the same evolutionary parameters.  But\n&gt; instead of showing the average number of connections\n&gt; among the population, the averages of the smallest and\n&gt; largest members of each generation are shown.\n&gt; \n&gt; Why? Why not show the average complexity of the random\n&gt; population as a whole, instead of the range?  Just\n&gt; eyeballing it, it looks like such an average would\n&gt; result in a plot of complexity reasonably close to the\n&gt; plot for the average fittest individual complexity (of\n&gt; course, since we&#39;re only shown the max and min,\n&gt; there&#39;s no way of knowing whether most members of the\n&gt; random-fitness population tended toward one extreme or\n&gt; the other).\n&gt; \n&gt; It seems as if the paper is suggesting that in the\n&gt; random-fitness population, because some members of the\n&gt; population complexified greatly, while others did not\n&gt; complexify much at all, that this demonstrates that\n&gt; complexification correlates with increased fitness. \n&gt; But that doesn&#39;t look like a conclusion that you can\n&gt; draw, at least from what&#39;s presented here.\n&gt; \n&gt; It would seem more appropriate to compare the min and\n&gt; max complexities of members of the regular and the\n&gt; random-fitness runs.  Is the range of complexity in a\n&gt; fitness-based run similar to the range in a\n&gt; random-fitness run?  \n&gt; \n&gt; Or, as I&#39;ve suggested above, compare the average\n&gt; complexity of the fittest member in the regular runs\n&gt; to the average complexity of the entire population of\n&gt; random-fitness runs.  As it stands, it seems like a\n&gt; comparison of apples and oranges.\n&gt; \n&gt; Intuitively, it seems to me that the phenomenon of\n&gt; maintaining such a range of complexity in a\n&gt; random-fitness population has to do with NEAT&#39;s\n&gt; handling of speciated mating.  Less complex\n&gt; individuals are going to only mate with one another,\n&gt; while individuals that are a result of mutated\n&gt; complexity are likewise going to only mate with one\n&gt; another.  There is no selection pressure to drive\n&gt; simple species to extinction, correct?  So they&#39;ll\n&gt; hang around.  But since NEAT is incrementally adding\n&gt; features, later generations will tend to include more\n&gt; and more complex individuals, even when their fitness\n&gt; is not being evaluated.  So the average complexity of\n&gt; the population is going to tend to increase over time,\n&gt; isn&#39;t it?\n&gt; \n&gt; The paper says: &quot;These bounds show that the increase\n&gt; in complexity is not inevitable; both very simple and\n&gt; very complex species exist in the population\n&gt; throughout the run.&quot;\n&gt; \n&gt; What &quot;increase in complexity&quot; is the paper referring\n&gt; to?  There is most definitely an increase in\n&gt; complexity in the most complex member of each\n&gt; generation, and there seems to be an increase in the\n&gt; average complexity of the population.  All this data\n&gt; shows is that some less complex members of the\n&gt; population are retained throughout a random-fitness\n&gt; run, that not every member of every species\n&gt; complexifies.  And again, I just don&#39;t see how this\n&gt; demonstrates a correlation between fitness and\n&gt; complexification.\n&gt; \n&gt; Derek\n&gt; \n&gt; \n&gt; __________________________________\n&gt; Do you Yahoo!?\n&gt; Yahoo! Finance: Get your refund fast by filing online.\n&gt; http://taxes.yahoo.com/filing.html\n\n\n"}}