{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[{"name":"READ"}]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"userId":183620858,"authorName":"Derek James","from":"&quot;Derek James&quot; &lt;djames@...&gt;","profile":"blue5432","replyTo":"LIST","senderId":"fyqulg97omIl1ysCMZniAdYagk2RE1wrrzZIhifFG_pPQtihxvP92CZRErFbkQDW0LhKXuWSxupHYiZ344O9k8U2cEy8qRI","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [neat] Re: Benchmarks for Artificial Embryogeny Systems","postDate":"1217949979","msgId":4252,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDE5YjEwZDUxMDgwODA1MDgyNnRlNjFlY2VhdjNjZTMwMzEwNTFiNjY0ZTZAbWFpbC5nbWFpbC5jb20+","inReplyToHeader":"PGc3OWE4YSs3Z25yQGVHcm91cHMuY29tPg==","referencesHeader":"PGc3OTIwZytkNjY0QGVHcm91cHMuY29tPiA8Zzc5YThhKzdnbnJAZUdyb3Vwcy5jb20+"},"prevInTopic":4251,"nextInTopic":4272,"prevInTime":4251,"nextInTime":4253,"topicId":4244,"numMessagesInTopic":20,"msgSnippet":"... But isn t that the general case of getting stuck in a particular part of the solution space? If a particular candidate repeatedly fails to represent very","rawEmail":"Return-Path: &lt;djames@...&gt;\r\nX-Sender: djames@...\r\nX-Apparently-To: neat@yahoogroups.com\r\nX-Received: (qmail 57772 invoked from network); 5 Aug 2008 15:26:19 -0000\r\nX-Received: from unknown (66.218.67.97)\n  by m43.grp.scd.yahoo.com with QMQP; 5 Aug 2008 15:26:19 -0000\r\nX-Received: from unknown (HELO wf-out-1314.google.com) (209.85.200.169)\n  by mta18.grp.scd.yahoo.com with SMTP; 5 Aug 2008 15:26:19 -0000\r\nX-Received: by wf-out-1314.google.com with SMTP id 26so2551225wfd.32\n        for &lt;neat@yahoogroups.com&gt;; Tue, 05 Aug 2008 08:26:19 -0700 (PDT)\r\nX-Received: by 10.142.188.4 with SMTP id l4mr5507473wff.183.1217949979457;\n        Tue, 05 Aug 2008 08:26:19 -0700 (PDT)\r\nX-Received: by 10.142.77.4 with HTTP; Tue, 5 Aug 2008 08:26:19 -0700 (PDT)\r\nMessage-ID: &lt;19b10d510808050826te61eceav3ce3031051b664e6@...&gt;\r\nDate: Tue, 5 Aug 2008 10:26:19 -0500\r\nTo: neat@yahoogroups.com\r\nIn-Reply-To: &lt;g79a8a+7gnr@...&gt;\r\nMIME-Version: 1.0\r\nContent-Type: text/plain; charset=ISO-8859-1\r\nContent-Transfer-Encoding: 7bit\r\nContent-Disposition: inline\r\nReferences: &lt;g7920g+d664@...&gt; &lt;g79a8a+7gnr@...&gt;\r\nX-eGroups-Msg-Info: 1:12:0:0:0\r\nFrom: &quot;Derek James&quot; &lt;djames@...&gt;\r\nSubject: Re: [neat] Re: Benchmarks for Artificial Embryogeny Systems\r\nX-Yahoo-Group-Post: member; u=183620858; y=5uU0BWQ6sKL3GdBE0PQbTeOZFG3XZkg4Ld60Hnf6uI4S690\r\nX-Yahoo-Profile: blue5432\r\n\r\nOn Tue, Aug 5, 2008 at 5:32 AM, Kenneth Stanley &lt;kstanley@...&gt; wrote:\n&gt; Derek, I also don&#39;t believe there has been a great deal of benchmark\n&gt; comparison sine the 2003 paper, although Alexandre Devert cites a\n&gt; few. However, usually when people attempt benchmarks they do not\n&gt; compare their results explicitly with others.\n&gt;\n&gt; At the same time, as you know, I have changed my philosophy somewhat\n&gt; since 2003 because I have realized that benchmark comparisons can\n&gt; lead to misunderstanding unless they are controlled very carefully.\n&gt; One of the problems is the &quot;target-based evolution problem,&quot; which\n&gt; is one of the inspirations for novelty search. In short, evolving\n&gt; to an arbitrary target can lead to misleading intuitions about what\n&gt; is possible with a particular encoding because of deception. Often\n&gt; a &quot;failed&quot; encoding very well could represent the target if only it\n&gt; had been led to it through an alternative path through the search\n&gt; space.\n\nBut isn&#39;t that the general case of getting stuck in a particular part\nof the solution space? If a particular candidate repeatedly fails to\nrepresent very simple target patterns, such as rings and stars, and\ncomplexifies to the point where it cannot revert back to a simpler\nmorphology, doesn&#39;t that say something about the AE system?\n\n&gt; Also, another problem with benchmarks is that they may obfuscate\n&gt; more fundamental advantages of particular approaches because they do\n&gt; not focus on general capabilities. (Although, of course, if you do\n&gt; enough of them, perhaps general capabilities start to be clearer.)\n&gt; But that is why I advocated more focus on looking for biological-\n&gt; like regularities in the patterns output by particular encodings,\n&gt; rather than looking for a single particular pattern, or even a\n&gt; single set of patterns.\n\nThen how do you compare the representational capabilities of two AE\nsystems? For that matter, how do you go about determining the\nrepresentational capabilities of a single system?\n\nIt seems like the approach you&#39;re advocating is to evolve patterns\nfrom a bunch of different starting points, with different\nmethodologies (e.g. artificial selection) and just see what shakes\nout.\n\nIf I want to use a particular system to solve a particular problem,\nand I know up front that particular types of patterns will be\nextremely useful in solving the problem (e.g. bilateral symmetry),\nwouldn&#39;t it make sense to explicitly test the system beforehand to see\nhow easily such patterns emerge and how stable they are once they do\nemerge?\n\n&gt; Like I&#39;ve said before, evolution never\n&gt; produced a wheel but that hardly means DNA is a bad encoding.\n\nThat&#39;s an interesting example. Do you think DNA has the\nrepresentational power to express a wheel, that it is\ndifficult/impossible to evolve a wheel via gradualism, and/or that\nthere hasn&#39;t been sufficient selection pressure in nature to produce a\nwheel?\n\nIt seems to me that DNA certainly has the ability to express a wheel,\nwhich is much simpler than many more complex designs that DNA does\nexpress. I&#39;d tend to think that wheels would not evolve on earth\nbecause in general they would be maladaptive...the world isn&#39;t nice\nand flat like a paved parking lot, and where it is (ice, desert),\nrolling still wouldn&#39;t be as useful as walking, slithering, gliding,\nor flying. I don&#39;t know, though...it&#39;s an interesting question.\n\nIn the environments in which Sims and others evolve &quot;walkers&quot;, they\nare flat. But the creatures are composed of cuboids (which could still\nform wheels, albeit not very easily). If the representation included\nobjects like spheres or rings and primitives, or as patterns that\neasily emerged, it would certainly be interesting to see if rolling\nbehavior evolved in favor of crawling or scooting across a flat\nsurface.\n\n&gt; Of course benchmarks can play a role and I do think more comparisons\n&gt; could be done, but we also have to be cautious about their misapplication.\n\nAs long as people aren&#39;t making strong claims about what a particular\nsystem can&#39;t do, I don&#39;t see the problem. If a study was done where,\nfor example, three AE systems were compared for their ability to\nevolve simple shapes such as stars, trees, and rings, various\nsymmetries, and simple controllers, I&#39;d see nothing wrong with someone\nstating that System A evolved solutions to certain problems more\nquickly than the other systems, but less quickly in others. Just as\nlong as they&#39;re not saying, &quot;System B failed to evolve a tree\nstructure, therefore System B is incapable of either representing or\nevolving such a structure.&quot;\n\n--Derek\n\n"}}