{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[{"name":"READ"}]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"userId":211599040,"authorName":"Jeff Clune","from":"Jeff Clune &lt;jclune@...&gt;","profile":"jeffreyclune","replyTo":"LIST","senderId":"WiA25q9rwoPuqNr99Q1EgHoztHoMz9odqT2GP4WyvEJDg129eRt07WlzhS0N6gQ5-UODRuTcWo64yj1BpvOu1bGI","spamInfo":{"isSpam":false,"reason":"4"},"subject":"Re: [neat] Re: Evolving Coordinated Quadruped Gaits with the HyperNEAT Generative Encoding","postDate":"1234682478","msgId":4555,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEM1QkQyQzlFLjI4NUE5JWpjbHVuZUBtc3UuZWR1Pg==","inReplyToHeader":"PGduN2Zkbytnc3VhQGVHcm91cHMuY29tPg=="},"prevInTopic":4554,"nextInTopic":4556,"prevInTime":4554,"nextInTime":4556,"topicId":4550,"numMessagesInTopic":42,"msgSnippet":"... Thanks. I m glad you enjoyed it. ... I have thought a lot about your biped experiment. I d be really interested in hearing your opinion, and that of anyone","rawEmail":"Return-Path: &lt;jclune@...&gt;\r\nX-Sender: jclune@...\r\nX-Apparently-To: neat@yahoogroups.com\r\nX-Received: (qmail 14182 invoked from network); 15 Feb 2009 07:21:24 -0000\r\nX-Received: from unknown (66.218.67.96)\n  by m56.grp.scd.yahoo.com with QMQP; 15 Feb 2009 07:21:24 -0000\r\nX-Received: from unknown (HELO yx-out-1718.google.com) (74.125.44.156)\n  by mta17.grp.scd.yahoo.com with SMTP; 15 Feb 2009 07:21:24 -0000\r\nX-Received: by yx-out-1718.google.com with SMTP id 6so864718yxn.38\n        for &lt;neat@yahoogroups.com&gt;; Sat, 14 Feb 2009 23:21:24 -0800 (PST)\r\nX-Received: by 10.65.116.10 with SMTP id t10mr2281389qbm.103.1234682483332;\n        Sat, 14 Feb 2009 23:21:23 -0800 (PST)\r\nReturn-Path: &lt;jclune@...&gt;\r\nX-Received: from ?10.0.1.199? (c-76-20-191-220.hsd1.mi.comcast.net [76.20.191.220])\n        by mx.google.com with ESMTPS id s12sm7598870qbs.9.2009.02.14.23.21.20\n        (version=TLSv1/SSLv3 cipher=RC4-MD5);\n        Sat, 14 Feb 2009 23:21:21 -0800 (PST)\r\nUser-Agent: Microsoft-Entourage/12.13.0.080930\r\nDate: Sun, 15 Feb 2009 02:21:18 -0500\r\nTo: &quot;neat@yahoogroups.com&quot; &lt;neat@yahoogroups.com&gt;\r\nMessage-ID: &lt;C5BD2C9E.285A9%jclune@...&gt;\r\nThread-Topic: [neat] Re: Evolving Coordinated Quadruped Gaits with the\n HyperNEAT Generative Encoding\r\nThread-Index: AcmPPf5c/IXc0hSTgk2yo1lQDyjZFw==\r\nIn-Reply-To: &lt;gn7fdo+gsua@...&gt;\r\nMime-version: 1.0\r\nContent-type: text/plain;\n\tcharset=&quot;US-ASCII&quot;\r\nContent-transfer-encoding: 7bit\r\nX-eGroups-Msg-Info: 2:4:8:0:0\r\nFrom: Jeff Clune &lt;jclune@...&gt;\r\nSubject: Re: [neat] Re: Evolving Coordinated Quadruped Gaits with the\n HyperNEAT Generative Encoding\r\nX-Yahoo-Group-Post: member; u=211599040; y=y34MAf17cH6rFzQFDYP9zaXCLA0Xu0yI5h50tX_aNVY3sSmq2Bqu\r\nX-Yahoo-Profile: jeffreyclune\r\n\r\n&gt; Very interesting paper! :)\n\nThanks. I&#39;m glad you enjoyed it.\n\n&gt; It reminds me about the experiments I made with HyperNEAT for\n&gt; controlling biped robots. Did you try using leaky-integrator based\n&gt; neurons for the substrate?\n&gt; I found them very useful for generating\n&gt; oscillation patterns. Substrates of leaky integrators with tanh()\n&gt; activation functions produce oscillations much easier than others.\n&gt; Hm.. I should really try with robots with 3 legs or more. Getting\n&gt; biped walking with HyperNEAT is perhaps too ambitious right now.\n\nI have thought a lot about your biped experiment. I&#39;d be really interested\nin hearing your opinion, and that of anyone else on this list, as to why\nyour results were so different from mine. I found that it did not take that\nmuch tuning to get HyperNEAT to evolve really good quadruped gaits. But, as\nyou note, it was much harder to evolve gaits in your biped setup.\n\nI can suggest a few hypotheses as to what explains the difference. These are\nnot mutually exclusive, and it might not be the case that any one of them\nexplains most of the difference, but instead that they add up to the\ndifference. \n\n1) Biped gaits are harder to evolve than quadruped gaits\n2) The sine wave I provided made it really easy to evolve periodic gaits.\n3) Leaky integrators hurt performance for some reason\n4) I used a PID-based setup, where the target angle was the output of the\nneural net (and not the force to be applied)\n\nThere are other differences of course, such as the inputs and the number of\nhidden nodes. \n\nI&#39;ll make a few comments on each hypothesis.\n\n1) Biped gaits are harder to evolve than quadruped gaits.\n\nThis would be easy to test by simply trying a biped with my setup.\nUnfortunately, I have some other obligations that will prevent me from\ntesting this anytime soon, but if you (or anyone else) would like to give it\na try, that would be cool. I can send you the code I used. One would just\nneed to change the quadruped into a biped. Alternately, you could try to\nmimic my setup in your &quot;Ultimate NEAT&quot; ;-).\n\nI do have access to a huge computing cluster. So, if someone makes the code\nmodifications to my setup (which I know compiles on our cluster) and sends\nthem to me, I can do a batch of runs.\n\n2) The sine wave I provided made it really easy to evolve periodic gaits\n\nThis would be an easy test. You could just plug a sine as an input into your\nbiped. Note: I found that the period of the sine wave made a huge\ndifference. If I made it too fast or too slow, evolution basically ignored\nthe signal. Within the range of periods that worked, I found that I got\ndifferent types of gaits with different period speeds. With slower periods,\nI observed cool tortoise-like gaits with left-right symmetry. With medium\nperiods, I got the gaits in the paper. With faster periods, I saw slightly\nmore frantic versions of the gaits in the paper.\n\nAs a side note, I tried to evolve the period for a short while and it was a\nmiserable failure. I&#39;d like to try that again, and would be interested to\nhear people&#39;s thoughts as to why it failed. Maybe I&#39;ll describe that attempt\nin another email. If someone out there is curious, let me know and I&#39;ll send\nit out sooner rather than later.\n\n3) Leaky integrators hurt performance for some reason.\n\nI did not try leaky integrators. Did you ever try your setup without them?\n\nI did not try them because the default sigmoid neurons worked so well out of\nthe box that I did not experiment with alternatives. Both Ken (during\npreliminary conversations about the paper) and one of the papers&#39; reviewers\nasked about leaky integrators, so there is clearly some interest out there\nin seeing how leaky integrators would compare to the neurons\nwe used in the paper.\n\nDo most of you feel leaky integrators would perform better? Why? I have\nnever worked with them, nor do I know that much about them, so I don&#39;t have\ngreat instincts on this front. Is it possible that they could have made\nthings worse in Petar&#39;s setup?\n\nIt would be cool to test them out in my setup. Again, I won&#39;t be able to get\nto this in the near future so if someone out there wants to swap them in and\ngive it a go, that would be interesting.\n\n4) I used a PID-based setup, where the target angle was the output of the\nneural net (and not the force to be applied).\n\nI could not figure out whether your setup did this as well. What were the\noutputs in your system?\n---------\n\nDo you think any/all of these hypotheses explain the difference in results?\nWhat other likely hypothesis am I missing (I am sure there are lots).\n\nThanks again for checking out the paper,\nJeff\n\nPS. Tripods would be fun. I also think adding feet and a flexible torso\nwould be interesting.\n\n\n\n&gt; \n&gt; Peter\n&gt; \n&gt; --- In neat@yahoogroups.com, Jeff Clune &lt;jclune@...&gt; wrote:\n&gt;&gt; \n&gt;&gt; Hello all-\n&gt;&gt; \n&gt;&gt; Ever since I first understood HyperNEAT I have wanted to see how it\n&gt; would\n&gt;&gt; perform at controlling legged robots.\n&gt;&gt; \n&gt;&gt; A paper I wrote on that subject was just accepted, so I can share it\n&gt; with\n&gt;&gt; you now. \n&gt;&gt; \n&gt;&gt; A copy of the paper, and videos of the simulated robots, can be\n&gt; obtained\n&gt;&gt; here:\n&gt;&gt; \n&gt;&gt; \n&gt; http://devolab.msu.edu/SupportDocs/EvolvingCoordinatedGaitsWithHyperNE\n&gt; AT\n&gt;&gt; \n&gt;&gt; \n&gt;&gt; I hope you find it interesting. Please let me know what you think,\n&gt; or if you\n&gt;&gt; have any questions.\n&gt;&gt; \n&gt;&gt; \n&gt;&gt; Here is the cite and abstract:\n&gt;&gt; \n&gt;&gt; Clune, J., Beckmann, B. E., Ofria, C., & Pennock, R. T.\n&gt;&gt; Evolving coordinated gaits with the HyperNEAT generative encoding.\n&gt;&gt; \n&gt;&gt; Proceedings of the IEEE Congress on Evolutionary Computing Special\n&gt; Section\n&gt;&gt; on Evolutionary Robotics, 2009. Trondheim, Norway. To appear.\n&gt;&gt; \n&gt;&gt; Legged robots show promise for complex mobility tasks, such as\n&gt; navigating\n&gt;&gt; rough terrain, but the design of their control software is both\n&gt; challenging\n&gt;&gt; and laborious. Traditional evolutionary algorithms can produce these\n&gt;&gt; controllers, but require manual decomposition or other problem\n&gt;&gt; simplification because conventionally-used direct encodings have\n&gt; trouble\n&gt;&gt; taking advantage of a problem&#39;s regularities and symmetries. Such\n&gt; active\n&gt;&gt; intervention is time consuming, limits the range of potential\n&gt; solutions, and\n&gt;&gt; requires the user to possess a deep understanding of the problem&#39;s\n&gt;&gt; structure. This paper demonstrates that HyperNEAT, a new and\n&gt; promising\n&gt;&gt; generative encoding for evolving neural networks, can evolve\n&gt; quadruped gaits\n&gt;&gt; without manually decomposing the problem. Analyses suggest that\n&gt; HyperNEAT is\n&gt;&gt; successful because it employs a generative encoding that can more\n&gt; easily\n&gt;&gt; reuse phenotypic modules. It is also one of the first\n&gt; neuroevolutionary\n&gt;&gt; algorithms that exploits a problem&#39;s geometric symmetries, which may\n&gt; aid its\n&gt;&gt; performance. We compare HyperNEAT to FT-NEAT, a direct encoding\n&gt; control, and\n&gt;&gt; find that HyperNEAT is able to evolve impressive quadruped gaits and\n&gt; vastly\n&gt;&gt; outperforms FT-NEAT. Comparative analyses reveal that HyperNEAT\n&gt; individuals\n&gt;&gt; are more holistically affected by genetic operators, resulting in\n&gt; better\n&gt;&gt; coordination of the quadruped&#39;s legs. Overall, the results suggest\n&gt; that\n&gt;&gt; HyperNEAT is a powerful algorithm for evolving control systems for\n&gt; complex,\n&gt;&gt; yet regular, devices, such as robots.\n&gt;&gt; \n&gt;&gt;  \n&gt;&gt; \n&gt;&gt; \n&gt;&gt; \n&gt;&gt; \n&gt;&gt; Cheers,\n&gt;&gt; Jeff Clune\n&gt;&gt; \n&gt;&gt; Digital Evolution Lab, Michigan State University\n&gt;&gt; \n&gt;&gt; jclune@...\n&gt;&gt; \n&gt; \n&gt; \n&gt; \n\n\n\n"}}