{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[{"name":"READ"}]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"userId":211599040,"authorName":"Jeff Clune","from":"Jeff Clune &lt;jclune@...&gt;","profile":"jeffreyclune","replyTo":"LIST","senderId":"riBbIFWzVbIodcxAx8EQWYc5_tqlTL_I6II_IOzxalTDeB7kLg7ft3rPznOAAnE8BSYHp_Wj7hkV1GWO5mcd7AoC","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [neat] Re: Evolving Coordinated Quadruped Gaits with the HyperNEAT Generative Encoding","postDate":"1236154107","msgId":4596,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEM1RDNBMTJCLjI4RDFFJWpjbHVuZUBtc3UuZWR1Pg==","inReplyToHeader":"PDg3M2Fkdm85emcud2wldmt2QGNzLnV0ZXhhcy5lZHU+"},"prevInTopic":4595,"nextInTopic":4597,"prevInTime":4595,"nextInTime":4597,"topicId":4550,"numMessagesInTopic":42,"msgSnippet":"Hello Vinod- Thank you for your answer. I am still a little confused about something you said, and I hope you don t mind if I try to clarify things. Basically,","rawEmail":"Return-Path: &lt;jclune@...&gt;\r\nX-Sender: jclune@...\r\nX-Apparently-To: neat@yahoogroups.com\r\nX-Received: (qmail 34180 invoked from network); 4 Mar 2009 08:08:35 -0000\r\nX-Received: from unknown (66.218.67.97)\n  by m2.grp.re1.yahoo.com with QMQP; 4 Mar 2009 08:08:35 -0000\r\nX-Received: from unknown (HELO wf-out-1314.google.com) (209.85.200.174)\n  by mta18.grp.scd.yahoo.com with SMTP; 4 Mar 2009 08:08:35 -0000\r\nX-Received: by wf-out-1314.google.com with SMTP id 25so3559275wfc.21\n        for &lt;neat@yahoogroups.com&gt;; Wed, 04 Mar 2009 00:08:35 -0800 (PST)\r\nX-Received: by 10.142.158.3 with SMTP id g3mr4072231wfe.265.1236154114973;\n        Wed, 04 Mar 2009 00:08:34 -0800 (PST)\r\nReturn-Path: &lt;jclune@...&gt;\r\nX-Received: from ?10.0.1.199? (c-76-20-191-220.hsd1.mi.comcast.net [76.20.191.220])\n        by mx.google.com with ESMTPS id 22sm4948594wfd.26.2009.03.04.00.08.32\n        (version=TLSv1/SSLv3 cipher=RC4-MD5);\n        Wed, 04 Mar 2009 00:08:33 -0800 (PST)\r\nUser-Agent: Microsoft-Entourage/12.13.0.080930\r\nDate: Wed, 04 Mar 2009 03:08:27 -0500\r\nTo: &quot;neat@yahoogroups.com&quot; &lt;neat@yahoogroups.com&gt;\r\nMessage-ID: &lt;C5D3A12B.28D1E%jclune@...&gt;\r\nThread-Topic: [neat] Re: Evolving Coordinated Quadruped Gaits with the\n HyperNEAT Generative Encoding\r\nThread-Index: AcmcoGWZxCwovUZkvU++H0qqc+KwOA==\r\nIn-Reply-To: &lt;873advo9zg.wl%vkv@...&gt;\r\nMime-version: 1.0\r\nContent-type: text/plain;\n\tcharset=&quot;US-ASCII&quot;\r\nContent-transfer-encoding: 7bit\r\nX-eGroups-Msg-Info: 1:12:0:0:0\r\nFrom: Jeff Clune &lt;jclune@...&gt;\r\nSubject: Re: [neat] Re: Evolving Coordinated Quadruped Gaits with the\n HyperNEAT Generative Encoding\r\nX-Yahoo-Group-Post: member; u=211599040; y=GoAVjB6MZ13azT3vfC2mvbMgLxcOvYOJpGzNWnt-apZe-C0mfq_7\r\nX-Yahoo-Profile: jeffreyclune\r\n\r\nHello Vinod-\n\nThank you for your answer. I am still a little confused about something you\nsaid, and I hope you don&#39;t mind if I try to clarify things.\n\nBasically, I am trying to figure out whether it would be appropriate to also\nsay that my system has &quot;coupled non-linear cells.&quot;\n\nI am pretty sure my system has &#39;coupled&#39; legs, because the state of each\njoint can be dependent on the state of any of the other joints. As you said,\nthe sigmoid activation function makes my system &#39;non-linear&#39;. You mentioned\nthat the legs (or joints) can be called &#39;cells&#39; even if they do not\noscillate. Incidentally, I actually get coordinated oscillations in the legs\neven without the sine wave (the sine wave just makes it easier for them).\n\nSo, it seems I even have &quot;oscillating, coupled, non-linear cells.&quot; Do I have\nthat right?\n\nHowever, I got the impression from your earlier posts that my current system\nwould not correctly be described as &quot;coupled non-linear cells,&quot; but that\nsuch a description would become appropriate iff I switched from outputting\ndesired angles to outputting angular velocities.\n\nThe following comments of yours in particular led me to that view:\n\nre: what changes are necessary to change my system to become a coupled cell\nsystem?*\n\n&quot;I also mentioned changing the outputs from desired angles to desired\nangular velocities, and that is actually the crucial change necessary\nto represent a coupled cell system. ... this change would allow the\nsubstrate to represent a coupled cell system, and therefore generate gaits.&quot;\n\n&quot;If you set up [your] substrate as I suggested so that it represents a\ncoupled cell system, then HyperNEAT may also be able to produce those\nother gaits.&quot;\n\n\nBut the response to Ken&#39;s question below suggests that the difference\nbetween the two is practical instead of theoretical. One simply worked\nbetter for you. That&#39;s very cool to know, and I am interested to see if I\nwill see the same result, but I am also interested in knowing whether the\nswitch from desired angles to angular velocities somehow changes the\ntheoretical properties of my system, and what we can theoretically predict\nabout it and the types of gaits it may produce.\n\nI don&#39;t really mind whether or not my system is a coupled, non-linear cell\nsystem. I am just trying to fully understand the correct terminology and its\nconsequent implications.\n\nIf my system does have &quot;coupled, non-linear cells,&quot; then am I right in\nsaying that the only reason we cannot a priori have expectations about what\ntypes of gaits may or may not evolve in my system is because I have not\nconstrained some of the cell modules and couplings to be identical?\n\n\nI hope it&#39;s not too much of a bother that I really want to understand this\nfully. I appreciate any thoughts you might have.\n\n\n* I actually used the phrase &#39;non-linear oscillators&#39; in the question I\nquote you as answering. I changed the wording for flow and clarity. I hope I\nhave not accidentally glossed over an important distinction which explains\nmy confusion. \n\nCheers,\nJeff Clune\n\nDigital Evolution Lab, Michigan State University\n\njclune@...\n\n\n\n\n&gt; From: &quot;Vinod K. Valsalam&quot; &lt;vkv@...&gt;\n&gt; Reply-To: &quot;neat@yahoogroups.com&quot; &lt;neat@yahoogroups.com&gt;\n&gt; Date: Mon, 02 Mar 2009 16:06:43 -0600\n&gt; To: &quot;neat@yahoogroups.com&quot; &lt;neat@yahoogroups.com&gt;\n&gt; Subject: Re: [neat] Re: Evolving Coordinated Quadruped Gaits with the\n&gt; HyperNEAT Generative Encoding\n&gt; \n&gt; \n&gt; Ken,\n&gt; \n&gt; I tested networks that output desired angles instead of angular\n&gt; velocities using the same modular setup described in my GECCO paper.\n&gt; The hip joints of the quadruped robot are universal joints, having two\n&gt; angles (rotations about a lateral axis and a longitudinal axis) that\n&gt; can be controlled independently.  Good trot and pace gaits similar to\n&gt; those obtained using angular velocity outputs evolved only in three\n&gt; out of ten trials.  Typically, the networks produce oscillations that\n&gt; are so fast that the legs seem to vibrate and the gaits look\n&gt; unrealistic:\n&gt; \n&gt;   http://www.cs.utexas.edu/users/vkv/quad-universal-angleoutputs.mp4\n&gt; \n&gt; So in my setup, good gaits are easier to evolve when networks output\n&gt; desired angular velocities.  I think it is because such networks allow\n&gt; us to control angular velocities directly, resulting in leg movements\n&gt; that are of the right speed for producing good gaits.\n&gt; \n&gt; Vinod\n&gt; \n&gt; \n&gt; At Fri, 27 Feb 2009 03:59:44 -0600,\n&gt; Vinod K. Valsalam wrote:\n&gt;&gt; \n&gt;&gt; \n&gt;&gt; Ken,\n&gt;&gt; \n&gt;&gt; The ODEs of the coupled oscillator system express time derivatives of\n&gt;&gt; the state variables as a function of those variables.  Therefore, when\n&gt;&gt; the outputs are derivatives of the inputs, the network corresponds\n&gt;&gt; directly to the ODEs, i.e. the network has the mathematical form of a\n&gt;&gt; coupled oscillator.  I suggested using angular velocities as network\n&gt;&gt; outputs to take advantage of this mathematical formalism.  I thought\n&gt;&gt; some more about whether we would still have similar advantages if the\n&gt;&gt; network outputs desired angles instead of angular velocities.  It\n&gt;&gt; turns out that such a network represents an approximation of the ODEs.\n&gt;&gt; To elaborate, let us write the derivatives in discrete form.  For\n&gt;&gt; example,\n&gt;&gt; \n&gt;&gt;   .\n&gt;&gt;   x = F(x)\n&gt;&gt; \n&gt;&gt; becomes\n&gt;&gt; \n&gt;&gt;   (x_(n+1) - x_n)/(t_(n+1) - t_n) = F(x_n)\n&gt;&gt; \n&gt;&gt; for the nth time step.  For constant step size, we can rewrite it as\n&gt;&gt; \n&gt;&gt;   x_(n+1) = G(x_n)\n&gt;&gt; \n&gt;&gt; We can represent such equations using a network that takes the current\n&gt;&gt; joint angle as input and produces the desired angle for the next time\n&gt;&gt; step as output.  So such a network should work as an approximation of\n&gt;&gt; the coupled oscillator system.  I will run some experiments to find\n&gt;&gt; out how well this approximation works in practice.\n&gt;&gt; \n&gt;&gt; Vinod\n&gt;&gt; \n&gt;&gt; \n&gt;&gt; At Fri, 27 Feb 2009 02:13:44 -0000,\n&gt;&gt; Kenneth Stanley wrote:\n&gt;&gt;&gt; \n&gt;&gt;&gt; Vinod, thanks for the detailed reply; it was very informative.  One\n&gt;&gt;&gt; issue on which I am still unclear is why it is important that the\n&gt;&gt;&gt; outputs be derivatives?  Why do you say that that is critical?  For\n&gt;&gt;&gt; example, if I had a system that took angle as input and output desired\n&gt;&gt;&gt; angle (like Jeff&#39;s), could not such a system form coupled oscillators\n&gt;&gt;&gt; just as well?  If not, what makes it more effective when outputs are\n&gt;&gt;&gt; desired velocities?  Is it simply that velocities require less\n&gt;&gt;&gt; accuracy to express than target angles?\n&gt;&gt;&gt; \n&gt;&gt;&gt; ken\n&gt;&gt;&gt; \n&gt;&gt;&gt; \n&gt;&gt;&gt; \n&gt;&gt;&gt; --- In neat@yahoogroups.com, &quot;Vinod K. Valsalam&quot; &lt;vkv@...&gt; wrote:\n&gt;&gt;&gt;&gt; \n&gt;&gt;&gt;&gt; At Tue, 24 Feb 2009 18:24:54 -0000,\n&gt;&gt;&gt;&gt; Kenneth Stanley wrote:\n&gt;&gt;&gt;&gt;&gt; \n&gt;&gt;&gt;&gt;&gt; Vinod, could you define &quot;coupled non-linear oscillators&quot; more\n&gt;&gt;&gt;&gt;&gt; specifically?  What are the necessary and sufficient conditions for\n&gt;&gt;&gt;&gt;&gt; something to be considered a coupled non-linear oscillators?\n&gt;&gt;&gt;&gt; \n&gt;&gt;&gt;&gt; Hi Ken!  The coupling here means that the oscillators influence each\n&gt;&gt;&gt;&gt; other&#39;s behavior.  Let me use the term &quot;coupled cell system&quot; to be\n&gt;&gt;&gt;&gt; more precise.  A coupled cell system is a collection of cells, where\n&gt;&gt;&gt;&gt; each cell i is a dynamical system with state x_i.  If cell i is\n&gt;&gt;&gt;&gt; coupled to another cell j, then it means that the state of cell i\n&gt;&gt;&gt;&gt; depends on the state of cell j.  Such a system is represented by a\n&gt;&gt;&gt;&gt; system of ODEs.  For example, the ODEs for a system with two cells\n&gt;&gt;&gt;&gt; that are coupled to each other can be written as follows:\n&gt;&gt;&gt;&gt; \n&gt;&gt;&gt;&gt;    .\n&gt;&gt;&gt;&gt;    x_1 = F_1(x_1, x_2)   ........ cell 1\n&gt;&gt;&gt;&gt;    .\n&gt;&gt;&gt;&gt;    x_2 = F_2(x_2, x_1)   ........ cell 2\n&gt;&gt;&gt;&gt; \n&gt;&gt;&gt;&gt; The LHS of the above ODEs represent the time derivatives of the state\n&gt;&gt;&gt;&gt; variables, and the functions F_1 and F_2 represent the internal\n&gt;&gt;&gt;&gt; dynamics of the cells.  The linearity or non-linearity of the system\n&gt;&gt;&gt;&gt; is determined by the nature of F_1 and F_2.\n&gt;&gt;&gt;&gt; \n&gt;&gt;&gt;&gt; The term &quot;cell&quot; is used instead of &quot;oscillator&quot; in the above\n&gt;&gt;&gt;&gt; terminology because it is not necessary for individual cells to be\n&gt;&gt;&gt;&gt; capable of producing oscillations.  However, the coupled cell system\n&gt;&gt;&gt;&gt; as a whole can display oscillatory behaviors.  More importantly,\n&gt;&gt;&gt;&gt; making some of the cells and couplings identical can constrain the\n&gt;&gt;&gt;&gt; cells to oscillate synchronously or with constant phase relations with\n&gt;&gt;&gt;&gt; each other, a property that is useful for modeling gaits.  For\n&gt;&gt;&gt;&gt; example, making the cells and couplings identical in the above\n&gt;&gt;&gt;&gt; two-cell system results in F_1 = F_2 = F.  It is then possible to show\n&gt;&gt;&gt;&gt; that functions F exist for which solutions x_1 and x_2 of the system\n&gt;&gt;&gt;&gt; are periodic and half a period out of phase with each other (see [1]\n&gt;&gt;&gt;&gt; below for details).\n&gt;&gt;&gt;&gt; \n&gt;&gt;&gt;&gt; Gaits are produced by assigning these cells to control the legs of a\n&gt;&gt;&gt;&gt; robot.  But how do we find an appropriate function F?  In my GECCO\n&gt;&gt;&gt;&gt; paper, I found F by representing it as a neural network module and\n&gt;&gt;&gt;&gt; then evolving it.  That is, the coupled cell system is implemented as\n&gt;&gt;&gt;&gt; a neural network controller, where each network module represents one\n&gt;&gt;&gt;&gt; ODE of the system.  The state variables x_i are the leg joint angles.\n&gt;&gt;&gt;&gt; Thus the network takes joint angles as input and produces desired\n&gt;&gt;&gt;&gt; joint angular velocities as output.  This formalism has the following\n&gt;&gt;&gt;&gt; advantages:\n&gt;&gt;&gt;&gt; \n&gt;&gt;&gt;&gt;   1. Theoretical understanding of the possible gaits.  Coupled cell\n&gt;&gt;&gt;&gt;      systems can be designed that model central pattern generators in\n&gt;&gt;&gt;&gt;      animals, producing symmetric, animal-like gaits.\n&gt;&gt;&gt;&gt; \n&gt;&gt;&gt;&gt;   2. Modularity: The coupled cell system I used for quadrupeds has\n&gt;&gt;&gt;&gt;      four identical cells/modules that differ only in the permutation\n&gt;&gt;&gt;&gt;      of inputs they receive.\n&gt;&gt;&gt;&gt; \n&gt;&gt;&gt;&gt;   3. Simple feed-forward neural network implementation, i.e. no need\n&gt;&gt;&gt;&gt;      for leaky integrators or recurrency.  Notice that the sigmoid\n&gt;&gt;&gt;&gt;      activation function of the neurons in the network provides any\n&gt;&gt;&gt;&gt;      necessary non-linearity.\n&gt;&gt;&gt;&gt; \n&gt;&gt;&gt;&gt; However, I had to manually specify the modules and the permutation of\n&gt;&gt;&gt;&gt; inputs to each module. It would be cool if HyperNEAT can evolve that\n&gt;&gt;&gt;&gt; specification automatically.\n&gt;&gt;&gt;&gt; \n&gt;&gt;&gt;&gt; \n&gt;&gt;&gt;&gt;&gt;  For\n&gt;&gt;&gt;&gt;&gt; example, I am assuming that either leaky or non-leaky neurons can be\n&gt;&gt;&gt;&gt;&gt; part of a coupled non-linear oscillator, or is it somehow more\n&gt;&gt;&gt;&gt;&gt; appropriate for the neurons to be non-leaky?  I guess I am curious why\n&gt;&gt;&gt;&gt;&gt; having a non-leaky neuron would be the most favorable choice in such a\n&gt;&gt;&gt;&gt;&gt; model, or whether it is somehow a matter of definition.\n&gt;&gt;&gt;&gt; \n&gt;&gt;&gt;&gt; Notice that my description above did not make any assumptions about\n&gt;&gt;&gt;&gt; leaky or non-leaky neurons.  Either type should be OK.  I used\n&gt;&gt;&gt;&gt; non-leaky neurons because they are simpler and sufficient.  I did not\n&gt;&gt;&gt;&gt; experiment with leaky neurons.\n&gt;&gt;&gt;&gt; \n&gt;&gt;&gt;&gt;&gt; \n&gt;&gt;&gt;&gt;&gt; Also, what are the minor adjustments to the substrate that you mention\n&gt;&gt;&gt;&gt;&gt; that would create this kind of system?\n&gt;&gt;&gt;&gt; \n&gt;&gt;&gt;&gt; Essentially, the substrate needs to implement the ODEs of the coupled\n&gt;&gt;&gt;&gt; cell system, i.e. substrate outputs must be the time derivatives of\n&gt;&gt;&gt;&gt; its inputs.  This condition is satisfied if inputs are joint angles\n&gt;&gt;&gt;&gt; and outputs are desired angular velocities.  The minor adjustment to\n&gt;&gt;&gt;&gt; Jeff&#39;s substrate that I mentioned was to interpret outputs as desired\n&gt;&gt;&gt;&gt; angular velocities instead of desired angles.  In principle, inputs\n&gt;&gt;&gt;&gt; besides joint angles are also not necessary for generating gaits.\n&gt;&gt;&gt;&gt; However, the other inputs he used (roll, pitch, yaw, and touch) may be\n&gt;&gt;&gt;&gt; useful for more complex behaviors that require such additional sensory\n&gt;&gt;&gt;&gt; inputs.\n&gt;&gt;&gt;&gt; \n&gt;&gt;&gt;&gt;&gt; \n&gt;&gt;&gt;&gt;&gt; In my experience, the leaky neurons also can produce oscillations\n&gt;&gt;&gt;&gt;&gt; reliably, but I am not sure if that is actually anything different\n&gt;&gt;&gt;&gt;&gt; from what you are describing or just another instance of the same\n&gt;&gt;&gt;&gt;&gt; phenomenon.\n&gt;&gt;&gt;&gt;&gt; \n&gt;&gt;&gt;&gt; \n&gt;&gt;&gt;&gt; As I mentioned above, a coupled cell system is a dynamical system.\n&gt;&gt;&gt;&gt; Since networks of leaky neurons can approximate any dynamical system,\n&gt;&gt;&gt;&gt; you are right that it is another instance of the same phenomenon.\n&gt;&gt;&gt;&gt; However, the coupled cell system framework allows us to reason about\n&gt;&gt;&gt;&gt; the high level properties of the system such as synchronicity and\n&gt;&gt;&gt;&gt; phase relations that are useful for gait generation, producing the\n&gt;&gt;&gt;&gt; advantages I listed above.  As a result, evolutionary search can be\n&gt;&gt;&gt;&gt; biased to discover robust and effective gaits more easily.\n&gt;&gt;&gt;&gt; \n&gt;&gt;&gt;&gt; References:\n&gt;&gt;&gt;&gt; \n&gt;&gt;&gt;&gt; There are several papers by Stewart, Golubitsky and others on the\n&gt;&gt;&gt;&gt; theory of coupled cell systems and how they can be used to model\n&gt;&gt;&gt;&gt; animal gaits.  For example, see the following:\n&gt;&gt;&gt;&gt; \n&gt;&gt;&gt;&gt; [1] I. Stewart, M. Golubitsky and M. Pivato. Symmetry groupoids and\n&gt;&gt;&gt;&gt;     patterns of synchrony in coupled cell networks. SIAM\n&gt;&gt;&gt;&gt;     J. Appl. Dynam. Sys.  2 (4) (2003) 609-646.\n&gt;&gt;&gt;&gt;     http://www.math.uh.edu/~mg/reprints/papers/groupoid_siam.pdf\n&gt;&gt;&gt;&gt; \n&gt;&gt;&gt;&gt; [2] J. J. Collins and I. N. Stewart. Coupled nonlinear oscillators and\n&gt;&gt;&gt;&gt;     the symmetries of animal gaits. Journal of Nonlinear Science,\n&gt;&gt;&gt;&gt;     3(1):349--392, 1993.\n&gt;&gt;&gt;&gt; \n&gt;&gt;&gt;&gt; My GECCO paper also has a background section discussing the coupled\n&gt;&gt;&gt;&gt; cell system I used for my quadruped robots.\n&gt;&gt;&gt;&gt; \n&gt;&gt;&gt;&gt; Vinod\n&gt;&gt;&gt;&gt; \n&gt;&gt;&gt;&gt; \n&gt;&gt;&gt;&gt;&gt; Thanks,\n&gt;&gt;&gt;&gt;&gt; \n&gt;&gt;&gt;&gt;&gt; ken\n&gt;&gt;&gt;&gt;&gt; \n&gt;&gt;&gt;&gt;&gt; --- In neat@yahoogroups.com, &quot;Vinod K. Valsalam&quot; &lt;vkv@&gt; wrote:\n&gt;&gt;&gt;&gt;&gt;&gt; \n&gt;&gt;&gt;&gt;&gt;&gt; \n&gt;&gt;&gt;&gt;&gt;&gt; Hi Jeff,\n&gt;&gt;&gt;&gt;&gt;&gt; \n&gt;&gt;&gt;&gt;&gt;&gt; Interesting work!  I was also curious to see how HyperNEAT would\n&gt;&gt;&gt;&gt;&gt;&gt; perform on this domain.  The videos of quadruped and hexapod gaits I\n&gt;&gt;&gt;&gt;&gt;&gt; evolved, and the paper I wrote with Prof. Risto Miikkulainen for\n&gt;&gt;&gt; last\n&gt;&gt;&gt;&gt;&gt;&gt; year&#39;s GECCO are available here:\n&gt;&gt;&gt;&gt;&gt;&gt; \n&gt;&gt;&gt;&gt;&gt;&gt;      http://nn.cs.utexas.edu/keyword?modularne\n&gt;&gt;&gt;&gt;&gt;&gt; \n&gt;&gt;&gt;&gt;&gt;&gt; With regard to the discussion about generating oscillations, I used\n&gt;&gt;&gt;&gt;&gt;&gt; neither sine wave as input nor leaky integrators.  Instead, neural\n&gt;&gt;&gt;&gt;&gt;&gt; network controllers with standard sigmoid neurons were\n&gt;&gt;&gt; modularized to\n&gt;&gt;&gt;&gt;&gt;&gt; behave as coupled non-linear oscillators (coupled cell systems).  As\n&gt;&gt;&gt;&gt;&gt;&gt; explained in the paper, and as Jean-Baptiste mentioned in an earlier\n&gt;&gt;&gt;&gt;&gt;&gt; post, such oscillators can produce synchronous and phase-related\n&gt;&gt;&gt;&gt;&gt;&gt; periodic behaviors suitable for generating gaits.  They are easy to\n&gt;&gt;&gt;&gt;&gt;&gt; evolve and produce animal-like gaits such as the pronk, pace, bound\n&gt;&gt;&gt;&gt;&gt;&gt; and trot for quadrupeds.\n&gt;&gt;&gt;&gt;&gt;&gt; \n&gt;&gt;&gt;&gt;&gt;&gt; With only minor adjustments to your setup, you can convert your\n&gt;&gt;&gt;&gt;&gt;&gt; substrate configuration to represent non-linear oscillators.  In\n&gt;&gt;&gt; fact,\n&gt;&gt;&gt;&gt;&gt;&gt; you would get a configuration similar to my modular controllers by\n&gt;&gt;&gt;&gt;&gt;&gt; restricting the network inputs to just the joint angles and\n&gt;&gt;&gt; producing\n&gt;&gt;&gt;&gt;&gt;&gt; angular velocities instead of angles as outputs.  HyperNEAT\n&gt;&gt;&gt; would then\n&gt;&gt;&gt;&gt;&gt;&gt; have to evolve the modularity that I specified by hand.  I think\n&gt;&gt;&gt; that\n&gt;&gt;&gt;&gt;&gt;&gt; would be an interesting experiment to run, and if successful would\n&gt;&gt;&gt;&gt;&gt;&gt; eliminate the need to specify the sine input.  BTW, did you find\n&gt;&gt;&gt; that\n&gt;&gt;&gt;&gt;&gt;&gt; the other inputs (i.e. pitch, yaw, roll, and touch) were\n&gt;&gt;&gt; necessary to\n&gt;&gt;&gt;&gt;&gt;&gt; evolve good gaits in your experiments?\n&gt;&gt;&gt;&gt;&gt;&gt; \n&gt;&gt;&gt;&gt;&gt;&gt; Vinod\n&gt;&gt;&gt;&gt;&gt;&gt; \n&gt;&gt;&gt;&gt;&gt; \n&gt;&gt;&gt;&gt;&gt; \n&gt;&gt;&gt;&gt;&gt; \n&gt;&gt;&gt;&gt;&gt; \n&gt;&gt;&gt;&gt;&gt; ------------------------------------\n&gt;&gt;&gt;&gt;&gt; \n&gt;&gt;&gt;&gt;&gt; Yahoo! Groups Links\n&gt;&gt;&gt;&gt;&gt; \n&gt;&gt;&gt;&gt;&gt; \n&gt;&gt;&gt;&gt;&gt; \n&gt;&gt;&gt;&gt; \n&gt;&gt;&gt; \n&gt;&gt;&gt; \n&gt;&gt;&gt; \n&gt;&gt;&gt; \n&gt;&gt;&gt; ------------------------------------\n&gt;&gt;&gt; \n&gt;&gt;&gt; Yahoo! Groups Links\n&gt;&gt;&gt; \n&gt;&gt;&gt; \n&gt;&gt;&gt; \n&gt;&gt; \n&gt;&gt; \n&gt;&gt; ------------------------------------\n&gt;&gt; \n&gt;&gt; Yahoo! Groups Links\n&gt;&gt; \n&gt;&gt; \n&gt;&gt; \n\n\n\n"}}