{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[{"name":"READ"}]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"userId":160378032,"authorName":"Vinod K. Valsalam","from":"&quot;Vinod K. Valsalam&quot; &lt;vkv@...&gt;","profile":"valsalam","replyTo":"LIST","senderId":"hX_oMC2YeiTAC0OVrsUwL7mIaKXlcnh1Gc0yAplIJLvHtAauTyisAEDPIxjGEBvnJ3TSwYSRDbHWdCb59ivatmhK0zDNN3Ak_517CroH","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [neat] New paper investigating HyperNEAT&#39;s sensitivity to different geometric representations of a problem","postDate":"1240465756","msgId":4640,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDg3ZnhmemdiczMud2wldmt2QGNzLnV0ZXhhcy5lZHU+","inReplyToHeader":"PEM2MTNGODNCLjJBNEFCJWpjbHVuZUBtc3UuZWR1Pg==","referencesHeader":"PDg3N2kxZmhxaHIud2wldmt2QGNzLnV0ZXhhcy5lZHU+CTxDNjEzRjgzQi4yQTRBQiVqY2x1bmVAbXN1LmVkdT4="},"prevInTopic":4639,"nextInTopic":4641,"prevInTime":4639,"nextInTime":4641,"topicId":4627,"numMessagesInTopic":14,"msgSnippet":"... Thanks, and wish you the same! Please see below for further comments. ... Consider the networks producing the 4-way symmetric gaits in which all four legs","rawEmail":"Return-Path: &lt;vkv@...&gt;\r\nX-Sender: vkv@...\r\nX-Apparently-To: neat@yahoogroups.com\r\nX-Received: (qmail 86091 invoked from network); 23 Apr 2009 05:53:23 -0000\r\nX-Received: from unknown (98.137.34.46)\n  by m3.grp.re1.yahoo.com with QMQP; 23 Apr 2009 05:53:23 -0000\r\nX-Received: from unknown (HELO mail.cs.utexas.edu) (128.83.139.10)\n  by mta3.grp.sp2.yahoo.com with SMTP; 23 Apr 2009 05:53:22 -0000\r\nX-Received: from zaphod. (cpe-66-68-98-66.austin.res.rr.com [66.68.98.66])\n\t(authenticated bits=0)\n\tby mail.cs.utexas.edu (8.14.3/8.14.3) with ESMTP id n3N5nBPU021521\n\t(version=TLSv1/SSLv3 cipher=DHE-RSA-AES256-SHA bits=256 verify=NO)\n\tfor &lt;neat@yahoogroups.com&gt;; Thu, 23 Apr 2009 00:49:12 -0500 (CDT)\r\nDate: Thu, 23 Apr 2009 00:49:16 -0500\r\nMessage-ID: &lt;87fxfzgbs3.wl%vkv@...&gt;\r\nTo: neat@yahoogroups.com\r\nIn-Reply-To: &lt;C613F83B.2A4AB%jclune@...&gt;\r\nReferences: &lt;877i1fhqhr.wl%vkv@...&gt;\n\t&lt;C613F83B.2A4AB%jclune@...&gt;\r\nUser-Agent: Wanderlust/2.15.5 (Almost Unreal) Emacs/22.1 Mule/5.0 (SAKAKI)\r\nMIME-Version: 1.0 (generated by SEMI 1.14.6 - &quot;Maruoka&quot;)\r\nContent-Type: text/plain; charset=US-ASCII\r\nX-eGroups-Msg-Info: 1:12:0:0:0\r\nFrom: &quot;Vinod K. Valsalam&quot; &lt;vkv@...&gt;\r\nSubject: Re: [neat] New paper investigating HyperNEAT&#39;s sensitivity to different geometric representations of a problem\r\nX-Yahoo-Group-Post: member; u=160378032; y=vQqWs9jAApDSX5USrVl6r3OlPt_IWe4My6-IE6YSnvCdxek\r\nX-Yahoo-Profile: valsalam\r\n\r\n\n&gt; &gt; It is an interesting and useful analysis of HyperNEAT&#39;s sensitivity to\n&gt; &gt; geometry in the quadruped locomotion domain.  BTW, I will also be\n&gt; &gt; presenting a paper that utilizes the same domain at the same GECCO\n&gt; &gt; track, and it also has been nominated for the Best Paper Award.  It\n&gt; &gt; introduces a new abstraction of indirect encoding for evolving\n&gt; &gt; symmetric and modular neural networks:\n&gt; &gt; \n&gt; &gt;    http://nn.cs.utexas.edu/?valsalam:gecco09\n&gt; &gt; \n&gt; &gt; So it looks like we are going to have an exciting competition for the\n&gt; &gt; Best Paper Award :-)\n&gt; \n&gt; Congratulations! The paper looks very cool. I wish you the best of\n&gt; luck.\n\nThanks, and wish you the same!\n\nPlease see below for further comments.\n\n&gt; \n&gt; &gt; -- Table 1, listing the gaits for different leg orderings, is\n&gt; &gt;    particularly interesting because it gives insight into the type of\n&gt; &gt;    patterns that the CPPN tends to produce. Do you have online videos\n&gt; &gt;    of the different gaits?\n&gt; &gt; \n&gt; &gt; -- What is the phase difference between the legs for the gaits with\n&gt; &gt;    left-right and front-back symmetry (Table 1)?  In particular, do\n&gt; &gt;    they qualify as pace and bound respectively, i.e. is the phase\n&gt; &gt;    difference between the sides a half-period? (I usually find it\n&gt; &gt;    useful to plot the leg angles as a function of time to determine\n&gt; &gt;    the leg phases more accurately than by observing the videos.)\n&gt; \n&gt; I looked at these videos a while back and found that most of the bilaterally\n&gt; symmetric gaits have two of the legs stiff and the other two doing most of\n&gt; the work. So, I would not classify those as pace and bound. At the moment, I\n&gt; do not recall any true pace and bound gaits. I will look into that again,\n&gt; but at the moment I am swamped with a paper deadline and the end-of-semester\n&gt; rush. I don&#39;t have any videos posted yet, but I will try to get to that\n&gt; before I leave the country (I&#39;m off to Norway soon for the Congress on\n&gt; Evolutionary Computation).\n&gt; \n&gt; I have looked at plots of the angles over time in the past, as in this\n&gt; paper:\n&gt; \n&gt; http://devolab.msu.edu/supportDocs/EvolvingCoordinatedGaitsWithHyperNEAT\n&gt; \n&gt; I have not yet done that for the gaits in the GECCO paper. It would be\n&gt; interesting to try.\n&gt; \n&gt; By the way, I still plan on using angular velocities instead of desired\n&gt; angles with HyperNEAT. That may produce more natural pace and bound gaits,\n&gt; especially when using a geometric representation that is biased toward\n&gt; producing such gaits.\n&gt; \n&gt; &gt; -- What kind of gaits did the HyperNEAT experiments with randomized\n&gt; &gt;    geometry produce?  Are they similar to the gaits in Table 1, with\n&gt; &gt;    all four legs in synchrony occurring in the majority of trials?\n&gt; \n&gt; If memory serves, the answer is yes. They mostly produced gaits with all\n&gt; four legs in synchrony. I&#39;ll try to check in on that when I have a sec to\n&gt; provide a more definitive answer.\n&gt; \n&gt; &gt; -- In the randomized experiments, do you think keeping the PRYS inputs\n&gt; &gt;    fixed and randomizing only the other inputs would produce better\n&gt; &gt;    results?  It seems to me that including the PRYS inputs in the\n&gt; &gt;    randomization may disrupt the geometry more since they do not have\n&gt; &gt;    a clear geometric interpretation.\n&gt; \n&gt; Interesting. I would think the opposite. Since they have no proper geometric\n&gt; location, why should it matter one way or the other if they are included in\n&gt; the randomization. In a sense, their current position is random. Why do you\n&gt; think HyperNEAT will do better with PRYS where it is than in any other\n&gt; random location?  \n\nConsider the networks producing the 4-way symmetric gaits in which all\nfour legs are synchronous.  Since the angular positions of all four\nlegs are the same at any given instant, the network receives the same\ninput for all four joints of the same joint type.  For example, in the\n2D substrate configuration, each column in the input layer except the\nPRYS column receive the same input values.  Therefore, the network is\ninvariant to any randomization of the inputs within those columns.\nThe same reasoning applies to the output layer as well.  So if the\nentire input layer is randomized, only permutations of inputs between\ncolumns are likely to disrupt the 4-way symmetric gait.\n\nFurthermore, observing the videos of the 4-way symmetric gaits you\nposted earlier suggests that all joints are moving in phase (we can\nconfirm this when you have the time to plot the joint angles).  If\nthat is the case, even permutations of inputs *between* columns\n(except PRYS) may not seriously disrupt the 4-way symmetric gait.\nHowever, including PRYS in the randomization is likely to be\ndisruptive because their behavior in time is different from the\nbehavior of the joint angles.\n\nIt follows that HyperNEAT should be able to produce the 4-way\nsymmetric gait almost as easily even when the geometry is scrambled.\nYou mentioned above that this gait indeed predominates in randomized\ngeometry experiments just as they do in engineered geometry\nexperiments, which seems to support this hypothesis.  It is also a\npossible explanation for how HyperNEAT is able to perform well with\nrandom geometric representations (which I think Ken also hinted at).\n\nIn short, performing the following two experiments when you have the\ntime should shed more light:\n\n  1. Plotting the joint angles to verify how closely they track each\n     other.  It would also be interesting to plot the sine input and\n     output angles to see how they are related in phase.\n\n  2. Not including the PRYS inputs in the randomization to see if it\n     gives better results.\n\n&gt; \n&gt; &gt; -- You mention that each controller was simulated for 6000 time steps,\n&gt; &gt;    but the simulation was terminated early if the controller did not\n&gt; &gt;    produce good behavior.  Do such early termination occur during the\n&gt; &gt;    evaluation of champions evolved by HyperNEAT as well?  Also, how\n&gt; &gt;    long was each time step?\n&gt; \n&gt; Those 6000 seconds correspond to 6 seconds of &#39;real&#39; simulated time. I&#39;m\n&gt; nearly sure that the answer to your question is that some of the HyperNEAT\n&gt; champs do not fall over in the time allowed and others do. Another\n&gt; interesting question is what happens if I take the final HyperNEAT champions\n&gt; and run them for more than 6 seconds. This would test whether they have\n&gt; evolved a true, general gait. I plan on performing that study when I put\n&gt; these results into a journal article.\n&gt; \n\nThat would indeed be an interesting experiment, and would answer the\nquestion about the stability of the evolved gaits.\n\nThanks for taking the time in your busy schedule to respond!\n\nVinod\n\n"}}