{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[{"name":"READ"}]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"userId":211599040,"authorName":"Jeff Clune","from":"Jeff Clune &lt;jclune@...&gt;","profile":"jeffreyclune","replyTo":"LIST","senderId":"zSYjnMZOZLCjm0b5yD1Eewlgb7carVXPu-3xHtJoAm4Wf_apsUeG7PK3l2p5BUeNtvk_it-Lpa_TWr2EE61sq-Xm","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [neat] Re: Multiagent HyperNEAT Revisited","postDate":"1266980741","msgId":5118,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEM3QUEwMUI1LjMwNkNCJWpjbHVuZUBtc3UuZWR1Pg==","inReplyToHeader":"PGhtMDJobCthbDlpQGVHcm91cHMuY29tPg=="},"prevInTopic":5115,"nextInTopic":5119,"prevInTime":5117,"nextInTime":5119,"topicId":5103,"numMessagesInTopic":8,"msgSnippet":"... Hi David. No problem. Thanks for the answers. ... Cool. I look forward to seeing the paper. ... I have never changed these parameters. But now that we are","rawEmail":"Return-Path: &lt;jclune@...&gt;\r\nX-Sender: jclune@...\r\nX-Apparently-To: neat@yahoogroups.com\r\nX-Received: (qmail 56224 invoked from network); 24 Feb 2010 03:05:51 -0000\r\nX-Received: from unknown (98.137.34.45)\n  by m14.grp.re1.yahoo.com with QMQP; 24 Feb 2010 03:05:51 -0000\r\nX-Received: from unknown (HELO mail-yw0-f182.google.com) (209.85.211.182)\n  by mta2.grp.sp2.yahoo.com with SMTP; 24 Feb 2010 03:05:50 -0000\r\nX-Received: by ywh12 with SMTP id 12so2217095ywh.10\n        for &lt;neat@yahoogroups.com&gt;; Tue, 23 Feb 2010 19:05:50 -0800 (PST)\r\nX-Received: by 10.150.8.10 with SMTP id 10mr1510044ybh.125.1266980750169;\n        Tue, 23 Feb 2010 19:05:50 -0800 (PST)\r\nReturn-Path: &lt;jclune@...&gt;\r\nX-Received: from ?10.0.1.2? (c-76-20-138-10.hsd1.mi.comcast.net [76.20.138.10])\n        by mx.google.com with ESMTPS id 5sm533113yxg.28.2010.02.23.19.05.47\n        (version=TLSv1/SSLv3 cipher=RC4-MD5);\n        Tue, 23 Feb 2010 19:05:48 -0800 (PST)\r\nUser-Agent: Microsoft-Entourage/12.13.0.080930\r\nDate: Tue, 23 Feb 2010 22:05:41 -0500\r\nTo: &quot;neat@yahoogroups.com&quot; &lt;neat@yahoogroups.com&gt;\r\nMessage-ID: &lt;C7AA01B5.306CB%jclune@...&gt;\r\nThread-Topic: [neat] Re: Multiagent HyperNEAT Revisited\r\nThread-Index: Acq0/j9KJ6sqjs3l9UKYwKxn/zEIcQ==\r\nIn-Reply-To: &lt;hm02hl+al9i@...&gt;\r\nMime-version: 1.0\r\nContent-type: text/plain;\n\tcharset=&quot;US-ASCII&quot;\r\nContent-transfer-encoding: 7bit\r\nX-eGroups-Msg-Info: 1:12:0:0:0\r\nFrom: Jeff Clune &lt;jclune@...&gt;\r\nSubject: Re: [neat] Re: Multiagent HyperNEAT Revisited\r\nX-Yahoo-Group-Post: member; u=211599040; y=SX09eQmMi_LtnCVxlj6IccPvaR-2IDCHSLzE78BcckKUADE-TJqb\r\nX-Yahoo-Profile: jeffreyclune\r\n\r\n&gt; Hi Jeff,\n&gt; \n&gt; Thanks for your interest in our paper.\n\nHi David. No problem. Thanks for the answers.\n\n&gt; In response to comments 1-3, we&#39;ve actually run several preliminary\n&gt; experiments with the intent of answering the questions you&#39;ve asked.  We hope\n&gt; to have a publication with formal results based on those experiments soon.  In\n&gt; general though, we do feel that this approach is superior to the one discussed\n&gt; in the previous multiagent HyperNEAT paper and would recommend anyone who\n&gt; wants to work with multiagent HyperNEAT to use the z-based substrate.\n\nCool. I look forward to seeing the paper.\n\n&gt; 4.  Way back when I first converted SharpNEAT to HyperSharpNEAT I tried a\n&gt; number of values and found that there wasn&#39;t a large difference between them,\n&gt; although 20% seemed to be slightly better.  For any new domains I&#39;ll try a few\n&gt; values to see if they make any difference, but I haven&#39;t found any where the\n&gt; elitism value made a significant difference.\n&gt; \n&gt; I will say that I&#39;ve never tried just saving the best organism.  One reason is\n&gt; that the SharpNEAT speciation code isn&#39;t really designed to only save one\n&gt; genome.  The other is that I think saving at least the best genomes in your\n&gt; best species would help prevent promising species from accidentally dying off\n&gt; too early.  On the other hand, I know you have several successful HyperNEAT\n&gt; experiments, so I guess I&#39;ll turn the question back on you: Have you found\n&gt; saving just the best genome to generally be better than saving more?  I&#39;m\n&gt; certainly willing to give it a try if you&#39;ve seen much better results.\n\nI have never changed these parameters. But now that we are discussing it I\nam realizing I don&#39;t actually know how much elitism I am using. I think I am\nusing the same parameters from Jason&#39;s experiments. I was focusing on this\nparameter, which is why I said I keep only the best org:\n\nForceCopyGenerationChampion 1.0\n\nBut I now also see these parameters in my experiment config files:\n\nSmallestSpeciesSizeWithElitism 5.0\nMutateSpeciesChampionProbability 0.0\n\nHow do I figure out my % elitism, so I know how my number compares to your\n20%?  \n\n&gt; 5.  The answer to whether we renormalize the sheets or insert the new sheets\n&gt; between the old is technically both.  In general we renormalize, that is\n&gt; however many agents there are, they are evenly spaced between -1 and 1.  While\n&gt; it may seem like a good idea to leave the original sheets where they were and\n&gt; insert the new ones among them, in most cases it is difficult to determine\n&gt; where the new sheets should go.\n&gt; \n&gt; For example, if there were 5 agents located at z={-1, -0.5, 0, 0.5, 1} and the\n&gt; team needed to be scaled to 7 agents, where should the two new agents go?\n&gt; There are two agents, but four spaces (-0.75, -0.25, 0.25, 0.75) to put them\n&gt; and no real reason to choose any of the spaces over the others.  By\n&gt; redistributing the agents evenly we eliminate such ad hoc decisions.  However,\n&gt; if the 5 agent team were to be scaled up to 9 agents, they would be placed at\n&gt; z={-1, -0.75, -0.5, -0.25, 0, 0.25, 0.5, 0.75,1}.  Thus, even though we&#39;re\n&gt; renormalizing, the placement works out the same as if we had inserted the new\n&gt; agents among the old.\n\nThat makes sense, and seems like the right way to do it.\n\n&gt; 6.  The sign function simply returns the sign of the node&#39;s activation: -1 if\n&gt; the activation is negative, 0 if it is 0, and 1 if it is positive.\n&gt;The reason \n&gt; for this function and the starting structure is to establish a team with\n&gt; mirror symmetry i.e. the ANN of the agent at z= 1 is the horizontally flipped\n&gt; version of the agent at z=-1 and so on.  We found that team mirror symmetry\n&gt; was beneficial in both domains that were tested in this paper, so it was\n&gt; logical to allow it to start with symmetry (which can be broken or ignored\n&gt; with mutations).\n\nOk. I get it. Thanks for clarifying.\n\n&gt; I hope I&#39;ve answered your questions,\n\nYou did. Thanks again for all the answers, and congrats on the great work.\n\n-Jeff\n\n&gt; David\n&gt; \n&gt; \n&gt; --- In neat@yahoogroups.com, Jeff Clune &lt;jclune@...&gt; wrote:\n&gt;&gt; \n&gt;&gt; Congrats on this paper. It features a lot of nice results.\n&gt;&gt; \n&gt;&gt; A few questions/comments:\n&gt;&gt; \n&gt;&gt; 1) The issue of interpolation is extremely interesting. In this paper you\n&gt;&gt; explicitly discuss how it would be beneficial to add new agents, and have\n&gt;&gt; their roles be intermediate versions of other agents (e.g., adding a 12th\n&gt;&gt; soccer player between the forwards and the midfielders would create a player\n&gt;&gt; that was a hybrid of the two roles). It would also be cool to see if teams\n&gt;&gt; can gracefully re-divide the strategy-space when they lose agents. For\n&gt;&gt; example, in soccer/futbol, after a few red cards are assigned, each player\n&gt;&gt; does not play the usual role that they would play on a team of 11, but\n&gt;&gt; instead re-divide the space up amongst the fewer players. For example, after\n&gt;&gt; the red cards their may be a left and right forward instead of a left, right\n&gt;&gt; and center forward. It would be cool to see if you can see such a result\n&gt;&gt; using your method.\n&gt;&gt; \n&gt;&gt; 2) You mention the benefits of interpolated roles, but do you have any\n&gt;&gt; evidence that such interpolation is occurring? One cool way to test this\n&gt;&gt; would be to compare two different treatments: T1) take your original N\n&gt;&gt; agents and multiply them to achieve the desired scaled-up number of agents\n&gt;&gt; (e.g., 9, 25, 100, 1000). If you start with 10 agents, and scale to 1000,\n&gt;&gt; you thus get 100 identical copies of agent 1, 100 identical copies of agent\n&gt;&gt; 2, etc. Compare the performance of this treatment to T2) interpolate 1000\n&gt;&gt; agents into the z coordinate range, so you have 1000 slightly different\n&gt;&gt; agents. The difference in performance between these treatments will help you\n&gt;&gt; figure out whether you are seeing a boost due to interpolation. If the\n&gt;&gt; performance increase due to scaling is not different between T1 and T2, then\n&gt;&gt; you know your performance boost was simply due to having more agents, not\n&gt;&gt; due to interpolation (you note something similar when you say &quot;adding more\n&gt;&gt; agents that all do the same thing will eventually cause a pile-up&quot;...my\n&gt;&gt; suggestion is a way to test this claim).\n&gt;&gt; \n&gt;&gt; 3) Why do you feel this new technique is better than your old technique? Is\n&gt;&gt; it possible to compare the two experimentally? Have you done so?\n&gt;&gt; \n&gt;&gt; 4) I notice you mention that you use 20% elitism. I usually only save the\n&gt;&gt; best organism. Have you found 20% to work a lot better, generally?\n&gt;&gt; \n&gt;&gt; 5) When you add new agents, do you leave the previous sheets in the same\n&gt;&gt; place, and interpolate new sheets between them, or do you renormalize all of\n&gt;&gt; the sheets such that it may be the case that no new agent is in the exact z\n&gt;&gt; coordinate of one of the original agents? It might be interesting to try\n&gt;&gt; both and see which tends to work better.\n&gt;&gt; \n&gt;&gt; 6) What is the &#39;sign&#39; function you mention in Figure 2? In general, I am\n&gt;&gt; having trouble figuring out what this means: &quot;The starting structure of the\n&gt;&gt; initial heterogeneous CPPN (Figure 2b) includes some additional structure to\n&gt;&gt; start evolution with knowledge of mirrored team symmetry; in particular, the\n&gt;&gt; sign function of z connected to multiplication operators on the x-axis means\n&gt;&gt; that the CPPN knows which side of the team is which and can opt to reflect\n&gt;&gt; one side across the midline.&quot;\n&gt;&gt; \n&gt;&gt; Congrats again on this nice work.\n&gt;&gt; \n&gt;&gt; Best regards,\n&gt;&gt; Jeff Clune\n&gt;&gt; \n&gt;&gt; Digital Evolution Lab, Michigan State University\n&gt;&gt; jclune@...\n&gt;&gt; www.msu.edu/~jclune\n&gt;&gt; \n&gt;&gt; \n&gt;&gt; \n&gt;&gt; \n&gt;&gt;&gt; From: Ken &lt;kstanley@...&gt;\n&gt;&gt;&gt; Reply-To: &quot;neat@yahoogroups.com&quot; &lt;neat@yahoogroups.com&gt;\n&gt;&gt;&gt; Date: Thu, 28 Jan 2010 02:59:22 -0000\n&gt;&gt;&gt; To: &quot;neat@yahoogroups.com&quot; &lt;neat@yahoogroups.com&gt;\n&gt;&gt;&gt; Subject: [neat] Multiagent HyperNEAT Revisited\n&gt;&gt;&gt; \n&gt;&gt;&gt; Our 2008 GECCO paper by David D&#39;Ambrosio and myself introduced the idea that\n&gt;&gt;&gt; a\n&gt;&gt;&gt; single HyperNEAT CPPN can encode a set of neural networks (instead of just\n&gt;&gt;&gt; one) that represent a pattern of policies for an entire team.  Since then a\n&gt;&gt;&gt; few people have asked about the way we laid out the team on the substrate\n&gt;&gt;&gt; and\n&gt;&gt;&gt; whether alternatives might be better.\n&gt;&gt;&gt; \n&gt;&gt;&gt; I am happy to announce, with my co-authors David D&#39;Ambrosio, Joel Lehman,\n&gt;&gt;&gt; and\n&gt;&gt;&gt; Sebastian Risi, that we have extensively tested such an alternative\n&gt;&gt;&gt; z-axis-based encoding and published the results to appear in AAMAS 2010,\n&gt;&gt;&gt; available here:\n&gt;&gt;&gt; \n&gt;&gt;&gt; http://eplex.cs.ucf.edu/publications/2010/dambrosio.aamas10.html\n&gt;&gt;&gt; \n&gt;&gt;&gt; Direct Link: http://eplex.cs.ucf.edu/papers/dambrosio_aamas10.pdf\n&gt;&gt;&gt; \n&gt;&gt;&gt; We believe this z-based substrate layout is superior to the previous one,\n&gt;&gt;&gt; particularly for scaling the size of the team, and should open up the field\n&gt;&gt;&gt; of\n&gt;&gt;&gt; multiagent learning further to HyperNEAT.  The paper also includes the first\n&gt;&gt;&gt; published results on scaling the size of the team without further training,\n&gt;&gt;&gt; which works because HyperNEAT can interpolate new policies for ANNs inserted\n&gt;&gt;&gt; along the z axis of the substrate.\n&gt;&gt;&gt; \n&gt;&gt;&gt; Videos that accompany the paper are here:\n&gt;&gt;&gt; http://eplex.cs.ucf.edu/mahnaamas2010.html\n&gt;&gt;&gt; \n&gt;&gt;&gt; ken\n&gt;&gt;&gt; \n&gt;&gt; \n&gt; \n\n\n\n"}}