{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[{"name":"READ"}]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"userId":467342474,"authorName":"Jeff Clune","from":"Jeff Clune &lt;jeffclune@...&gt;","profile":"jeffreyclune","replyTo":"LIST","senderId":"854VdABX0HvwIOfu8V-simKbLIZE3p2yhaOBzNseI4LjIuyOef6-k4k8RGoxrVlP1k5mcECG3IxQBQTp8yLo_JWcMjxYuDqu5g","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Reminder: Generative and Developmental Systems Track, GECCO 2011, Call for Papers and Participation","postDate":"1294799315","msgId":5439,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEM5NTI3QzAzLjJDOUNCJWplZmZjbHVuZUBjb3JuZWxsLmVkdT4="},"prevInTopic":0,"nextInTopic":0,"prevInTime":5438,"nextInTime":5440,"topicId":5439,"numMessagesInTopic":1,"msgSnippet":"Hello everyone. Just a reminder that the deadline is about two weeks away. GENERATIVE AND DEVELOPMENTAL SYSTEMS TRACK 2011 GENETIC AND EVOLUTIONARY COMPUTATION","rawEmail":"Return-Path: &lt;jclune@...&gt;\r\nX-Sender: jclune@...\r\nX-Apparently-To: neat@yahoogroups.com\r\nX-Received: (qmail 99545 invoked from network); 12 Jan 2011 02:28:41 -0000\r\nX-Received: from unknown (66.196.94.107)\n  by m6.grp.sp2.yahoo.com with QMQP; 12 Jan 2011 02:28:41 -0000\r\nX-Received: from unknown (HELO mail-qy0-f171.google.com) (209.85.216.171)\n  by mta3.grp.re1.yahoo.com with SMTP; 12 Jan 2011 02:28:41 -0000\r\nX-Received: by qyk32 with SMTP id 32so3278613qyk.16\n        for &lt;neat@yahoogroups.com&gt;; Tue, 11 Jan 2011 18:28:41 -0800 (PST)\r\nX-Received: by 10.229.224.136 with SMTP id io8mr309710qcb.250.1294799321278;\n        Tue, 11 Jan 2011 18:28:41 -0800 (PST)\r\nReturn-Path: &lt;jclune@...&gt;\r\nX-Received: from [10.0.1.16] (cpe-67-255-21-221.twcny.res.rr.com [67.255.21.221])\n        by mx.google.com with ESMTPS id p13sm134956qcu.5.2011.01.11.18.28.38\n        (version=TLSv1/SSLv3 cipher=RC4-MD5);\n        Tue, 11 Jan 2011 18:28:40 -0800 (PST)\r\nUser-Agent: Microsoft-Entourage/12.13.0.080930\r\nDate: Tue, 11 Jan 2011 21:28:35 -0500\r\nTo: &quot;neat@yahoogroups.com&quot; &lt;neat@yahoogroups.com&gt;\r\nMessage-ID: &lt;C9527C03.2C9CB%jeffclune@...&gt;\r\nThread-Topic: Reminder: Generative and Developmental Systems Track, GECCO\n 2011, Call for Papers and Participation\r\nThread-Index: AcuyAGmBwXKVuKBQdkOYO3lO/Tyddg==\r\nMime-version: 1.0\r\nContent-type: text/plain;\n\tcharset=&quot;US-ASCII&quot;\r\nContent-transfer-encoding: 7bit\r\nX-eGroups-Msg-Info: 1:12:0:0:0\r\nFrom: Jeff Clune &lt;jeffclune@...&gt;\r\nSubject: Reminder: Generative and Developmental Systems Track, GECCO 2011,\n Call for Papers and Participation\r\nX-Yahoo-Group-Post: member; u=467342474; y=XiQjlVFQjQUMTjHhezJ49kfaBr2SM_JBtEYqk2pK0l83Zi6PChyw\r\nX-Yahoo-Profile: jeffreyclune\r\n\r\nHello everyone. Just a reminder that the deadline is about two weeks away.\n\n              GENERATIVE AND DEVELOPMENTAL SYSTEMS TRACK\n    2011 GENETIC AND EVOLUTIONARY COMPUTATION CONFERENCE (GECCO-2011)\n\n           http://www.sigevo.org/gecco-2011\n\nDear Generative and Developmental Systems (GDS) Researcher,\n\nWe invite you to submit a paper to the GDS track at GECCO 2011, which is the\npremier conference for GDS-related work worldwide.\n\nOur program committee of GDS experts means that your paper will be reviewed\nby many leaders in the field. Moreover, the attendance and enthusiasm at the\nGDS track has increased every year since it started in 2007. The size and\nprestige of the GECCO conference will allow many researchers to learn\nabout your work, both at the conference and via the proceedings (GECCO  has\nthe highest impact rating of all conferences in the field of Evolutionary\nComputation and Artificial Life*).\n\nGenerative and Developmental Systems (GDS) is the study of indirect\nrepresentations (also known as generative or developmental encodings), i.e.\nindirect mappings between the genotype and phenotype.  Indirect\nrepresentations are often inspired by biological development, where complex\nphenotypes are grown from compact genomes. The aim of such systems is to\nexploit powerful representations that efficiently encode complex structures\nand increase the scalability and evolvability of evolutionary algorithms.\n\nTraditionally, GDS has focused on mappings that involve a developmental\nstage, implemented in a variety of ways including re-write systems and cell\nchemistry simulations.  However, GDS concerns a wide range of indirect\nencodings, including high-level abstractions of biological development and\nenvironmental interactions.\n\nGDS research both sheds light on biological development and furthers\nengineering goals by harnessing generative representations for evolutionary\ndesign.  Overall, GDS concerns a wide range of indirect representations\nconcerned with the genotype-phenotype map and encourages comparison,\ndiscussion, and analysis of the advantages and relationships among various\nrepresentations. The GDS track is also open to papers regarding applications\nof generative encodings to interesting problems.\n\nWe invite all papers related to GDS, including those in the following\nsubject areas: artificial development, artificial embryogeny, compositional\npattern producing networks (CPPNs), computational embryology, developmental\nencodings, evolutionary design, generative representations, genetic\nregulatory networks (GRNs), indirect encodings, genotype to phenotype\nmappings, procedural representations, Lindenmayer Systems (L-Systems), etc.\n\nFor more information, visit the GDS Community webpage at gds.wikispot.org\n\nWe also want to alert you to the historical importance of this track. Many\nof you share our excitement about this field and its connection to the\npowerful capabilities of biological encoding and development. For many\nyears, there was no consistent annual venue to which researchers in this\narea could submit papers to be reviewed by a committee of GDS researchers.\nMost opportunities to present work in this area have been through one-time\nworkshops or symposia that do not carry the same weight as a GECCO\nconference publication. To address this gap, a committee of GDS researchers\nencouraged GECCO to establish an official conference track in 2007. With the\nestablishment of the track, we now have an opportunity to build a strong and\nconsistent community that can improve and flourish over time.\n\nHowever, the track can only survive with your submissions.   It is important\nto note that GECCO permanently cancels tracks that fail to attract\nsufficient submissions.  Therefore, our community can preserve this new\nresource only by contributing papers.  We know that you have many options\nfor submitting your GDS-related ideas, and we hope that you will consider\nthe long-term investment that GDS represents for the community.  Our program\ncommittee is selected from among the top GDS researchers in the world, and\nwe hope that our track will continue to flourish with your enthusiasm.\n\n\nIMPORTANT DATES\n* Submission deadline: January 26, 2011\n* Notification of paper acceptance: March 23, 2011\n* Camera-ready submission: April 8, 2011\n* GECCO-2010 Conference: July 12-16, 2011\n\n\nThe conference will be held in Dublin, Ireland.\n\n\nFor more information, please see the GECCO homepage at\nhttp://www.sigevo.org/gecco-2011\n\n\nBest Regards,\n\nJeff Clune and Greg Hornby\n\n2011 GECCO GDS Track Chairs\n\n* http://www.cs-conference-ranking.org/conferencerankings/topicsii.html\n\n\n\n\nGECCO is sponsored by the Association for Computing Machinery Special\nInterest Group on Genetic and Evolutionary Computation (SIGEVO). SIG\nServices: 2 Penn Plaza, Suite 701, New York, NY, 10121, USA,\n1-800-342-6626 (USA and Canada) or +212-626-0500 (Global).\n\n\n\n\n\n\nBest regards,\nJeff Clune\n\nPostdoctoral Fellow\nHod Lipson&#39;s Computational Synthesis Laboratory\nCornell University\njeffclune@...\nwww.msu.edu/~jclune\n\n**Call for papers! Generative and Developmental Systems Track, GECCO 2011\n(Dublin). Deadline Jan. 26th.**\n\n\n\n"}}