{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[{"name":"READ"}]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"userId":344770077,"authorName":"Colin Green","from":"Colin Green &lt;colin.green1@...&gt;","profile":"alienseedpod","replyTo":"LIST","senderId":"oX6W6qDiACGBqbQUcpdgH8cfsLlMRYnAZD6iB9VskcOVElBspkyH-rb4n6JqqIKX9EXH5jNmYEpuHDEZL6Pgmk8-jY4Z2_IJyR-s","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [neat] Re: &#39;Messy&#39; Networks","postDate":"1299443241","msgId":5484,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEFBTkxrVGk9NUMxblQ1dlh4cGVvODVCcmVYMTJ2QXNRVz1VTFdRTTNOcitXdkBtYWlsLmdtYWlsLmNvbT4=","inReplyToHeader":"PGlrdWszYitiOWkyQGVHcm91cHMuY29tPg==","referencesHeader":"PEFBTkxrVGlrZGhoVHcrcE05cjVpUlY3PWt6TEZLS0RrK3VrY1ZoX3JqVT1yaEBtYWlsLmdtYWlsLmNvbT4JPGlrdWszYitiOWkyQGVHcm91cHMuY29tPg=="},"prevInTopic":5483,"nextInTopic":5486,"prevInTime":5483,"nextInTime":5485,"topicId":5480,"numMessagesInTopic":7,"msgSnippet":"... Sure. ... So I have a counterpoint to this argument that I m not 100% sure how to explain but I ll have a go... Yes there are various ANN connection weight","rawEmail":"Return-Path: &lt;colin.green1@...&gt;\r\nX-Sender: colin.green1@...\r\nX-Apparently-To: neat@yahoogroups.com\r\nX-Received: (qmail 10128 invoked from network); 6 Mar 2011 20:27:23 -0000\r\nX-Received: from unknown (66.196.94.106)\n  by m11.grp.re1.yahoo.com with QMQP; 6 Mar 2011 20:27:23 -0000\r\nX-Received: from unknown (HELO mail-wy0-f174.google.com) (74.125.82.174)\n  by mta2.grp.re1.yahoo.com with SMTP; 6 Mar 2011 20:27:22 -0000\r\nX-Received: by mail-wy0-f174.google.com with SMTP id 36so3629806wyg.19\n        for &lt;neat@yahoogroups.com&gt;; Sun, 06 Mar 2011 12:27:22 -0800 (PST)\r\nMIME-Version: 1.0\r\nX-Received: by 10.227.207.65 with SMTP id fx1mr2734831wbb.119.1299443241386;\n Sun, 06 Mar 2011 12:27:21 -0800 (PST)\r\nX-Received: by 10.227.179.143 with HTTP; Sun, 6 Mar 2011 12:27:21 -0800 (PST)\r\nIn-Reply-To: &lt;ikuk3b+b9i2@...&gt;\r\nReferences: &lt;AANLkTikdhhTw+pM9r5iRV7=kzLFKKDk+ukcVh_rjU=rh@...&gt;\n\t&lt;ikuk3b+b9i2@...&gt;\r\nDate: Sun, 6 Mar 2011 20:27:21 +0000\r\nMessage-ID: &lt;AANLkTi=5C1nT5vXxpeo85BreX12vAsQW=ULWQM3Nr+Wv@...&gt;\r\nTo: neat@yahoogroups.com\r\nContent-Type: text/plain; charset=ISO-8859-1\r\nFrom: Colin Green &lt;colin.green1@...&gt;\r\nSubject: Re: [neat] Re: &#39;Messy&#39; Networks\r\nX-Yahoo-Group-Post: member; u=344770077; y=kFKfMZgwmxMrXuVFUOaJ-4ycZAZUxYOIMR1w5hnTwxsMlh5qRw3Z\r\nX-Yahoo-Profile: alienseedpod\r\n\r\nOn 6 March 2011 00:22, Ken &lt;kstanley@...&gt; wrote:\n&gt;\n&gt; Hi Colin,\n&gt;\n&gt; I think it&#39;s pretty reasonable to speculate that some initial &quot;primed&quot; connectivity is\n&gt; specified through DNA that then goes through changes according to rules of plasticity. Of\n&gt; course, there is probably not a strict &quot;pre-specified&quot; period and another strict &quot;plastic&quot;\n&gt; period, because in reality they likely overlap from the very start, but the general idea that\n&gt; both elements are present and that the pendulum swings gradually away from\n&gt; pre-specification makes sense to me.\n\nSure.\n\n&gt; From a neuroevolution perspective, it&#39;s possible to\n&gt; imagine variants of adaptive HyperNEAT that exhibit more or less of this type of dynamic.\n&gt; Adaptive HyperNEAT was described in &quot;Indirectly Encoding Neural Plasticity as a Pattern\n&gt; of Local Rules,&quot; which is at http://eplex.cs.ucf.edu/publications/2010/risi.sab10.html . Of\n&gt; course we are continuing to explore these types of plastic models.\n\n&gt; About the junk DNA hypothesis - it&#39;s the type of thing you can&#39;t really definitively verify as\n&gt; true or false, but if some initial &quot;randomness&quot; in the brain was provided by junk DNA it\n&gt; wouldn&#39;t be that surprising. But the thing I kind of object to in the quotations you provided\n&gt; is the idea that this idea is &quot;bold.&quot; It doesn&#39;t seem to me to be a major problem to explain\n&gt; how disorganized randonmness can get into a system. I mean, random initialization (which\n&gt; is a standard part of many EAs and other learning algorithms) is generally not the\n&gt; interesting part, at least not in terms of being the part that requires great intellectual effort\n&gt; to conceive or understand. So if nature in fact took one arbitrary route to getting a little\n&gt; randomness into things over another, it doesn&#39;t seem that impressive or fortuitous\n&gt; compared to how it discovered the parts that are, in contrast, well-organized.\n\nSo I have a counterpoint to this argument that I&#39;m not 100% sure how\nto explain but I&#39;ll have a go...\n\nYes there are various ANN connection weight initialisation methods\nsome of which employ randomness either by itself or as part of some\nbroader method. Those techniques (AFAIK) tend to use traditional\nrandom number generators (RNGs) and either uniform or gaussian noise.\nI&#39;m suggesting that if nature had a use for this form of randomness\nthen it would be fairly easy to evolve from scratch and therefore\nwouldn&#39;t require utilisation of junk DNA. Easy to evolve because the\nnoise could be said to have low Kolmogorov complexity (can be\ngenerated by a simple algorithm), although I&#39;m not 100% sure how\nbiologically plausible this part of my argument is.\n\nSo assuming for now that nature /is/ using junk DNA as a source of\nnoise for connection patterns *and* that there is an easier to\ndiscover source, the question becomes - why use junk DNA?\n\nThis junk DNA has complexity and structure that had utility in its\norigin domain, so as a source of connectivity patterns in this other\nunrelated domain it&#39;s /effectively/ random, but this is a form of\nrandomness very much distinct from gaussian noise, it has complex\nstructure. E.g. consider using bytes from some random portion of\ncomputer RAM as a source of random numbers - it&#39;s going to have very\ndifferent properties than gaussian noise. Mathematically speaking the\njunk DNA noise has a high(er) Kolmogorov complexity (it cannot be\nrepresented by a simple/trivial algorithm as gaussian noise can be).\nSo yes it&#39;s arbitrary but it&#39;s also non-trivial to evolve from\nscratch, as such it&#39;s possible that some properties of this complex\nrandom noise are useful for brains - e.g. maybe when mapped to\nconnectivity patterns they have a good proportion of short to long\nconnection lengths (massively oversimplifying how complex this junk\nDNA might be here, but maybe that helps explain my argument).\n\n[As a side note all of this sort of fits in with your talk on\nserendipity and novelty search]\n\n[As another side note I would also add that if junk DNA is being used\nit&#39;s likely that it&#39;s being used for things other than connectivity\npatterns - that&#39;s just one hypothesis. We know that this DNA is being\nexpressed but don&#39;t know for sure if it has an utility, it might just\nbe a side effect of other useful DNA being expressed (holding on for\nthe ride)]\n\nBut if you take on the assumptions I&#39;ve stated then this has\nimplications for CPPNs. Currently our CPPNs are mostly using\ncontinuous functions operating on a continuous coordinate space - and\ntherefore generate continuous/smooth connectivity patterns. Should we\nconsider inclusing a means of introducing complexity into the patterns\nearly on that isn&#39;t directly evolved? e.g. some new CPPN function that\nrefers to a chunk of complex random noise? For a laugh we could use\nactual junk DNA sequences from nature translated into numbers -\nprobably as good a source as any :)\n\nColin.\n\n"}}