{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[{"name":"READ"}]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"userId":54567749,"authorName":"Ken","from":"&quot;Ken&quot; &lt;kstanley@...&gt;","profile":"kenstanley01","replyTo":"LIST","senderId":"m4t0m9SfUW854Q2s7qPSlhjsJqFUiGFbRlg6z_HefYdK2gSSppu_e8u9O0J0FQrXNBVIPSKKbyJYVB_UcKSpfN_w_HfK","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: Online Video of Keynote Talk on &quot;Searching Without Objectives&quot;","postDate":"1299461912","msgId":5487,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGlsMWN1bytzYjg4QGVHcm91cHMuY29tPg==","inReplyToHeader":"PEM5OTgyRENDLjkzRUIlamVmZmNsdW5lQGNvcm5lbGwuZWR1Pg=="},"prevInTopic":5485,"nextInTopic":0,"prevInTime":5486,"nextInTime":5488,"topicId":5478,"numMessagesInTopic":4,"msgSnippet":"... Sure, it s always good to be able to point out objectives that are going to be very hard for us.  The trick of course is that we don t know yet how hard","rawEmail":"Return-Path: &lt;kstanley@...&gt;\r\nX-Sender: kstanley@...\r\nX-Apparently-To: neat@yahoogroups.com\r\nX-Received: (qmail 56453 invoked from network); 7 Mar 2011 01:38:35 -0000\r\nX-Received: from unknown (66.196.94.105)\n  by m17.grp.re1.yahoo.com with QMQP; 7 Mar 2011 01:38:35 -0000\r\nX-Received: from unknown (HELO n45b.bullet.mail.sp1.yahoo.com) (66.163.168.159)\n  by mta1.grp.re1.yahoo.com with SMTP; 7 Mar 2011 01:38:34 -0000\r\nX-Received: from [69.147.65.172] by n45.bullet.mail.sp1.yahoo.com with NNFMP; 07 Mar 2011 01:38:34 -0000\r\nX-Received: from [98.137.34.34] by t14.bullet.mail.sp1.yahoo.com with NNFMP; 07 Mar 2011 01:38:34 -0000\r\nDate: Mon, 07 Mar 2011 01:38:32 -0000\r\nTo: neat@yahoogroups.com\r\nMessage-ID: &lt;il1cuo+sb88@...&gt;\r\nIn-Reply-To: &lt;C9982DCC.93EB%jeffclune@...&gt;\r\nUser-Agent: eGroups-EW/0.82\r\nMIME-Version: 1.0\r\nContent-Type: text/plain; charset=&quot;ISO-8859-1&quot;\r\nContent-Transfer-Encoding: quoted-printable\r\nX-Mailer: Yahoo Groups Message Poster\r\nX-Yahoo-Newman-Property: groups-compose\r\nFrom: &quot;Ken&quot; &lt;kstanley@...&gt;\r\nSubject: Re: Online Video of Keynote Talk on &quot;Searching Without Objectives&quot;\r\nX-Yahoo-Group-Post: member; u=54567749; y=LOdyrxXQB1Drf_XfjDG4LRjwOfXtnRaywqGZhklVn5WSeSrbR2Ip\r\nX-Yahoo-Profile: kenstanley01\r\n\r\n\n\nHi Jeff, I appreciate the feedback.  I respond to your comments below:\n\n-=\r\n-- In neat@yahoogroups.com, Jeff Clune &lt;jeffclune@...&gt; wrote:\n&gt;\n&gt; Hi Ken-\n&gt;=\r\n \n&gt; I watched this keynote and greatly enjoyed it. Thanks for posting it.\n&gt;=\r\n \n&gt; I had a few thoughts that I think could improve future versions of your=\r\n\n&gt; argument. I know you are interested in constantly optimizing these pitch=\r\nes,\n&gt; so here are my thoughts, whatever they are worth.\n&gt; 1. synthetic sola=\r\nr panels are much more efficient than photosynthesis. so it\n&gt; seems odd to =\r\nuse that as an example of something nature dominates us on.\n&gt; there are so =\r\nmany examples where we don&#39;t compare at all to natural designs,\n&gt; that you =\r\nmight raise fewer red flags by going with an undebatable one.\n&gt; 2. we know =\r\na lot about cancer and I think we will solve it soon (~20-40\n&gt; years). I wo=\r\nuld say that is more like the moon mission. we could solve it in\n&gt; less tha=\r\nn 20 years if we dedicated an inordinate amount of resources to it.\n&gt; I thi=\r\nnk you do better to pick things like levitation, time-travel, or\n&gt; somethin=\r\ng in between, because in that case I cannot bring to mind the steps\n&gt; that =\r\nneed to be taken to get there, which is exactly your point. with\n&gt; cancer, =\r\nmany researchers will tell you that we do know a ton of things that\n&gt; need =\r\nto be done, and it is just a matter of doing them (and building the\n&gt; techn=\r\nology to allow them to scale).\n&gt; 3. the mission to the moon wasn&#39;t one step=\r\nping stone away, but many. your\n&gt; argument works, but should be &quot;a handful =\r\nof stepping stones away&quot; vs. a\n&gt; dozens/hundreds of stepping stones away&quot;\n&gt;=\r\n \n&gt; All of those are very minor points, however. Overall I like the pitch.\n=\r\n&gt; \n\nSure, it&#39;s always good to be able to point out objectives that are goin=\r\ng to be very hard for us.  The trick of course is that we don&#39;t know yet ho=\r\nw hard something is that we have not yet achieved.  Yet one thing to keep i=\r\nn mind about some of these examples (e.g. photosynthesis) is that I&#39;m only =\r\npointing out that nature inspires us with its achievements and that they we=\r\nre not its objectives.  So whether or not we&#39;ve really beat it or not I don=\r\n&#39;t think is the instrumental issue behind my point. For example, even if we=\r\n achieve AI in the future, the point that intelligence was an amazing (and =\r\nnon-objective) discovery of natural evolution still stands.  \n\nSome of your=\r\n specific points are interesting - as I mentioned to you in private, I&#39;ve b=\r\neen getting some conflicting information on whether or not photosynthesis w=\r\norks better than synthetic methods, but what Colin said about it makes some=\r\n sense.  As for cancer, I&#39;m not a big fan of futurologist types of predicti=\r\nons that &quot;amazing objective X will be achieved in 20-40 years.&quot;  We&#39;ve hear=\r\nd that before from the &quot;experts&quot; in AI too.  Often the experts are blind to=\r\n deception in their very own search space (which is why it&#39;s deceptive), so=\r\n you can&#39;t really trust an expert to tell you what&#39;s around the corner in t=\r\nhe future.  But the key for me is that if we do cure cancer soon, then it&#39;s=\r\n only one stepping stone away anyway, so there&#39;s no real inconsistency ther=\r\ne.\n\nThe specific number of stepping stones is obviously subjective.  That i=\r\ns, &quot;one stepping stone away&quot; is meant as a qualitative description.  of cou=\r\nrse you can&#39;t really quantify precisely how many there are.  So if you pref=\r\ner &quot;a few&quot; to &quot;one,&quot; we still pretty much mean the same thing.  The point i=\r\ns when something is &quot;many&quot; away, we aren&#39;t going to get there as an objecti=\r\nve.\n\nUnfortunately, right at the moment in the video where I mention the sp=\r\nace program there was about 1 minute of video lost.  If you watch carefully=\r\n you can see the cut/glitch.  That was because they had to change tapes at =\r\nthat moment (so they tell me), so unfortunately you didn&#39;t actually see my =\r\nargument regarding the space program.  \n\nBut I think it&#39;s a little confusin=\r\ng to talk about any of these examples at a single snapshot in time (e.g. no=\r\nw).  Of course, there will always be a moment when we are just a stepping s=\r\ntone away from anything, and of course for anything we actually have alread=\r\ny accomplished, we literally were once a stepping stone away.  But the larg=\r\ner point is that many stepping stones always preceded that moment, and when=\r\n we were back at those far-prior stepping stones, the necessary stepping st=\r\nones that lay ahead would be impossible to predict.  Hence the futility of =\r\nthe objective.\n\n&gt; Here is a question I got when telling someone about your =\r\nspeech. They\n&gt; pointed out that directed evolution works all the time in an=\r\nimal breeding\n&gt; (think chihuahuas and great danes vs. their ancestors). Exp=\r\nerimental\n&gt; biologists also often find that animals can be bred in all sort=\r\ns of\n&gt; directions. A prof at MSU who does that recently told a room of peop=\r\nle that\n&gt; &quot;we can basically get the animals to vary on any dimension we foc=\r\nus on.&quot;\n&gt; That seems to contradict the argument that goal-oriented selectio=\r\nn will\n&gt; never work. \n&gt; \n&gt; I can think of rebuttals to this argument (I in =\r\nfact gave them to the person\n&gt; who raised the issue), but I would be intere=\r\nsted to hear your take.\n&gt; \n\nI think it&#39;s a great example of how we&#39;ve built=\r\n up this mythology in our society that we can guide our endeavors through o=\r\nbjectives.  These scientists notice that they can vary animals along certai=\r\nn selected dimensions and then effectively delude themselves into thinking =\r\nby implication that such a capability means that can jump more than a stepp=\r\ning-stone away.  If only that were true.\n\nIf it were true, then there are a=\r\n couple &quot;dimensions&quot; I am sure our super-breeder colleagues would have trav=\r\nersed by now:\n\n-First, clearly, they would have bred dogs to be able to tal=\r\nk.  I don&#39;t know why they wasted so much time breeding stuff like fluffines=\r\ns or fetching when the truth is everyone would like dogs to be able to tell=\r\n us what they&#39;re thinking.\n\n-Second, without a doubt, they would have bred =\r\nhorses to have wings.  I don&#39;t see why this &quot;dimension&quot; is not fair game.  =\r\nAfter all, it can start from just a little bulge at the hips and a little a=\r\nerodynamic optimization, and soon enough we&#39;d have flying horses, which wou=\r\nld be way more convenient for many things than riding horses that are stuck=\r\n pathetically to the ground.\n\nSo I think what such scientists are saying is=\r\n a bit sensationalistic, and not really serious.  But to give them the bene=\r\nfit of the doubt I&#39;m guessing that part of it just a way to raise excitemen=\r\nt rather than a literal claim.\n\nThe reality is, picking an animal to breed =\r\nis a great example of how stranded we are on the stepping stones we happen =\r\nto have now.  Dogs breeders can only take us so far away from dogs, as can =\r\nhorse breeders from horses.  In the end, our vision of how to move beyond o=\r\nne stepping stone away is clouded by the vast complexity of the search spac=\r\ne.  The best we can do is pick the most promising stepping stone from among=\r\n those nature has provided us, which, in fact, is exactly why non-objective=\r\n process are so powerful.  They are based on choosing promising stepping st=\r\nones, which means evaluating the potential of where you are as opposed to t=\r\nhe promise of getting where you want to be.\n\n\n&gt; PS. I can&#39;t believe you wer=\r\ne so nice to the creationist. I would have said\n&gt; something like &quot;People wh=\r\no deny the overwhelming and obvious evidence for\n&gt; evolution have not revie=\r\nwed the evidence with a rational, open mind. They\n&gt; have simply come to the=\r\n wrong conclusion, because they are intentionally\n&gt; misleading themselves o=\r\nr because whoever controls their access to\n&gt; information is misleading them=\r\n.&quot;  That sounds less nice, but I don&#39;t think\n&gt; we should be so nice to peop=\r\nle who are so willfully ignorant, or the\n&gt; converts of those who are.\n&gt; \n\nM=\r\ny thinking behind how I handled the creationist question is that he was abo=\r\nut to completely derail the focus of the audience away from my point and in=\r\nto the creationist-evolutionist debate.  That debate is so charged and emot=\r\nional that injecting it into anything is a formula for distraction.  I don&#39;=\r\nt want everyone in the audience to walk away from my talk engaged in a heat=\r\ned discussion of the insanity of creationism; I want them thinking about my=\r\n talk.  So what I did was basically confuse him - if you notice, he wasn&#39;t =\r\nsure how to respond to my response, which I think is a great thing.  It kep=\r\nt the topic on objectives instead of how crazy one side or the other is.  I=\r\nf I had told him that he is &quot;misleading himself&quot; it would have led to a won=\r\nderful theatrical exchange, but ruined the focus on my overall point.\n\n&gt; \n&gt;=\r\n PPS. You made any progress on thinking up an algorithmic way to quantify\n&gt;=\r\n interestingess?\n&gt; \n&gt; \n\nOf course that is a very deep topic, and we are loo=\r\nking at it.  I think we have some new ideas in the pipeline that give some =\r\ninsight into it, but truly formalizing what interestingness means is probab=\r\nly not going to happen anytime soon.  I think it&#39;s more than one stepping s=\r\ntone away :)  Of course, interestingness and novelty are highly related to =\r\neach other, though not exactly the same.\n\nken\n\n\n\n\n"}}