{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[{"name":"READ"}]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"userId":130984297,"authorName":"joel278","from":"&quot;joel278&quot; &lt;lehman.154@...&gt;","profile":"joel278","replyTo":"LIST","senderId":"itGWVRSAIKVAMoPB7ZVv74TpZFdtlQ3e8YUyVh3GvJGDiGTNQ40CmtBHnaiZGVzCSCFsAkaUpS6eW_TPqZcKasIK9XZc","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: &quot;Survive and Reproduce&quot; as an Objective","postDate":"1302060510","msgId":5524,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGluZ21rdStobjVxQGVHcm91cHMuY29tPg==","inReplyToHeader":"PEJBTkxrVGk9TXBTV3d1UmF5M0Jnd0RNdnpUNFdIaTFKRDBRQG1haWwuZ21haWwuY29tPg=="},"prevInTopic":5523,"nextInTopic":5525,"prevInTime":5523,"nextInTime":5525,"topicId":5507,"numMessagesInTopic":25,"msgSnippet":"Colin, Sometimes our view of evolution is colored by our often unquestioned assumption that greater complexity is a good or necessary thing. Instead, generally","rawEmail":"Return-Path: &lt;lehman.154@...&gt;\r\nX-Sender: lehman.154@...\r\nX-Apparently-To: neat@yahoogroups.com\r\nX-Received: (qmail 50095 invoked from network); 6 Apr 2011 03:28:31 -0000\r\nX-Received: from unknown (66.196.94.107)\n  by m15.grp.re1.yahoo.com with QMQP; 6 Apr 2011 03:28:31 -0000\r\nX-Received: from unknown (HELO n38b.bullet.mail.sp1.yahoo.com) (66.163.168.152)\n  by mta3.grp.re1.yahoo.com with SMTP; 6 Apr 2011 03:28:31 -0000\r\nX-Received: from [69.147.65.149] by n38.bullet.mail.sp1.yahoo.com with NNFMP; 06 Apr 2011 03:28:31 -0000\r\nX-Received: from [98.137.34.36] by t9.bullet.mail.sp1.yahoo.com with NNFMP; 06 Apr 2011 03:28:30 -0000\r\nDate: Wed, 06 Apr 2011 03:28:30 -0000\r\nTo: neat@yahoogroups.com\r\nMessage-ID: &lt;ingmku+hn5q@...&gt;\r\nIn-Reply-To: &lt;BANLkTi=MpSWwuRay3BgwDMvzT4WHi1JD0Q@...&gt;\r\nUser-Agent: eGroups-EW/0.82\r\nMIME-Version: 1.0\r\nContent-Type: text/plain; charset=&quot;ISO-8859-1&quot;\r\nContent-Transfer-Encoding: quoted-printable\r\nX-Mailer: Yahoo Groups Message Poster\r\nX-Yahoo-Newman-Property: groups-compose\r\nFrom: &quot;joel278&quot; &lt;lehman.154@...&gt;\r\nSubject: Re: &quot;Survive and Reproduce&quot; as an Objective\r\nX-Yahoo-Group-Post: member; u=130984297; y=oQDZFKZ0tWvb14wsK3-yahDBPCcfTX5rlqJ_MemH7UwYN6aNZ4Tu\r\nX-Yahoo-Profile: joel278\r\n\r\n\n\nColin,\n\nSometimes our view of evolution is colored by our often unquestio=\r\nned assumption that greater complexity is a good or necessary thing. Instea=\r\nd, generally biological fitness decreases with greater complexity. A vanill=\r\na single-celled organism is more optimal in some reproductive sense than a =\r\nhuman being. Although we have the ability to think and plan, cockroaches ar=\r\ne more robust.\n\nIf biological fitness really is an objective in the sense o=\r\nf how we think of it within EC (i.e. something to be maximized), then why a=\r\nre incredibly sub-optimal solutions like humans explored? \n\nThat is, in ter=\r\nms of maximizing reproduction, bacteria are much better; we are incredibly =\r\ninefficient, taking decades and trillions of cells to replicate our DNA one=\r\n generation further. Most of the complexity (i.e. more cells, longer more c=\r\nomplex life cycles) that we appreciate in nature is deleterious to replicat=\r\nion rate and thus deleterious to this supposed objective. \n\nSo I don&#39;t thin=\r\nk that the complexity of Earth is the element missing from EC models keepin=\r\ng them from discovering a ceaseless fountain of interesting things. It is n=\r\not only that there are many different possible strategies on Earth to survi=\r\nve-and-reproduce that is critical, but that reproduction is not strictly op=\r\ntimized -- if it were, then natural evolution would probably converge like =\r\nwe see in EC. The issue runs deeper than the fact that sometimes deleteriou=\r\ns mutations in natural evolution still get a chance; we are vastly inferior=\r\n at replicating when compared to bacteria and yet are successful within our=\r\n own niche.\n\nA potential thought experiment is to imagine the optimal repli=\r\ncating single-celled organism; it would not be incredibly interesting, but =\r\nwould be &#39;the objective&#39; if maximizing reproduction was truly what evolutio=\r\nn is about. But this isn&#39;t what we find interesting about natural evolution=\r\n.\n\nI think this thought experiment demonstrates some kind of profound diffe=\r\nrence between typical EC approaches and natural evolution. The convergent n=\r\nature of EC contrasts sharply with the divergent nature of natural evolutio=\r\nn. But this convergence is not due to the greater domain complexity of Eart=\r\nh that natural evolution exploits, but a certain openness of the search pro=\r\ncess in nature to different types of solutions regardless of their global o=\r\nptimality. In EC we globally maximize fitness while the most interesting pr=\r\noducts of natural evolution do not.\n\nA different view of evolution might be=\r\n that fitness is encouraged relative to the niche an organism inhabits, but=\r\n the absolute value of fitness is not what is &#39;interesting&#39; about the artif=\r\nacts evolution discovers as much as they just do pretty good within the con=\r\ntext of that niche. Whatever can reproduce does; different niches, even if =\r\nthey are suboptimal when compared to other niches, still accumulate. Howeve=\r\nr, in EC, all individuals are generally judged on the same scale of fitness=\r\n regardless of what strategy they take. I think this is an important differ=\r\nence.\n\nI do agree that the kinds of objectives used in EC are generally nar=\r\nrowly defined and do not offer much room for alternative strategies, which =\r\nis a problem. But this problem may be merely a symptom of the reigning abst=\r\nraction of natural evolution within EC, that of evolution as an optimizer. =\r\nThat is, nearly any objective will just lead to convergence if the reward s=\r\ncheme is strictly optimizing that objective. For example, even in a simple =\r\npole-balancing domain, there are likely different incredibly complex and in=\r\nefficient ways of balancing that pole -- these might be analogous to &#39;human=\r\n-beings&#39; within that domain, but we would never find them by looking for an=\r\n efficient pole balancer; instead we might look for many different interest=\r\ning (but not necessarily optimal) ways of balancing a pole.\n\nJoel\n\n--- In n=\r\neat@yahoogroups.com, Colin Green &lt;colin.green1@...&gt; wrote:\n&gt;\n&gt; Hi Ken,\n&gt; \n&gt;=\r\n \n&gt; On 4 April 2011 21:40, Ken &lt;kstanley@...&gt; wrote:\n&gt; &gt;\n&gt; &gt; Colin, I wante=\r\nd to branch my response to you to a new thread because I want to focus\n&gt; &gt; =\r\non the idea that &quot;survive and reproduce&quot; is an objective. This is not reall=\r\ny an argument\n&gt; &gt; with anything you said, but mainly a commentary on the me=\r\naning of &quot;objective&quot; that I\n&gt; &gt; think draws a useful distinction.\n&gt; \n&gt; I&#39;m =\r\nnot sure I agree with the spirit of your argument but it&#39;s just a\n&gt; gut fee=\r\nling at this point so I&#39;ll have a go at clarifying my thoughts\n&gt; a bit furt=\r\nher and maybe I can home in a bit more on where I&#39;m\n&gt; disagreeing (if at al=\r\nl).\n&gt; \n&gt; By &#39;survive&#39; I mean - execute some strategy that results in surviv=\r\nal.\n&gt; So find food and shelter, avoid danger, etc. Good survival strategy\n&gt;=\r\n for the domain =3D&gt; good chance of surviving, bad strategy =3D&gt; lower\n&gt; ch=\r\nance.\n&gt; \n&gt; In an EA that survival *strategy* is &#39;do well on the fitness met=\r\nric&#39;\n&gt; (aka objective) - because the only way to survive is to get selected=\r\n\n&gt; by the EA&#39;s selection criteria. So I think we can clarify the argument\n&gt;=\r\n by drawing a distinction between surviving/reproducing and\n&gt; /strategies/ =\r\nthat lead to surviving and reproducing. I think perhaps\n&gt; we (or I) have co=\r\nnflated the two. Survive/reproduce is the high level\n&gt; [implicit] objective=\r\n that is always present, and survival /strategy/\n&gt; is what we normally refe=\r\nr to as objective or goal in EC.\n&gt; \n&gt; So far there&#39;s no distinction between=\r\n nature/biology and EC. To my\n&gt; mind nature has found complex /strategies/ =\r\nfor survival because:\n&gt; \n&gt; A) Vastly more computational resource (or equiva=\r\nlent) [per unit time].\n&gt; B) Vastly more time.\n&gt; C) Vastly more complex doma=\r\nin.\n&gt; \n&gt; It&#39;s this latter point that I feel has tended to be overlooked. If=\r\n you\n&gt; consider every living thing alive today and trace back through all o=\r\nf\n&gt; their ancestors, then every single one of those zillions of organisms\n&gt;=\r\n executed a successful strategy that lead to survival. Considerably\n&gt; more =\r\norganisms not on that family tree didn&#39;t survive - so the natural\n&gt; world d=\r\noes try out unsuccessful strategies, but only for one\n&gt; generation at a tim=\r\ne, it doesn&#39;t create offspring with variations on\n&gt; those poor strategies i=\r\nn the hope of finding something better. What\n&gt; does happen though is that s=\r\ntragies are so complex (for creatures with\n&gt; large brains anyway) that they=\r\n can incorporate successful parts (find\n&gt; food) and yet waste much time on =\r\npoor sub-strategies (effectively\n&gt; stragey efficiency). Evolution will sele=\r\nct for efficiency but unlike\n&gt; survival it&#39;s not a binary yes/no thing, it&#39;=\r\ns more probabilistic, so\n&gt; more like the small low scoring species in NEAT =\r\n(from fitness\n&gt; sharing).\n&gt; \n&gt; It&#39;s perhaps those poor side strategies that=\r\n fit your idea of\n&gt; searching with no objective, they piggy back on for the=\r\n ride and very\n&gt; occasionally become useful. Where EC tends to fall short I=\r\nMO is that\n&gt; the domain complexity is vastly lower than the natural world s=\r\no\n&gt; there&#39;s less opportunty for exploring variations in strategy -\n&gt; branch=\r\ning off into multiple successful branches and sub-branches\n&gt; without a majo=\r\nr loss in fitness on the objective. Put another way, the\n&gt; natural world&#39;s =\r\nfitness landscape is dominated by smooth undulations\n&gt; in all dimensions, w=\r\nhereas EC objectives tend to have a few\n&gt; sharp/steep local maxima.\n&gt; \n&gt; Na=\r\nture also provides a gentle selection pressure towards complex\n&gt; strategies=\r\n by providing resources that require increasingly complex\n&gt; strategies to r=\r\neach - you can&#39;t eat those land plants until you evolve\n&gt; legs ang lungs. A=\r\nnd you can&#39;t eat those omnivores without evolving\n&gt; good eyes and fast/stro=\r\nng muscles, etc. but the plants and meat were\n&gt; there as an untapped resour=\r\nce until that first legged creature and\n&gt; first carnivore came along. So we=\r\n can see now that framing the\n&gt; survival as being an objective that&#39;s been =\r\nachieved on day one misses\n&gt; a lot of the key dynamics that drive evolution=\r\n. Surviving is the high\n&gt; level implicit objective, some species have not m=\r\noved on from floating\n&gt; in the sea eatign CO2 and sunlight, but other strat=\r\negies were evolved\n&gt; to tap into new previously untapped resources - and th=\r\nat climb from\n&gt; simple to complex resources utilisation continues to this d=\r\nay.\n&gt; \n&gt; Colin.\n&gt;\n\n\n\n"}}