{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[{"name":"READ"}]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"userId":130984297,"authorName":"joel278","from":"&quot;joel278&quot; &lt;lehman.154@...&gt;","profile":"joel278","replyTo":"LIST","senderId":"uSjWzUBAe6svTjFsHrSonvANmOoNUYhRrB7DO2d1Z5TnhUO17As7otspv_mFOPS7m8z5TLAV6vwyU3fXOYcbZ7R3D_-4","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: &quot;Survive and Reproduce&quot; as an Objective","postDate":"1302318396","msgId":5535,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGlub2lmcytoZTVoQGVHcm91cHMuY29tPg==","inReplyToHeader":"PEJBTkxrVGk9NU9Nc2J1Q2hkVURDMGkwTXVzX09FLTgwOHVRQG1haWwuZ21haWwuY29tPg=="},"prevInTopic":5534,"nextInTopic":5536,"prevInTime":5534,"nextInTime":5536,"topicId":5507,"numMessagesInTopic":25,"msgSnippet":"Hi John, ... I agree that a population within a new niche tends to grow exponentially until at some point the niche becomes saturated and competition within","rawEmail":"Return-Path: &lt;lehman.154@...&gt;\r\nX-Sender: lehman.154@...\r\nX-Apparently-To: neat@yahoogroups.com\r\nX-Received: (qmail 8545 invoked from network); 9 Apr 2011 03:06:39 -0000\r\nX-Received: from unknown (66.196.94.105)\n  by m16.grp.re1.yahoo.com with QMQP; 9 Apr 2011 03:06:39 -0000\r\nX-Received: from unknown (HELO n41b.bullet.mail.sp1.yahoo.com) (66.163.168.155)\n  by mta1.grp.re1.yahoo.com with SMTP; 9 Apr 2011 03:06:38 -0000\r\nX-Received: from [69.147.65.174] by n41.bullet.mail.sp1.yahoo.com with NNFMP; 09 Apr 2011 03:06:38 -0000\r\nX-Received: from [98.137.35.12] by t12.bullet.mail.sp1.yahoo.com with NNFMP; 09 Apr 2011 03:06:38 -0000\r\nDate: Sat, 09 Apr 2011 03:06:36 -0000\r\nTo: neat@yahoogroups.com\r\nMessage-ID: &lt;inoifs+he5h@...&gt;\r\nIn-Reply-To: &lt;BANLkTi=5OMsbuChdUDC0i0Mus_OE-808uQ@...&gt;\r\nUser-Agent: eGroups-EW/0.82\r\nMIME-Version: 1.0\r\nContent-Type: text/plain; charset=&quot;ISO-8859-1&quot;\r\nContent-Transfer-Encoding: quoted-printable\r\nX-Mailer: Yahoo Groups Message Poster\r\nX-Yahoo-Newman-Property: groups-compose\r\nFrom: &quot;joel278&quot; &lt;lehman.154@...&gt;\r\nSubject: Re: &quot;Survive and Reproduce&quot; as an Objective\r\nX-Yahoo-Group-Post: member; u=130984297; y=E0YprY-0V-Sxv_yOzT30sw22iTKwmItj14WAHAth2kx2P9uOD2cg\r\nX-Yahoo-Profile: joel278\r\n\r\nHi John,\n\n&gt; Actually, you (perhaps) are missing something.  Resource Constr=\r\naint.  You\n&gt; can only have so many organisms in a particular location.  Pop=\r\nulation\n&gt; density plays a role in biological evolution, indirectly, because=\r\n of its\n&gt; role in survival.  An organism who evolves to occupy a different =\r\nniche lives\n&gt; to pass on its genes.\n&gt; \n\nI agree that a population within a =\r\nnew niche tends to grow exponentially until at some point the niche becomes=\r\n saturated and competition within the niche grows more intense. However, I =\r\ndon&#39;t think this hurts the argument that there may exist some optimal repli=\r\ncator or class of replicators (say bacteria), or refutes the fact that blue=\r\n whales are far more inefficient replicators than bacteria. \n\nEven if resou=\r\nrces were infinite and there was no density-dependent selection, it is stil=\r\nl true that an organism that evolves to occupy a different niche will still=\r\n live to pass on its genes. That is, founding new niches is not directly ca=\r\nused by densisty-dependence or escaping competition; it would still happen =\r\nregardless as long as the new niche was a viable way of life. \n\nThere are m=\r\nany elements of natural evolution, and one of our challenges in EC is to di=\r\nstill the essential elements of natural evolution that lead to interesting =\r\nopen-ended complexity growth from those elements that are merely incidental=\r\n. By doing so we can achieve a deeper understanding of why natural evolutio=\r\nn works and perhaps bend evolution to create massively complex artifacts in=\r\n domains other than Earth.\n\nSo, modelling various aspects of the real world=\r\n, such as geographic density of various organisms and resource constraints,=\r\n may be essential features of creative evolution, or alternatively they cou=\r\nld merely be incidental -- something present in nature, but not necessary f=\r\nor creating algorithmic explosions of complexity in the spirit of natural e=\r\nvolution.  \n\nAlso, it may be possible to abstract such aspects at higher le=\r\nvels, which also may lead to a deeper understanding; that is, we can implem=\r\nent some cheat that has a similar effect though it is not exactly what natu=\r\nre did. For example, though different than the embodied geographical densit=\r\ny-dependent selection present in nature, novelty search employs density-bas=\r\ned selection in an abstract space of behaviors. Of course, this particular =\r\nabstraction may be insufficient, and other better abstractions may exist. T=\r\nhe important thing is to question the necessity or deeper meaning of the va=\r\nrious aspects of natural evolution to obtain a concise understanding of *wh=\r\ny* nature is able to do such amazing things.\n\n&gt; &gt; It is also interesting to=\r\n consider whether environmental complexity, like\n&gt; &gt; Earth&#39;s richness, is a=\r\n requirement for creating an open-ended complexifying\n&gt; &gt; evolutionary syst=\r\nem.\n&gt; &gt;\n&gt; Maybe.  Of course, using a fractal to approximate that complexity=\r\n might be a\n&gt; good, cheap alternative.  How to translate a fractal into an =\r\nenvironment is\n&gt; something for the imagination...\n&gt; \n\nI agree that there ar=\r\ne many different systems that though simple in implementation or in rules h=\r\nave disproportionate depth. An interesting challenge is to find how to expl=\r\noit such systems as domains for open-ended evolution.\n\n&gt; \n&gt; There was a bun=\r\nch of research done recently about the economies of scale and\n&gt; how that re=\r\nlates to biological organisms, and to cities and their size and\n&gt; structure=\r\n.  There is a definitive advantage to being a member cell of a\n&gt; multi-cell=\r\nular organism, just like there is an advantage to being a member\n&gt; of socie=\r\nty rather than having to grow your own food, make your own clothes,\n&gt; be yo=\r\nur own doctor, etc.  Being a lone single-celled organism is not\n&gt; necessari=\r\nly optimal in all cases.\n&gt; \n\nCertainly a lone single-celled organism would =\r\nnot fare well in a niche requiring human-level intelligence, because such a=\r\n niche does benefit from multi-cellularity, having a brain, etc. However, u=\r\ns multi-cellular organisms, by virtue of having to make multiple cells, are=\r\n less efficient replicators, which is the biological benchmark test. It tak=\r\nes more time and resources to duplicate more cells. The route humans take t=\r\no replicate once is incredibly circuitous compared to the direct route take=\r\nn by bacteria, but is a viable route because we do tend on average to repro=\r\nduce at least once.\n\nThe argument is not that single-celled organisms can d=\r\no everything that a human can do better, just that bacteria are *quantative=\r\nly* better at the one measure central to evolution (and which is traditiona=\r\nlly abstracted as a fitness function in EC): How well do you replicate (mee=\r\nt the objective)?\n\nBecause the interesting things natural evolution discove=\r\nrs do not necessarily score optimally high on this metric, it seems like ho=\r\nw we abstract fitness in EC (as objectives) is much different from the role=\r\n fitness plays in natural evolution. While in EC we typically search for so=\r\nmething in particular, or only look at the maximum fitness individuals, in =\r\nnature what is most interesting is the proliferation of different ways of l=\r\nife, most of which are orders of magnitude less efficient when measured by =\r\n&quot;the fitness function&quot; than the simplest bacteria. \n\nTraditional EAs conver=\r\nge and natural evolution diverges; the drive to diversity is such a fundame=\r\nntal part of natural evolution that it seems strange that our algorithms ne=\r\narly always have the opposite property. This dissonance suggests there may =\r\nbe something fundamentally wrong with the dominant computational abstractio=\r\nn of natural evolution.\n\n&gt; -- \n&gt; John Arrowwood\n&gt; --\n&gt; http://www.irie-inc.=\r\ncom/\n&gt; http://www.FindingResonance.com/\n&gt;\n\n\n\n"}}