{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[{"name":"READ"}]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"userId":197999825,"authorName":"John Arrowwood","from":"John Arrowwood &lt;jarrowwx@...&gt;","profile":"jarrowwx","replyTo":"LIST","senderId":"tJuo4qXCHgqRiAZbR8NIV9RJTD0ymZO07jmDgBCQCh1ODoh9N0ttHy-1BxXtkorOMt57WQChVTAj2ASS0TBcJCMK2HkP5pDUrTE","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [neat] Re: &quot;Survive and Reproduce&quot; as an Objective","postDate":"1302359872","msgId":5537,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEJBTkxrVGk9eWIrNnFONUQrdmY2UkFqaU1ycEVNK21rd0FBQG1haWwuZ21haWwuY29tPg==","inReplyToHeader":"PGlub2lmcytoZTVoQGVHcm91cHMuY29tPg==","referencesHeader":"PEJBTkxrVGk9NU9Nc2J1Q2hkVURDMGkwTXVzX09FLTgwOHVRQG1haWwuZ21haWwuY29tPiA8aW5vaWZzK2hlNWhAZUdyb3Vwcy5jb20+"},"prevInTopic":5536,"nextInTopic":5538,"prevInTime":5536,"nextInTime":5538,"topicId":5507,"numMessagesInTopic":25,"msgSnippet":"... That may depend on how you look at it.  If you think of it as an organism, maybe.  If you think of it like a city, that is another situation all together.","rawEmail":"Return-Path: &lt;jarrowwx@...&gt;\r\nX-Sender: jarrowwx@...\r\nX-Apparently-To: neat@yahoogroups.com\r\nX-Received: (qmail 26978 invoked from network); 9 Apr 2011 14:38:13 -0000\r\nX-Received: from unknown (98.137.34.44)\n  by m7.grp.sp2.yahoo.com with QMQP; 9 Apr 2011 14:38:13 -0000\r\nX-Received: from unknown (HELO mail-qy0-f180.google.com) (209.85.216.180)\n  by mta1.grp.sp2.yahoo.com with SMTP; 9 Apr 2011 14:38:12 -0000\r\nX-Received: by qyk10 with SMTP id 10so3798512qyk.11\n        for &lt;neat@yahoogroups.com&gt;; Sat, 09 Apr 2011 07:38:12 -0700 (PDT)\r\nX-Received: by 10.229.102.92 with SMTP id f28mr2782677qco.124.1302359892306;\n Sat, 09 Apr 2011 07:38:12 -0700 (PDT)\r\nMIME-Version: 1.0\r\nX-Received: by 10.229.236.131 with HTTP; Sat, 9 Apr 2011 07:37:52 -0700 (PDT)\r\nIn-Reply-To: &lt;inoifs+he5h@...&gt;\r\nReferences: &lt;BANLkTi=5OMsbuChdUDC0i0Mus_OE-808uQ@...&gt; &lt;inoifs+he5h@...&gt;\r\nDate: Sat, 9 Apr 2011 10:37:52 -0400\r\nX-Google-Sender-Auth: Vva9tsxRD4yhLKs8TiN8MGy9jPc\r\nMessage-ID: &lt;BANLkTi=yb+6qN5D+vf6RAjiMrpEM+mkwAA@...&gt;\r\nTo: neat@yahoogroups.com\r\nCc: joel278 &lt;lehman.154@...&gt;\r\nContent-Type: multipart/alternative; boundary=002354470f08c0324a04a07d4ab9\r\nX-eGroups-Msg-Info: 1:12:0:0:0\r\nX-eGroups-From: John Arrowwood &lt;John@...&gt;\r\nFrom: John Arrowwood &lt;jarrowwx@...&gt;\r\nSubject: Re: [neat] Re: &quot;Survive and Reproduce&quot; as an Objective\r\nX-Yahoo-Group-Post: member; u=197999825; y=K1qPIjkRcmckAZ9x34ALFb_DJJWkM7_NjGy8ycN8VtP789M\r\nX-Yahoo-Profile: jarrowwx\r\n\r\n\r\n--002354470f08c0324a04a07d4ab9\r\nContent-Type: text/plain; charset=ISO-8859-1\r\n\r\nOn Fri, Apr 8, 2011 at 11:06 PM, joel278 &lt;lehman.154@...&gt; wrote:\n\n&gt;\n&gt;\n&gt; Hi John,\n&gt;\n&gt;\n&gt; &gt; Actually, you (perhaps) are missing something. Resource Constraint. You\n&gt; &gt; can only have so many organisms in a particular location. Population\n&gt; &gt; density plays a role in biological evolution, indirectly, because of its\n&gt; &gt; role in survival. An organism who evolves to occupy a different niche\n&gt; lives\n&gt; &gt; to pass on its genes.\n&gt; &gt;\n&gt;\n&gt; I agree that a population within a new niche tends to grow exponentially\n&gt; until at some point the niche becomes saturated and competition within the\n&gt; niche grows more intense. However, I don&#39;t think this hurts the argument\n&gt; that there may exist some optimal replicator or class of replicators (say\n&gt; bacteria), or refutes the fact that blue whales are far more inefficient\n&gt; replicators than bacteria.\n&gt;\n\nThat may depend on how you look at it.  If you think of it as an organism,\nmaybe.  If you think of it like a city, that is another situation all\ntogether.  Think of how the organism as a whole serves as a haven for many\nspecialized cells.  It creates an environment that allows the individual\ncells to thrive in an optimal environment for an extended lifetime.  The\norganism as a whole manages to withstand environmental changes far better\nthan a single-celled organism can.\n\nAnd since change is constant (tides, days, seasons, and various other\ncatastrophic periodic upheavals) on this planet, an organism that can\nsurvive those changes has an advantage.\n\nThe point to be made is, measuring only raw ability to pass on one&#39;s genes\nto the next generation during a small period of time, without regards for\nwhat is going to happen tomorrow is not a fair assessment of the reality of\nthe way biological life is evaluated.  One unexpected frost can devastate a\npopulation of single-celled organisms that can&#39;t withstand being frozen.\n\nEven if resources were infinite and there was no density-dependent\n&gt; selection, it is still true that an organism that evolves to occupy a\n&gt; different niche will still live to pass on its genes. That is, founding new\n&gt; niches is not directly caused by densisty-dependence or escaping\n&gt; competition; it would still happen regardless as long as the new niche was a\n&gt; viable way of life.\n&gt;\n\nIn theory, yes.  In practice, it provides an impetus, making it more likely.\n\n There are many elements of natural evolution, and one of our challenges in\n&gt; EC is to distill the essential elements of natural evolution that lead to\n&gt; interesting open-ended complexity growth from those elements that are merely\n&gt; incidental. By doing so we can achieve a deeper understanding of why natural\n&gt; evolution works and perhaps bend evolution to create massively complex\n&gt; artifacts in domains other than Earth.\n&gt;\n\nAgreed.\n\n\n&gt;  So, modelling various aspects of the real world, such as geographic\n&gt; density of various organisms and resource constraints, may be essential\n&gt; features of creative evolution, or alternatively they could merely be\n&gt; incidental -- something present in nature, but not necessary for creating\n&gt; algorithmic explosions of complexity in the spirit of natural evolution.\n&gt;\n\nI remember reading that the best models ever created for modeling traffic\nflow ended up being a model of individual agents, each following a routine,\nobeying rules, being as optimal as it knows how.  The combined behavior ends\nup being fairly accurate at modeling the behavior of the real world.\nImagine that!  How much time did they waste trying to model it any other\nway?  You would think that it would have been self-evident that modeling it\nthe way it really is would give the best results.\n\nThere is actually more to biological evolution than mere chance mutations.\nThere is also the &quot;expression&quot; and &quot;suppression&quot; of genes, and a means of\nturning them on and off even during a single lifetime, giving an individual\norganism a greater adaptability.  There are a host of mechanisms at work\nthat play into the expression of those genes.  There is the mechanistic\nrelationship between the structure of the encoding and the way they unfold.\nTo make a long story short, there is more to it than we typically encode in\na simulation, including aspects that are responsible for biological success\nrates that we can not duplicate in our simulations.\n\nIf the goal is to duplicate nature&#39;s success rates, without necessarily\nduplicating natures methods, we should probably seek to better understand\nthe relationship between the problem and the solution.  I put forth that DNA\nis not just an arbitrary string of letters that have no bearing on reality.\nThat when there is no physical, biological impetus to evolve, there is very\nlittle biological evolution.  That when there is a strong need, evolution\nkicks into overdrive.  That the percentage of &quot;successful&quot; or at least\nbiologically viable mutations is way too high to be attributable to random\nchance.  That there must be a mechanism at work there that we have not\nidentified yet.  That when we understand those principles, we can probably\nemploy them in a simulation that bears very little resemblance to the real\nworld, and still achieve open-ended and highly sophisticated evolved\nsolutions.  But we won&#39;t get there by randomness by itself.\n\n&gt;\n&gt; The argument is not that single-celled organisms can do everything that a\n&gt; human can do better, just that bacteria are *quantatively* better at the one\n&gt; measure central to evolution (and which is traditionally abstracted as a\n&gt; fitness function in EC): How well do you replicate (meet the objective)?\n&gt;\n\nMaybe you make Ken&#39;s point by saying that.  Maybe in classic E.C., we are\nnotoriously bad at choosing an appropriate fitness function?\n\nAnd you make my point, as well:  That is not the only &quot;fitness&quot; function\nthat Life uses.\n\n\n&gt; Traditional EAs converge and natural evolution diverges; the drive to\n&gt; diversity is such a fundamental part of natural evolution that it seems\n&gt; strange that our algorithms nearly always have the opposite property. This\n&gt; dissonance suggests there may be something fundamentally wrong with the\n&gt; dominant computational abstraction of natural evolution.\n&gt;\n\nWell stated!\n\n-- \nJohn Arrowwood\n--\nhttp://www.irie-inc.com/\nhttp://www.FindingResonance.com/\n\r\n--002354470f08c0324a04a07d4ab9\r\nContent-Type: text/html; charset=ISO-8859-1\r\nContent-Transfer-Encoding: quoted-printable\r\n\r\n&lt;div class=3D&quot;gmail_quote&quot;&gt;On Fri, Apr 8, 2011 at 11:06 PM, joel278 &lt;span d=\r\nir=3D&quot;ltr&quot;&gt;&lt;&lt;a href=3D&quot;mailto:lehman.154@...&quot;&gt;lehman.154@...&lt;/a&gt;=\r\n&gt;&lt;/span&gt; wrote:&lt;br&gt;&lt;blockquote class=3D&quot;gmail_quote&quot; style=3D&quot;margin: 0p=\r\nt 0pt 0pt 0.8ex; border-left: 1px solid rgb(204, 204, 204); padding-left: 1=\r\nex;&quot;&gt;\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n&lt;div style=3D&quot;background-color: rgb(255, 255, 255);&quot;&gt;\n=\r\n&lt;span&gt;=A0&lt;/span&gt;\n\n\n&lt;div&gt;\n  &lt;div&gt;\n\n\n    &lt;div&gt;\n      \n      \n      &lt;p&gt;Hi John=\r\n,&lt;/p&gt;&lt;div class=3D&quot;im&quot;&gt;&lt;br&gt;\n&lt;br&gt;\n&gt; Actually, you (perhaps) are missing s=\r\nomething.  Resource Constraint.  You&lt;br&gt;\n&gt; can only have so many organis=\r\nms in a particular location.  Population&lt;br&gt;\n&gt; density plays a role in b=\r\niological evolution, indirectly, because of its&lt;br&gt;\n&gt; role in survival. =\r\n An organism who evolves to occupy a different niche lives&lt;br&gt;\n&gt; to pass=\r\n on its genes.&lt;br&gt;\n&gt; &lt;br&gt;\n&lt;br&gt;&lt;/div&gt;\nI agree that a population within a =\r\nnew niche tends to grow exponentially until at some point the niche becomes=\r\n saturated and competition within the niche grows more intense. However, I =\r\ndon&#39;t think this hurts the argument that there may exist some optimal r=\r\neplicator or class of replicators (say bacteria), or refutes the fact that =\r\nblue whales are far more inefficient replicators than bacteria. &lt;br&gt;\n\n&lt;/div=\r\n&gt;&lt;/div&gt;&lt;/div&gt;&lt;/div&gt;&lt;/blockquote&gt;&lt;div&gt;&lt;br&gt;That may depend on how you look at=\r\n it.=A0 If you think of it as an organism, maybe.=A0 If you think of it lik=\r\ne a city, that is another situation all together.=A0 Think of how the organ=\r\nism as a whole serves as a haven for many specialized cells.=A0 It creates =\r\nan environment that allows the individual cells to thrive in an optimal env=\r\nironment for an extended lifetime.=A0 The organism as a whole manages to wi=\r\nthstand environmental changes far better than a single-celled organism can.=\r\n&lt;br&gt;\n\n&lt;br&gt;And since change is constant (tides, days, seasons, and various o=\r\nther catastrophic periodic upheavals) on this planet, an organism that can =\r\nsurvive those changes has an advantage.&lt;br&gt;&lt;br&gt;The point to be made is, mea=\r\nsuring only raw ability to pass on one&#39;s genes to the next generation d=\r\nuring a small period of time, without regards for what is going to happen t=\r\nomorrow is not a fair assessment of the reality of the way biological life =\r\nis evaluated.=A0 One unexpected frost can devastate a population of single-=\r\ncelled organisms that can&#39;t withstand being frozen.&lt;br&gt;\n\n&lt;br&gt;&lt;/div&gt;&lt;blo=\r\nckquote class=3D&quot;gmail_quote&quot; style=3D&quot;margin: 0pt 0pt 0pt 0.8ex; border-le=\r\nft: 1px solid rgb(204, 204, 204); padding-left: 1ex;&quot;&gt;&lt;div style=3D&quot;backgro=\r\nund-color: rgb(255, 255, 255);&quot;&gt;&lt;div&gt;&lt;div&gt;&lt;div&gt;\nEven if resources were infi=\r\nnite and there was no density-dependent selection, it is still true that an=\r\n organism that evolves to occupy a different niche will still live to pass =\r\non its genes. That is, founding new niches is not directly caused by densis=\r\nty-dependence or escaping competition; it would still happen regardless as =\r\nlong as the new niche was a viable way of life. &lt;br&gt;\n\n&lt;/div&gt;&lt;/div&gt;&lt;/div&gt;&lt;/d=\r\niv&gt;&lt;/blockquote&gt;&lt;div&gt;&lt;br&gt;In theory, yes.=A0 In practice, it provides an imp=\r\netus, making it more likely.&lt;br&gt;&lt;br&gt;&lt;/div&gt;&lt;blockquote class=3D&quot;gmail_quote&quot;=\r\n style=3D&quot;margin: 0pt 0pt 0pt 0.8ex; border-left: 1px solid rgb(204, 204, 2=\r\n04); padding-left: 1ex;&quot;&gt;\n\n&lt;div style=3D&quot;background-color: rgb(255, 255, 25=\r\n5);&quot;&gt;&lt;div&gt;&lt;div&gt;&lt;div&gt;\n\nThere are many elements of natural evolution, and one=\r\n of our challenges in EC is to distill the essential elements of natural ev=\r\nolution that lead to interesting open-ended complexity growth from those el=\r\nements that are merely incidental. By doing so we can achieve a deeper unde=\r\nrstanding of why natural evolution works and perhaps bend evolution to crea=\r\nte massively complex artifacts in domains other than Earth.&lt;br&gt;\n\n&lt;/div&gt;&lt;/di=\r\nv&gt;&lt;/div&gt;&lt;/div&gt;&lt;/blockquote&gt;&lt;div&gt;&lt;br&gt;Agreed.&lt;br&gt;=A0&lt;/div&gt;&lt;blockquote class=\r\n=3D&quot;gmail_quote&quot; style=3D&quot;margin: 0pt 0pt 0pt 0.8ex; border-left: 1px solid=\r\n rgb(204, 204, 204); padding-left: 1ex;&quot;&gt;&lt;div style=3D&quot;background-color: rg=\r\nb(255, 255, 255);&quot;&gt;\n\n&lt;div&gt;&lt;div&gt;&lt;div&gt;\n\nSo, modelling various aspects of the =\r\nreal world, such as geographic density of various organisms and resource co=\r\nnstraints, may be essential features of creative evolution, or alternativel=\r\ny they could merely be incidental -- something present in nature, but not n=\r\necessary for creating algorithmic explosions of complexity in the spirit of=\r\n natural evolution.  &lt;br&gt;\n\n&lt;/div&gt;&lt;/div&gt;&lt;/div&gt;&lt;/div&gt;&lt;/blockquote&gt;&lt;div&gt;&lt;br&gt;I =\r\nremember reading that the best models ever created for modeling traffic flo=\r\nw ended up being a model of individual agents, each following a routine, ob=\r\neying rules, being as optimal as it knows how.=A0 The combined behavior end=\r\ns up being fairly accurate at modeling the behavior of the real world.=A0 I=\r\nmagine that!=A0 How much time did they waste trying to model it any other w=\r\nay?=A0 You would think that it would have been self-evident that modeling i=\r\nt the way it really is would give the best results.&lt;br&gt;\n\n&lt;br&gt;There is actua=\r\nlly more to biological evolution than mere chance mutations.=A0 There is al=\r\nso the &quot;expression&quot; and &quot;suppression&quot; of genes, and a m=\r\neans of turning them on and off even during a single lifetime, giving an in=\r\ndividual organism a greater adaptability.=A0 There are a host of mechanisms=\r\n at work that play into the expression of those genes.=A0 There is the mech=\r\nanistic relationship between the structure of the encoding and the way they=\r\n unfold.=A0 To make a long story short, there is more to it than we typical=\r\nly encode in a simulation, including aspects that are responsible for biolo=\r\ngical success rates that we can not duplicate in our simulations.=A0 &lt;br&gt;\n\n=\r\n&lt;br&gt;If the goal is to duplicate nature&#39;s success rates, without necessa=\r\nrily duplicating natures methods, we should probably seek to better underst=\r\nand the relationship between the problem and the solution.=A0 I put forth t=\r\nhat DNA is not just an arbitrary string of letters that have no bearing on =\r\nreality.=A0 That when there is no physical, biological impetus to evolve, t=\r\nhere is very little biological evolution.=A0 That when there is a strong ne=\r\ned, evolution kicks into overdrive.=A0 That the percentage of &quot;success=\r\nful&quot; or at least biologically viable mutations is way too high to be a=\r\nttributable to random chance.=A0 That there must be a mechanism at work the=\r\nre that we have not identified yet.=A0 That when we understand those princi=\r\nples, we can probably employ them in a simulation that bears very little re=\r\nsemblance to the real world, and still achieve open-ended and highly sophis=\r\nticated evolved solutions.=A0 But we won&#39;t get there by randomness by i=\r\ntself.&lt;br&gt;\n\n&lt;/div&gt;&lt;blockquote class=3D&quot;gmail_quote&quot; style=3D&quot;margin: 0pt 0p=\r\nt 0pt 0.8ex; border-left: 1px solid rgb(204, 204, 204); padding-left: 1ex;&quot;=\r\n&gt;&lt;div style=3D&quot;background-color: rgb(255, 255, 255);&quot;&gt;&lt;div&gt;&lt;div&gt;&lt;div&gt;&lt;br&gt;\nT=\r\nhe argument is not that single-celled organisms can do everything that a hu=\r\nman can do better, just that bacteria are *quantatively* better at the one =\r\nmeasure central to evolution (and which is traditionally abstracted as a fi=\r\ntness function in EC): How well do you replicate (meet the objective)?&lt;br&gt;\n=\r\n\n&lt;/div&gt;&lt;/div&gt;&lt;/div&gt;&lt;/div&gt;&lt;/blockquote&gt;&lt;div&gt;&lt;br&gt;Maybe you make Ken&#39;s poi=\r\nnt by saying that.=A0 Maybe in classic E.C., we are notoriously bad at choo=\r\nsing an appropriate fitness function?=A0 &lt;br&gt;&lt;br&gt;And you make my point, as =\r\nwell:=A0 That is not the only &quot;fitness&quot; function that Life uses.&lt;=\r\nbr&gt;\n\n=A0&lt;br&gt;&lt;/div&gt;&lt;blockquote class=3D&quot;gmail_quote&quot; style=3D&quot;margin: 0pt 0p=\r\nt 0pt 0.8ex; border-left: 1px solid rgb(204, 204, 204); padding-left: 1ex;&quot;=\r\n&gt;&lt;div style=3D&quot;background-color: rgb(255, 255, 255);&quot;&gt;&lt;div&gt;&lt;div&gt;&lt;div&gt;\nTradi=\r\ntional EAs converge and natural evolution diverges; the drive to diversity =\r\nis such a fundamental part of natural evolution that it seems strange that =\r\nour algorithms nearly always have the opposite property. This dissonance su=\r\nggests there may be something fundamentally wrong with the dominant computa=\r\ntional abstraction of natural evolution.&lt;/div&gt;\n\n&lt;/div&gt;&lt;/div&gt;&lt;/div&gt;&lt;/blockqu=\r\note&gt;&lt;div&gt;&lt;br&gt;Well stated!&lt;br clear=3D&quot;all&quot;&gt;&lt;/div&gt;&lt;/div&gt;&lt;br&gt;-- &lt;br&gt;John Arro=\r\nwwood&lt;br&gt;--&lt;br&gt;&lt;a href=3D&quot;http://www.irie-inc.com/&quot; target=3D&quot;_blank&quot;&gt;http:=\r\n//www.irie-inc.com/&lt;/a&gt;&lt;br&gt;&lt;a href=3D&quot;http://www.FindingResonance.com/&quot; tar=\r\nget=3D&quot;_blank&quot;&gt;http://www.FindingResonance.com/&lt;/a&gt;&lt;br&gt;\n\n\n\r\n--002354470f08c0324a04a07d4ab9--\r\n\n"}}