{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[{"name":"READ"}]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"userId":487025037,"authorName":"afcarl2","from":"&quot;afcarl2&quot; &lt;afcarl2@...&gt;","profile":"afcarl2","replyTo":"LIST","senderId":"mqdxG5rd9FelounnJW4ilg3OrPuNhnrCSGhgkum-ZnxPsK52sPFCySjDhsyIn5NkQJ1MbTdYUmPwQQZdFdyCv-YPQME","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Re : Re : [neat] Musings On Lessons Learned From BlindBuilder Applied To NEAT & Indirect Encoding","postDate":"1322001139","msgId":5709,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGphaDd0aitybTNjQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDEzMjE5OTU5ODUuMjI0NzAuWWFob29NYWlsTmVvQHdlYjI5NTEzLm1haWwuaXJkLnlhaG9vLmNvbT4="},"prevInTopic":5708,"nextInTopic":0,"prevInTime":5708,"nextInTime":5710,"topicId":5697,"numMessagesInTopic":5,"msgSnippet":"Hi, Gospel s are inherently limited sets, and as such reduce the dimensionality of the landscape. Their beneficial utility is subject to the specific","rawEmail":"Return-Path: &lt;afcarl2@...&gt;\r\nX-Sender: afcarl2@...\r\nX-Apparently-To: neat@yahoogroups.com\r\nX-Received: (qmail 94885 invoked from network); 22 Nov 2011 22:32:20 -0000\r\nX-Received: from unknown (98.137.34.46)\n  by m11.grp.sp2.yahoo.com with QMQP; 22 Nov 2011 22:32:20 -0000\r\nX-Received: from unknown (HELO n44d.bullet.mail.sp1.yahoo.com) (66.163.169.158)\n  by mta3.grp.sp2.yahoo.com with SMTP; 22 Nov 2011 22:32:20 -0000\r\nX-Received: from [69.147.65.150] by n44.bullet.mail.sp1.yahoo.com with NNFMP; 22 Nov 2011 22:32:20 -0000\r\nX-Received: from [98.137.34.51] by t7.bullet.mail.sp1.yahoo.com with NNFMP; 22 Nov 2011 22:32:20 -0000\r\nDate: Tue, 22 Nov 2011 22:32:19 -0000\r\nTo: neat@yahoogroups.com\r\nMessage-ID: &lt;jah7tj+rm3c@...&gt;\r\nIn-Reply-To: &lt;1321995985.22470.YahooMailNeo@...&gt;\r\nUser-Agent: eGroups-EW/0.82\r\nMIME-Version: 1.0\r\nContent-Type: text/plain; charset=&quot;ISO-8859-1&quot;\r\nContent-Transfer-Encoding: quoted-printable\r\nX-Mailer: Yahoo Groups Message Poster\r\nX-Yahoo-Newman-Property: groups-compose\r\nX-eGroups-Msg-Info: 1:6:0:0:0\r\nFrom: &quot;afcarl2&quot; &lt;afcarl2@...&gt;\r\nSubject: Re: Re : Re : [neat] Musings On Lessons Learned From BlindBuilder Applied To NEAT & Indirect Encoding\r\nX-Yahoo-Group-Post: member; u=487025037; y=3a4fXl4DWX-l39ZmdDAwMsEjCnbLye7L_5g_oxB5DJih9g\r\nX-Yahoo-Profile: afcarl2\r\n\r\n\n\nHi,\nGospel&#39;s are inherently limited sets, and as such reduce the &quot;dimensi=\r\nonality&quot; of the landscape. Their beneficial utility is subject to the speci=\r\nfic objective function:)\nThe adages: &quot;Crawl, walk, run&quot; and &quot;You have to ca=\r\ntch them before you can pass them&quot; seem appropriate. The ability to reasona=\r\nbly duplicate how humans do things seem a desirable goal. Which I would cha=\r\nracterize as &quot;fixed concept set and customize as required&quot;. I would submit =\r\nthat a genome comprised a fixed set of inviolate concepts interconnected w/=\r\n evolved NN formative elements, comprise just such an instance of &quot;fixed co=\r\nncept set and customize as required&quot;. I would clarify, that the word inviol=\r\nate is only used to denote partition from operator internal intervention. F=\r\nurther, I would submit that this is sufficiently general to be applicable t=\r\no direct or indirect encodings, local or otherwise applied. And any problem=\r\n could be recast as such, subject only to the definitions of the concepts. =\r\nAt the heart of the issue, is the requirement, that the dimensional operato=\r\nr disruption can not be allowed to grow exponentially with the size of the =\r\ngenome! You must find a way to prevent this, otherwise you are doomed to si=\r\nmplicity. &quot;Fixed concept set and customize as required&quot; is a viable way to =\r\nachieve this.\nAnd practically speaking, it is not that restrictive. Imagine=\r\n the possibilities:\n1) Start concepts defined as &quot;best fit individuals&quot; aft=\r\ner a limited number of generations of evolution w/o concepts (i.e. staged r=\r\necursive incorporation of &quot;best fit individuals&quot;),\n2) Concepts defined as M=\r\nVPRC (Multi-Variate Polynomial Regression/Classification) hypothesis models=\r\n on same inputs/outputs,\n3) Concepts defined as highest recurring genetic m=\r\naterial snippets,\n4) Concepts defined as instances of conventional solution=\r\ns to problem,\n5) Concepts defined as embedded human expertise,\n...to name a=\r\n few, or combinations of all of the above.\nBut none of this is possible w/o=\r\n the added flexibility of individually addressable multi-input/output nodes=\r\n (IAMION). It just appears that the implications of single input/output nod=\r\nes (SION) is unduly limiting the &quot;dimensionality&quot; of the ED landscape.\n\nAnd=\r\ny\n\n\n--- In neat@yahoogroups.com, Alexandre Devert &lt;marmakoide@...&gt; wrote:\n&gt;=\r\n\n&gt; Hi,\n&gt; \n&gt; =C2=A0 You can see a module as some sub-part of some design, wh=\r\nich is reused. That&#39;s how engineers do, because it&#39;s the most convenient wi=\r\nth the way us humans design, compute and build stuffs in general. Now look =\r\nhow ants or termites build shelters. They don&#39;t have a &quot;arch&quot; module they r=\r\nepeat ad-infinitum, in order to build a shelter. There&#39;s definitely a notio=\r\nn of &quot;arch&quot;, but it&#39;s an emergent one. The &quot;arch&quot; is defined as a purely lo=\r\ncal building process, local actions (ants or termites are more likely to ad=\r\nd materials at places meeting some particular criteria) controled by local =\r\ninformations. Same goes with structures in living creatures... In purely lo=\r\ncal building processes, the &quot;repeated with modifications&quot; structures are a =\r\nconsequence, it&#39;s something subjective that we see with our 10000 years of =\r\nhuman engineering experience. We tend to decompose things as parts, sub-par=\r\nts and so on, even if they are not really existing in the actual building p=\r\nrocess.\n&gt; \n&gt; \n&gt; Defining objects as purely local building mechanism is more=\r\n complex. It&#39;s rather alien to our engineering experience. But it also make=\r\ns you way more resilient to noise. Put noise in the building process descri=\r\nption, ok, the result is likely to be just a bit degraded. Put noise in the=\r\n environment where the building process takes place. Same thing, result mig=\r\nht be just a bit degraded or might not even change (the so-called &quot;self-rep=\r\nairing&quot; property).That&#39;s particulary relevent, if you use an evolutionary o=\r\nptimizer to optimize the description of a building process. It allows you t=\r\no have the much desired &quot;small changes of phenotype =3D&gt; small change of ge=\r\nnotype&quot; property. In the other hand, defining things as direct assemblies o=\r\nf parts is fundamentaly brittle, thus not really a good way to describe obj=\r\nects, if you want to optimize the descrition by an evolutionary optimizer. =\r\nIt&#39;s dumb builders and smart building plan (the ants, the cells, with noise=\r\n-resilient\n&gt;  plans) versus smart builders and dumb building plan (humans).=\r\n\n&gt; \n&gt; \n&gt; For those reasons, I feel that most representations using explicit=\r\n assemblies of parts are doomed, *IF* you look for scalability and have lit=\r\ntle knowledge of what is the optimal solution of your problem. Building pro=\r\ncesses working on a purely local fashion sounds, where the result is implic=\r\nit and depends on an environment, feel much more relevant to evolutionary o=\r\nptimization, at least for me.That was the ontogenic gospel ^^\n&gt; \n&gt; =C2=A0\n&gt;=\r\n Alex\n&gt; \n&gt; \n&gt; ________________________________\n&gt;  De=C2=A0: afcarl2 &lt;afcarl=\r\n2@...&gt;\n&gt; =C3=80=C2=A0: neat@yahoogroups.com \n&gt; Envoy=C3=A9 le : Mercredi 23=\r\n Novembre 2011 3h18\n&gt; Objet=C2=A0: Re: Re : [neat] Musings On Lessons Learn=\r\ned From BlindBuilder Applied To NEAT & Indirect Encoding\n&gt;  \n&gt; \n&gt; =C2=A0 \n&gt;=\r\n \n&gt; \n&gt; Hi,\n&gt; Reviewed the cited sections. Seems indirect encodings could be=\r\n viewed as a type of user-defined application-specific module. Examples of =\r\nmodule sets abound. Alphabet, Vocabulary, standardized bolts, data compress=\r\nion transfer functions... The point being, that the utility of module (or c=\r\noncept) sets, is a reduction in generic task complexity/construction plan s=\r\nize, etc. The comfort of the &quot;universal approximator&quot; characteristic, is no=\r\n more a rational for evolutionary development from scratch using exclusivel=\r\ny NN formative elements, than attempting to assemble a car starting from th=\r\ne molecular level, rather than being constrained to the utilization of stan=\r\ndardized parts & bolts. Being constrained to a fixed set of modules/concept=\r\ns, may not enable total global optimization, but often times, &quot;close-enough=\r\n&quot; is just that, close enough. Getting close enough: optimizing based upon a=\r\n fixed size set of modules/concepts, and then tailoring w/ NN formative ele=\r\nments.\n&gt;  If the vocabulary shows itself to be too limiting, add as justifi=\r\nably required. But regardless of the process of how you identify the module=\r\n/concept, those modules/concepts MUST be held inviolate within the genome, =\r\nand thus not contribute to the dimensional operator disruption. Otherwise t=\r\nhey are no longer modules/concepts, but rather effectively only &quot;suggestion=\r\ns&quot;. And their utility is lost or diminished as a consequence of their contr=\r\nibution to the overall dimensional operator disruption. In other words, the=\r\n genome needs to have the ability to be partitioned into operator and non-o=\r\nperator regions. The non-operator regions corresponding to the module/conce=\r\npt interior functionality, and the operator region corresponding to everyth=\r\ning else within the genome. Practically speaking, this requires at a minimu=\r\nm, nodes with uniquely addressable variable number inputs and outputs, with=\r\n the attendant infrastructure to handle same. Once the utility of using a\n&gt;=\r\n  given bolt has been justified, you don&#39;t keep evolving the bolt! You shoo=\r\nt the &quot;bolt engineer&quot;, and move on with the balance of the task at hand :)\n=\r\n&gt; \n&gt; Andy\n&gt; \n&gt; --- In neat@yahoogroups.com, Alexandre Devert &lt;marmakoide@&gt; =\r\nwrote:\n&gt; &gt;\n&gt; &gt; Hi,\n&gt; &gt; =C3=82=C2=A0Agree, BlindBuilder is a nice case of &quot;c=\r\nompact encoding does not means good encoding&quot;, for the reasons you mentionn=\r\ned. Modules are the way to go, *BUT*... Most of time, when we say modules, =\r\nit&#39;s some part of the genotype which is taken and grafted somewhere else, v=\r\nerbatim. This is the level 0 of modularity, it makes tons of assumptions. A=\r\nssumption that your problem is nice enough to be trivially decomposible int=\r\no subproblems solveable by subpart of genotypes. Assumption that your probl=\r\nem is nice enough to pave the road for you, miraculy making the right modul=\r\nes to appear in the right order. Yes, with an optimization which is mostly =\r\na a biased random walk... I can go on long of that, but, well, let&#39;s remove=\r\n that dust on my PhD thesis and link it here (http://www.marmakoide.org/dow=\r\nnload/publications/adevert-phd-thesis.pdf), and invite you to read from pag=\r\ne 21, section 1.3.3, to the end of Chapter 1, which is a good summary of my=\r\n views on modularity,\n&gt;  with\n&gt; &gt;  of course credit for my PhD advisors, Vi=\r\nshnu bless them ^^\n&gt; &gt; \n&gt; &gt; =C3=82=C2=A0\n&gt; &gt; Dr. Devert Alexandre\n&gt; &gt; Lectu=\r\nrer at School Of Software Engineering of USTC\n&gt; &gt; 166 Renai Road, Dushu Lak=\r\ne Higher Education Town\n&gt; &gt; Suzhou Industrial Park,\n&gt; &gt; Suzhou, Jiangsu, Pe=\r\nople Republic of China\n&gt; &gt; \n&gt; &gt; \n&gt; &gt; ________________________________\n&gt; &gt;  =\r\nDe=C3=82=C2=A0: afcarl2 &lt;afcarl2@&gt;\n&gt; &gt; =C3=83=E2=82=AC=C3=82=C2=A0: neat@ya=\r\nhoogroups.com \n&gt; &gt; Envoy=C3=83=C2=A9 le : Mardi 22 Novembre 2011 3h18\n&gt; &gt; O=\r\nbjet=C3=82=C2=A0: [neat] Musings On Lessons Learned From BlindBuilder Appli=\r\ned To NEAT & Indirect Encoding\n&gt; &gt; \n&gt; &gt; \n&gt; &gt; =C3=82=C2=A0 \n&gt; &gt; Alex,\n&gt; &gt; Yo=\r\nur prior work associated w/ BlindBuilder I believe is informative and appli=\r\ncable to possible updates to NEAT and indirect encodings in general. The gr=\r\nowing disruptive impact of construction operators as the size of the constr=\r\nuction plan increases, seemly undercuts the benefit of compact nature of th=\r\ne approach, and also illustrates a fundamental strength and weakness of NEA=\r\nT. NEAT, starting from minimal size, mitigates the disruptive nature of var=\r\nious operators at the beginning allowing for more effective use of computat=\r\nional resources for growing of the organism in a profitable portion of the =\r\ndesign space. But as organism size increases, the growing disruptive impact=\r\n of some operators, and where they are applied, increasingly bog down furth=\r\ner progress.\n&gt; &gt; In the context of BlindBuilder, two examples are useful:\n&gt;=\r\n &gt; 1) Bridge: The concept of a bridge is simple and straight forward. From =\r\na construction perspective, could be achieved with a single element of appr=\r\nopriate size and orientation. While the size of the construction plan is va=\r\nstly different based upon the characteristics of the formative elements, th=\r\nough the concept is still simple, the disruptive impact of various operator=\r\ns on form, fit, function and convergence is also vastly different.\n&gt; &gt; 2) W=\r\nall: Also, the concept of a wall is simple and straight forward. And again =\r\nfrom a construction perspective, could be achieved with a single element of=\r\n appropriate size and orientation. The same comments also apply regarding c=\r\nonstruction plan size and associated disruptive impact of construction oper=\r\nators.\n&gt; &gt; The point being, that the sensitivity of the concept should not =\r\nbe subject to the scale of the formative elements, but rather the suitabili=\r\nty of the formulation to the objectives of the concept. In the construction=\r\n context, this is more straight forward. The overall objective is composed =\r\nof a relatively few well known concepts taken together in some relative ori=\r\nentations WRT each other (i.e. a house can be composed of four orthogonal w=\r\nalls and a roof). The construction operators should be confined to refineme=\r\nnt of suitability of the formative elements and their orientations taken to=\r\ngether WRT the individual concept, guided by concept specific operator sele=\r\nction criteria (i.e. semi-separable multi-subobjectives).\n&gt; &gt; Of course, in=\r\n the general case, the identification of concepts is not as straight forwar=\r\nd. But efforts to identify reusable genetic material snippets would most li=\r\nkely qualify as identification of concepts, and would thus likely benefit f=\r\nrom: a) partitioning of the genome for application of operators, and b) app=\r\nlication of concept specific operator selection WRT concept suitability for=\r\n the current overall objective.\n&gt; &gt; \n&gt; &gt; Andy\n&gt; &gt;\n&gt;\n\n\n\n"}}