{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[{"name":"READ"}]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"userId":331172310,"authorName":"Nicolas Bredeche","from":"Nicolas Bredeche &lt;nekonaute@...&gt;","profile":"nekonaute","replyTo":"LIST","senderId":"_UKVs9ZD_oMs7QxKMnlSpog3n2_3GYAC03bykC7nFZhknCIgmlxOA74RDbIi2sgqdcPxXpiRFLLRW0RgGy53VWUeQEBmttmss_R4lw","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [neat] New Paper: Ontogeny tends to recapitulate phylogeny in digital organisms","postDate":"1349890400","msgId":5906,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PENBTGduK0p5amtkRzZlZG10S1pBYzk4VDd4OHZfSndBbW1wSmdTakxEY291RkEtYXNzd0BtYWlsLmdtYWlsLmNvbT4=","inReplyToHeader":"PDUzRjZBRjBBLTkyNkYtNEYyQi1BMzU1LUY0NEYzRTJBNUJBOUBjb3JuZWxsLmVkdT4=","referencesHeader":"PGs0bXUwbStpNmk1QGVHcm91cHMuY29tPiA8NTNGNkFGMEEtOTI2Ri00RjJCLUEzNTUtRjQ0RjNFMkE1QkE5QGNvcm5lbGwuZWR1Pg=="},"prevInTopic":5901,"nextInTopic":5908,"prevInTime":5905,"nextInTime":5907,"topicId":5888,"numMessagesInTopic":14,"msgSnippet":"Hi, I understand that this short discussion about target-based vs. non-target-based evolution may grow a bit off-topic, but I would love to take this","rawEmail":"Return-Path: &lt;nicolas.bredeche@...&gt;\r\nX-Sender: nicolas.bredeche@...\r\nX-Apparently-To: neat@yahoogroups.com\r\nX-Received: (qmail 59872 invoked from network); 10 Oct 2012 17:33:51 -0000\r\nX-Received: from unknown (98.137.35.161)\n  by m1.grp.sp2.yahoo.com with QMQP; 10 Oct 2012 17:33:51 -0000\r\nX-Received: from unknown (HELO mail-oa0-f49.google.com) (209.85.219.49)\n  by mta5.grp.sp2.yahoo.com with SMTP; 10 Oct 2012 17:33:51 -0000\r\nX-Received: by mail-oa0-f49.google.com with SMTP id l10so1128666oag.22\n        for &lt;neat@yahoogroups.com&gt;; Wed, 10 Oct 2012 10:33:51 -0700 (PDT)\r\nX-Received: by 10.182.110.40 with SMTP id hx8mr6291732obb.47.1349890430962; Wed,\n 10 Oct 2012 10:33:50 -0700 (PDT)\r\nMIME-Version: 1.0\r\nX-Received: by 10.60.9.69 with HTTP; Wed, 10 Oct 2012 10:33:20 -0700 (PDT)\r\nIn-Reply-To: &lt;53F6AF0A-926F-4F2B-A355-F44F3E2A5BA9@...&gt;\r\nReferences: &lt;k4mu0m+i6i5@...&gt; &lt;53F6AF0A-926F-4F2B-A355-F44F3E2A5BA9@...&gt;\r\nDate: Wed, 10 Oct 2012 19:33:20 +0200\r\nX-Google-Sender-Auth: EhRdPSYP9ZGJAC58aTi3-u7D33w\r\nMessage-ID: &lt;CALgn+JyjkdG6edmtKZAc98T7x8v_JwAmmpJgSjLDcouFA-assw@...&gt;\r\nTo: neat@yahoogroups.com\r\nContent-Type: multipart/alternative; boundary=f46d044516dd9f8a5104cbb7dbf6\r\nX-eGroups-Msg-Info: 1:12:0:0:0\r\nFrom: Nicolas Bredeche &lt;nekonaute@...&gt;\r\nSubject: Re: [neat] New Paper: Ontogeny tends to recapitulate phylogeny in\n digital organisms\r\nX-Yahoo-Group-Post: member; u=331172310; y=eihzOlWbIuthpDY5HCFt5xIdht0vlXZtWyVnnN70RTV4QHWU\r\nX-Yahoo-Profile: nekonaute\r\n\r\n\r\n--f46d044516dd9f8a5104cbb7dbf6\r\nContent-Type: text/plain; charset=ISO-8859-1\r\n\r\nHi,\n\nI understand that this short discussion about target-based vs.\nnon-target-based evolution may grow a bit off-topic, but I would love to\ntake this discussion a little further about the difference btw\nobjective-driven and environment-driven evolution.\n\n(...)\n\n&gt; &gt; I&#39;m also not sure whether it&#39;s really accurate to say Avida is &quot;not\n&gt; target-based.&quot; It&#39;s true that it&#39;s not as explicit as a single simple\n&gt; objective function, but the fact that there are several logical operations\n&gt; that explicitly give an advantage to organisms that execute them actually\n&gt; does create a form of objective-driven pressure. In other words, the\n&gt; creativity of evolution in Avida with such a priori human-defined rewards\n&gt; is to some extent hampered by the need to stay competitive on those\n&gt; arbitrary objectives. So I&#39;d expect it to be closer to objective search\n&gt; (when used in that mode) than non-objective search, though somewhere on the\n&gt; continuum between them. I also understand that Avida as a platform doesn&#39;t\n&gt; have to be run with those rewards, but if I understand correctly they are\n&gt; traditional and used in this particular paper as well.\n&gt; &gt;\n&gt;\n&gt; I agree with you. Avida is likely more towards non-objective search than\n&gt; target-based search, but probably not by that much. You&#39;d likely get a\n&gt; stronger argument from Charles Ofria about it being more open-ended, but\n&gt; I&#39;ve always thought that Avida (and all alife simulations) are still rather\n&gt; target-based. That&#39;s why I don&#39;t put too much stock in the argument that\n&gt; not having an explicit fitness function makes some alife simulations more\n&gt; interesting: I usually think they do have an explicit fitness function,\n&gt; it&#39;s just a complicated one that we don&#39;t understand as much as others.\n&gt;\n (...)\n\nIt seems to me that one additional property must be taken into account\nabout how the selection pressure is actually applied. On the one hand,\nselection can be implemented as an user-defined metric used to compare and\nrank individuals for selection/replacement, which is the classical way in\nEvolutionary Robotics/Algorithms (incl. novelty search, ie. an explicit\nfunction formulating an implicit objective - though of course the search\nfor novelty looks a lot like modelling the red queen). On the other hand,\nselection can result from environmental pressure as it is the case with\nTIERRA (and to less extent, to AVIDA, IMHO), where selection/replacement\ndoes not depend on a performance value to be computed.\n\nI agree with you both as AVIDA seems to stand inbetween as a performance\nmeasure is actually computed (the metabolic function) but is not directly\nused for selection/replacement. On the contraty, I always had the\nimpression that TIERRA was something more on the side of &quot;true&quot; natural\nselection, environment-driven instead of target-based. Of course,\nminimizing program size in TIERRA may be seen as the objective, but it is\nnot explicitly formulated compared to AVIDA&#39;s metabolic functions which\ndirectly impact the duplication success (if i am not mistaken, as i am not\nan AVIDA practitionner).\n\nIn a recent paper co-authored with Jean-Marc Montanier (presented at the\nEPS workshop at ALIFE 2012), we summarized some work on environment-driven\nevolutionary adaptation of swarm of epucks robots done in the Symbrion\nswarm/modular robotic project, and we faced the problem as to where our own\nwork stands. We came up with some sort of (imperfect) classification as we\ntried to position our own work wrt. traditional Evolutionary Robotics (ER),\nEmbodied Evolution (EE), ALIFE simulation about evolution (ALIFE). I just\nextracted an up-to-date image of the table from the paper so you may find\nit easily: check it\nhere&lt;http://www.lri.fr/%7Ebredeche/pub/table-EPS2012.jpg&gt;(EDEA is our\nown method, forget it if you wish, it is not the point here).\nOf course, this is not meant as a definitive table as frontiers are\nsomewhat blurred, as with the position of novelty search (which is also\nenvironment-driven in some way, but still explicitly formulated) or AVIDA&#39;s\nmetabolic function (which also makes AVIDA task-driven). I&#39;d be curious if\nsome of you have some feedback to provide on this global classification.\n\nCheers,\n\nNicolas\n\nps:  btw, i really enjoyed reading your paper Jeff, inspiring and clearly\nwritten, as always :-)\n\r\n--f46d044516dd9f8a5104cbb7dbf6\r\nContent-Type: text/html; charset=ISO-8859-1\r\nContent-Transfer-Encoding: quoted-printable\r\n\r\n&lt;div class=3D&quot;gmail_quote&quot;&gt;&lt;div&gt;Hi, &lt;br&gt;&lt;br&gt;\nI understand that this short d=\r\niscussion about target-based vs. \nnon-target-based evolution may grow a bit=\r\n off-topic, but I would love to\n take this discussion a little further abou=\r\nt the difference btw \nobjective-driven and environment-driven evolution.&lt;br=\r\n&gt;&lt;br&gt;(...)&lt;br&gt;&lt;/div&gt;&lt;blockquote class=3D&quot;gmail_quote&quot; style=3D&quot;margin:0pt 0=\r\npt 0pt 0.8ex;border-left:1px solid rgb(204,204,204);padding-left:1ex&quot;&gt;&lt;div =\r\nclass=3D&quot;im&quot;&gt;\n&gt; I&#39;m also not sure whether it&#39;s really accurate t=\r\no say Avida is &quot;not target-based.&quot; It&#39;s true that it&#39;s no=\r\nt as explicit as a single simple objective function, but the fact that ther=\r\ne are several logical operations that explicitly give an advantage to organ=\r\nisms that execute them actually does create a form of objective-driven pres=\r\nsure. In other words, the creativity of evolution in Avida with such a prio=\r\nri human-defined rewards is to some extent hampered by the need to stay com=\r\npetitive on those arbitrary objectives. So I&#39;d expect it to be closer t=\r\no objective search (when used in that mode) than non-objective search, thou=\r\ngh somewhere on the continuum between them. I also understand that Avida as=\r\n a platform doesn&#39;t have to be run with those rewards, but if I underst=\r\nand correctly they are traditional and used in this particular paper as wel=\r\nl.&lt;br&gt;\n\n\n&gt;&lt;br&gt;\n&lt;br&gt;\n&lt;/div&gt;I agree with you. Avida is likely more towards=\r\n non-objective search than target-based search, but probably not by that mu=\r\nch. You&#39;d likely get a stronger argument from Charles Ofria about it be=\r\ning more open-ended, but I&#39;ve always thought that Avida (and all alife =\r\nsimulations) are still rather target-based. That&#39;s why I don&#39;t put =\r\ntoo much stock in the argument that not having an explicit fitness function=\r\n makes some alife simulations more interesting: I usually think they do hav=\r\ne an explicit fitness function, it&#39;s just a complicated one that we don=\r\n&#39;t understand as much as others.&lt;br&gt;\n\n&lt;div&gt;&lt;/div&gt;&lt;/blockquote&gt;&lt;div&gt;=A0(=\r\n...)&lt;br&gt;&lt;br&gt;It seems to me that one additional property must be taken into =\r\naccount about how the selection pressure is actually applied. On the one ha=\r\nnd, selection can be implemented as an user-defined metric used to compare =\r\nand rank individuals for selection/replacement, which is the classical way =\r\nin Evolutionary Robotics/Algorithms (incl. novelty search, ie. an explicit =\r\nfunction formulating an implicit objective - though of course the search fo=\r\nr novelty looks a lot like modelling the red queen). On the other hand, sel=\r\nection can result from environmental pressure as it is the case with TIERRA=\r\n (and to less extent, to AVIDA, IMHO), where selection/replacement does not=\r\n depend on a performance value to be computed.&lt;br&gt;\n\n&lt;br&gt;I agree with you bo=\r\nth as AVIDA seems to stand inbetween as a performance measure is actually c=\r\nomputed (the metabolic function) but is not directly used for selection/rep=\r\nlacement. On the contraty, I always had the impression that TIERRA was some=\r\nthing more on the side of &quot;true&quot; natural selection, environment-d=\r\nriven instead of target-based. Of course, minimizing program size in TIERRA=\r\n may be seen as the objective, but it is not explicitly formulated compared=\r\n to AVIDA&#39;s metabolic functions which directly impact the duplication s=\r\nuccess (if i am not mistaken, as i am not an AVIDA practitionner). &lt;br&gt;\n\n&lt;b=\r\nr&gt;In a recent paper co-authored with Jean-Marc Montanier (presented at the =\r\nEPS workshop at ALIFE 2012), we summarized some work on environment-driven =\r\nevolutionary adaptation of swarm of epucks robots done in the Symbrion swar=\r\nm/modular robotic project, and we faced the problem as to where our own wor=\r\nk stands. We came up with some sort of (imperfect) classification as we tri=\r\ned to position our own work wrt. traditional Evolutionary Robotics (ER), Em=\r\nbodied Evolution (EE), ALIFE simulation about evolution (ALIFE). I just ext=\r\nracted an up-to-date image of the table from the paper so you may find it e=\r\nasily: &lt;a href=3D&quot;http://www.lri.fr/%7Ebredeche/pub/table-EPS2012.jpg&quot;&gt;chec=\r\nk it here&lt;/a&gt; (EDEA is our own method, forget it if you wish, it is not the=\r\n point here). Of course, this is not meant as a definitive table as frontie=\r\nrs are somewhat blurred, as with the position of novelty search (which is a=\r\nlso environment-driven in some way, but still explicitly formulated) or AVI=\r\nDA&#39;s metabolic function (which also makes AVIDA task-driven). I&#39;d b=\r\ne curious if some of you have some feedback to provide on this global class=\r\nification.&lt;br&gt;\n\n&lt;br&gt;Cheers,&lt;br&gt;&lt;br&gt;Nicolas&lt;br&gt;&lt;br&gt;ps:=A0 btw, i really enjo=\r\nyed reading your paper Jeff, inspiring and clearly written, as always :-)&lt;b=\r\nr&gt;&lt;/div&gt;&lt;/div&gt;\n\r\n--f46d044516dd9f8a5104cbb7dbf6--\r\n\n"}}