{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[{"name":"READ"}]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"userId":467342474,"authorName":"Jeff Clune","from":"Jeff Clune &lt;jeffclune@...&gt;","profile":"jeffreyclune","replyTo":"LIST","senderId":"wy6RyRpb1CHm2OznospwVlykB657sBAdH-7eVWV8hqdjOwE3TSMTVNPsJL4Y60K_qAhHtWff8zkS_9C5FPFisFqUEkljCt0nmQ","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [neat] New Paper: Ontogeny tends to recapitulate phylogeny in digital organisms","postDate":"1349996242","msgId":5910,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDc2MDc5RkExLTlGQzQtNERDOC1BMzAxLUM5QjU3ODBEQkRGNEBjb3JuZWxsLmVkdT4=","inReplyToHeader":"PENBTGduK0p5amtkRzZlZG10S1pBYzk4VDd4OHZfSndBbW1wSmdTakxEY291RkEtYXNzd0BtYWlsLmdtYWlsLmNvbT4=","referencesHeader":"PGs0bXUwbStpNmk1QGVHcm91cHMuY29tPiA8NTNGNkFGMEEtOTI2Ri00RjJCLUEzNTUtRjQ0RjNFMkE1QkE5QGNvcm5lbGwuZWR1PiA8Q0FMZ24rSnlqa2RHNmVkbXRLWkFjOThUN3g4dl9Kd0FtbXBKZ1NqTERjb3VGQS1hc3N3QG1haWwuZ21haWwuY29tPg=="},"prevInTopic":5909,"nextInTopic":5911,"prevInTime":5909,"nextInTime":5911,"topicId":5888,"numMessagesInTopic":14,"msgSnippet":"Thanks for the kind words Nicolas. It is true that Avida explicitly checks whether certain metabolic functions are performed, but (as you mention) performing","rawEmail":"Return-Path: &lt;jclune@...&gt;\r\nX-Sender: jclune@...\r\nX-Apparently-To: neat@yahoogroups.com\r\nX-Received: (qmail 82281 invoked from network); 11 Oct 2012 22:57:26 -0000\r\nX-Received: from unknown (98.137.35.161)\n  by m13.grp.sp2.yahoo.com with QMQP; 11 Oct 2012 22:57:26 -0000\r\nX-Received: from unknown (HELO mail-we0-f182.google.com) (74.125.82.182)\n  by mta5.grp.sp2.yahoo.com with SMTP; 11 Oct 2012 22:57:25 -0000\r\nX-Received: by mail-we0-f182.google.com with SMTP id x43so1726483wey.13\n        for &lt;neat@yahoogroups.com&gt;; Thu, 11 Oct 2012 15:57:24 -0700 (PDT)\r\nX-Received: by 10.180.74.33 with SMTP id q1mr1323300wiv.4.1349996244790;\n        Thu, 11 Oct 2012 15:57:24 -0700 (PDT)\r\nReturn-Path: &lt;jclune@...&gt;\r\nX-Received: from [192.168.0.2] (02d87e4f.bb.sky.com. [2.216.126.79])\n        by mx.google.com with ESMTPS id ay10sm251421wib.2.2012.10.11.15.57.23\n        (version=TLSv1/SSLv3 cipher=OTHER);\n        Thu, 11 Oct 2012 15:57:24 -0700 (PDT)\r\nContent-Type: text/plain; charset=windows-1252\r\nMime-Version: 1.0 (Mac OS X Mail 6.2 &#92;(1499&#92;))\r\nIn-Reply-To: &lt;CALgn+JyjkdG6edmtKZAc98T7x8v_JwAmmpJgSjLDcouFA-assw@...&gt;\r\nDate: Thu, 11 Oct 2012 23:57:22 +0100\r\nContent-Transfer-Encoding: quoted-printable\r\nMessage-Id: &lt;76079FA1-9FC4-4DC8-A301-C9B5780DBDF4@...&gt;\r\nReferences: &lt;k4mu0m+i6i5@...&gt; &lt;53F6AF0A-926F-4F2B-A355-F44F3E2A5BA9@...&gt; &lt;CALgn+JyjkdG6edmtKZAc98T7x8v_JwAmmpJgSjLDcouFA-assw@...&gt;\r\nTo: neat users group group &lt;neat@yahoogroups.com&gt;\r\nX-Mailer: Apple Mail (2.1499)\r\nX-eGroups-Msg-Info: 1:12:0:0:0\r\nFrom: Jeff Clune &lt;jeffclune@...&gt;\r\nSubject: Re: [neat] New Paper: Ontogeny tends to recapitulate phylogeny in digital organisms\r\nX-Yahoo-Group-Post: member; u=467342474; y=GGrGTe5xewsVyaxJe3aae2NhqEFR5XweyOCp_IdJ0itUOGKgjsOw\r\nX-Yahoo-Profile: jeffreyclune\r\n\r\nThanks for the kind words Nicolas. \n\nIt is true that Avida explicitly check=\r\ns whether certain metabolic functions are performed, but (as you mention) p=\r\nerforming such functions only speeds up the replication of a given Avidian =\r\n(and there are other ways Avidians can speed up replication, such as improv=\r\ning their self-replication speed). So, I agree that Avida has injected some=\r\n target-based search (though for multiple, different targets), moving it a =\r\nbit away from Tierra and towards traditional EAs. \n\nHowever, I think the mo=\r\nre provocative question is this: why does it matter if the fitness function=\r\n is implicit or explicit? We know that in Tierra and Avida, replication spe=\r\ned is the ultimate fitness function, and various things can speed up or slo=\r\nw down replication. Why is that interestingly different from target-based s=\r\nearch? There are many who believe that Tierra and Avida represent a fundame=\r\nntally different type of system because they don&#39;t have an &quot;explicit fitnes=\r\ns function&quot;, but I&#39;ve never really understood why they are fundamentally di=\r\nfferent in an interesting way. Is the main difference that there are many d=\r\nifferent ways to accomplish the overarching goal? If so, why isn&#39;t that als=\r\no true in most target-based objectives? For example, when evolving gaits fo=\r\nr legged robots (an example of what is called an explicit fitness function/=\r\ntarget-based search), there are many different ways to achieve higher veloc=\r\nities. \n\nI agree that open-ended evolution is more likely to occur when the=\r\nre are many different, rewarded ways to survive=85so I do agree that more a=\r\nbstract goals (such as replication speed) that can be solved in different w=\r\nays are less likely to get stuck on local optima, but there are many differ=\r\nent ways to solve most target-based problems, and I don&#39;t see why these non=\r\n-explicit fitness function systems have that many more ways than explicit f=\r\nitness functions. Novelty search, on the other hand, really seems to open t=\r\nhings up and be a fundamental game changer, which is why I see it as fundam=\r\nentally different and extremely interesting. \n\nBest regards,\nJeff Clune\n\nVi=\r\nsiting Scientist\nCornell University\njeffclune@...\njeffclune.com\n\nOn=\r\n Oct 10, 2012, at 6:33 PM, Nicolas Bredeche &lt;nekonaute@...&gt; wrote:\n\n&gt; =\r\n\n&gt; Hi, \n&gt; \n&gt; I understand that this short discussion about target-based vs.=\r\n non-target-based evolution may grow a bit off-topic, but I would love to t=\r\nake this discussion a little further about the difference btw objective-dri=\r\nven and environment-driven evolution.\n&gt; \n&gt; (...)\n&gt; &gt; I&#39;m also not sure whet=\r\nher it&#39;s really accurate to say Avida is &quot;not target-based.&quot; It&#39;s true that=\r\n it&#39;s not as explicit as a single simple objective function, but the fact t=\r\nhat there are several logical operations that explicitly give an advantage =\r\nto organisms that execute them actually does create a form of objective-dri=\r\nven pressure. In other words, the creativity of evolution in Avida with suc=\r\nh a priori human-defined rewards is to some extent hampered by the need to =\r\nstay competitive on those arbitrary objectives. So I&#39;d expect it to be clos=\r\ner to objective search (when used in that mode) than non-objective search, =\r\nthough somewhere on the continuum between them. I also understand that Avid=\r\na as a platform doesn&#39;t have to be run with those rewards, but if I underst=\r\nand correctly they are traditional and used in this particular paper as wel=\r\nl.\n&gt; &gt;\n&gt; \n&gt; I agree with you. Avida is likely more towards non-objective se=\r\narch than target-based search, but probably not by that much. You&#39;d likely =\r\nget a stronger argument from Charles Ofria about it being more open-ended, =\r\nbut I&#39;ve always thought that Avida (and all alife simulations) are still ra=\r\nther target-based. That&#39;s why I don&#39;t put too much stock in the argument th=\r\nat not having an explicit fitness function makes some alife simulations mor=\r\ne interesting: I usually think they do have an explicit fitness function, i=\r\nt&#39;s just a complicated one that we don&#39;t understand as much as others.\n&gt;  (=\r\n...)\n&gt; \n&gt; It seems to me that one additional property must be taken into ac=\r\ncount about how the selection pressure is actually applied. On the one hand=\r\n, selection can be implemented as an user-defined metric used to compare an=\r\nd rank individuals for selection/replacement, which is the classical way in=\r\n Evolutionary Robotics/Algorithms (incl. novelty search, ie. an explicit fu=\r\nnction formulating an implicit objective - though of course the search for =\r\nnovelty looks a lot like modelling the red queen). On the other hand, selec=\r\ntion can result from environmental pressure as it is the case with TIERRA (=\r\nand to less extent, to AVIDA, IMHO), where selection/replacement does not d=\r\nepend on a performance value to be computed.\n&gt; \n&gt; I agree with you both as =\r\nAVIDA seems to stand inbetween as a performance measure is actually compute=\r\nd (the metabolic function) but is not directly used for selection/replaceme=\r\nnt. On the contraty, I always had the impression that TIERRA was something =\r\nmore on the side of &quot;true&quot; natural selection, environment-driven instead of=\r\n target-based. Of course, minimizing program size in TIERRA may be seen as =\r\nthe objective, but it is not explicitly formulated compared to AVIDA&#39;s meta=\r\nbolic functions which directly impact the duplication success (if i am not =\r\nmistaken, as i am not an AVIDA practitionner). \n&gt; \n&gt; In a recent paper co-a=\r\nuthored with Jean-Marc Montanier (presented at the EPS workshop at ALIFE 20=\r\n12), we summarized some work on environment-driven evolutionary adaptation =\r\nof swarm of epucks robots done in the Symbrion swarm/modular robotic projec=\r\nt, and we faced the problem as to where our own work stands. We came up wit=\r\nh some sort of (imperfect) classification as we tried to position our own w=\r\nork wrt. traditional Evolutionary Robotics (ER), Embodied Evolution (EE), A=\r\nLIFE simulation about evolution (ALIFE). I just extracted an up-to-date ima=\r\nge of the table from the paper so you may find it easily: check it here (ED=\r\nEA is our own method, forget it if you wish, it is not the point here). Of =\r\ncourse, this is not meant as a definitive table as frontiers are somewhat b=\r\nlurred, as with the position of novelty search (which is also environment-d=\r\nriven in some way, but still explicitly formulated) or AVIDA&#39;s metabolic fu=\r\nnction (which also makes AVIDA task-driven). I&#39;d be curious if some of you =\r\nhave some feedback to provide on this global classification.\n&gt; \n&gt; Cheers,\n&gt;=\r\n \n&gt; Nicolas\n&gt; \n&gt; ps:  btw, i really enjoyed reading your paper Jeff, inspir=\r\ning and clearly written, as always :-)\n&gt; \n&gt; \n\n\n"}}