{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[{"name":"READ"}]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"userId":54567749,"authorName":"Ken","from":"&quot;Ken&quot; &lt;kstanley@...&gt;","profile":"kenstanley01","replyTo":"LIST","senderId":"f--L7FSrVBONM6iyit_VEC-DwMMueGnGwhHSpWUs-EhqQKPwr2Hz29Zw_6zCl5K6eL-ZEb4wARS8a007VOZlruHm5Kh6","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: New paper on why modules evolve, and how to evolve modular artif","postDate":"1362266209","msgId":6014,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGtndTE5MStzdDJpQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGtnbDhwZis5aW45QGVHcm91cHMuY29tPg=="},"prevInTopic":6012,"nextInTopic":6015,"prevInTime":6013,"nextInTime":6015,"topicId":6011,"numMessagesInTopic":10,"msgSnippet":"Hi Jeff, Stef, and Martin, I hope you don t mind since all of you addressed me if I try to reply to all of you at once to keep the thread (and my brain) from","rawEmail":"Return-Path: &lt;kstanley@...&gt;\r\nX-Sender: kstanley@...\r\nX-Apparently-To: neat@yahoogroups.com\r\nX-Received: (qmail 10507 invoked from network); 2 Mar 2013 23:16:49 -0000\r\nX-Received: from unknown (10.193.84.168)\n  by m4.grp.bf1.yahoo.com with QMQP; 2 Mar 2013 23:16:49 -0000\r\nX-Received: from unknown (HELO ng1-ip2.bullet.mail.bf1.yahoo.com) (98.139.164.139)\n  by mta6.grp.bf1.yahoo.com with SMTP; 2 Mar 2013 23:16:49 -0000\r\nX-Received: from [98.139.164.124] by ng1.bullet.mail.bf1.yahoo.com with NNFMP; 02 Mar 2013 23:16:49 -0000\r\nX-Received: from [10.193.94.43] by tg5.bullet.mail.bf1.yahoo.com with NNFMP; 02 Mar 2013 23:16:49 -0000\r\nDate: Sat, 02 Mar 2013 23:16:49 -0000\r\nTo: neat@yahoogroups.com\r\nMessage-ID: &lt;kgu191+st2i@...&gt;\r\nIn-Reply-To: &lt;kgl8pf+9in9@...&gt;\r\nUser-Agent: eGroups-EW/0.82\r\nMIME-Version: 1.0\r\nContent-Type: text/plain; charset=&quot;ISO-8859-1&quot;\r\nContent-Transfer-Encoding: quoted-printable\r\nX-Mailer: Yahoo Groups Message Poster\r\nX-Yahoo-Newman-Property: groups-compose\r\nX-eGroups-Msg-Info: 1:12:0:0:0\r\nFrom: &quot;Ken&quot; &lt;kstanley@...&gt;\r\nSubject: Re: New paper on why modules evolve, and how to evolve modular artif\r\nX-Yahoo-Group-Post: member; u=54567749; y=RsxUae_xzpuU3sCpoM4cfxAgivKArQ_wGKCU6WlBjgvUoqlv1bE_\r\nX-Yahoo-Profile: kenstanley01\r\n\r\n\n\nHi Jeff, Stef, and Martin, I hope you don&#39;t mind since all of you address=\r\ned me if I try to reply to all of you at once to keep the thread (and my br=\r\nain) from branching in three directions.  Many of your points follow a simi=\r\nlar theme so I think it makes sense to respond collectively.  This response=\r\n is practically an article, but oh well, it&#39;s nice to get the ideas down ev=\r\nen if it&#39;s a bit too long (it just shows you are asking me great questions =\r\nthat are challenging).\n\nMartin offers a good unifying question: &quot;My questio=\r\nn to Ken would be here: what is the additional ingredient that makes a\nbias=\r\n in the encoding better / more plausible than *any* implementation of the b=\r\nias in the fitness function?&quot;\n\nAfter some thought, I believe one of the dif=\r\nficulties in this discussion is that we often conflate artificial EC-style =\r\nfitness-based experiments with open-ended scenarios when these are entirely=\r\n different situations (I take blame myself as well for this tendency).  Tha=\r\nt is, when we talk about something being &quot;better&quot; or &quot;solving&quot; a problem, w=\r\ne are often talking about artificial and unnatural experimental setups that=\r\n have little relationship to open-ended evolutionary scenarios like nature.=\r\n  \n\nWhy does that matter?  It matters because in discussions that try to do=\r\nvetail engineering-oriented mechanisms (like a connectivity penalty) with e=\r\nxplanations of what happened in nature (such as the emergence of modular co=\r\nnnectivity), it cannot simply be ignored that nature in fact is first and f=\r\noremost an open-ended evolutionary system, and that that open-ended dynamic=\r\n is a significant factor in the explanation of its products.   What that me=\r\nans to me is that if you think your proposed mechanism actually *explains* =\r\nsomething that happened in nature, then it is essential that the explanatio=\r\nn speaks to the question of how the particular mechanism you are advancing =\r\ncombined historically with the open-ended evolutionary dynamics in nature t=\r\no produce the result you expect.\n\nBut because we conflate very closed-ended=\r\n artificial scenarios with monumentally open-ended searches like nature, it=\r\n leads to a lot of dangerous inferences.   So ideas that would make sense i=\r\nn one context end up sounding reasonable when they don&#39;t really make any se=\r\nnse in the other context.  The difficulty of squaring fitness-pressure obje=\r\nctives with nature is more serious when you consider it in this perspective=\r\n.  (Note that I am defining &quot;fitness pressure&quot; as selection based on relati=\r\nve performance to other organisms on a measure of some property that varies=\r\n over a range of possible values, such as degree of connectivity.)\n\nThe pro=\r\nblem is that fitness pressures that preserve a degenerate niche for eternit=\r\ny are definitively not like nature, so whether they work or not, or whether=\r\n I am somehow indicting them or not, should not be the issue.  The issue sh=\r\nould be that we should be worried that nature does not use a mechanism even=\r\n remotely like that yet still achieves the &quot;same&quot; result (i.e. beautiful va=\r\nriations of pseudo-modular design).  If you are advancing the hypothesis th=\r\nat this kind of constant &quot;pressure&quot; is somehow essential to the emergence o=\r\nf modularity in nature, then you must somehow explain why you needed to use=\r\n a setup with these bizarre and unnatural side effects (like eternal degene=\r\nrate niches) instead of whatever nature actually supposedly does use.\n\nAnd =\r\nthe fact that you cannot come up with anything similar to what nature does,=\r\n i.e. something that does not involve creating such a deadweight pocket, re=\r\nasonably may suggest that your hypothesis about nature could be wrong.  Tha=\r\nt is, it may not be this endless &quot;fitness pressure&quot; after all that explains=\r\n what is happening there, because fitness pressure in general in EC is almo=\r\nst always creating some kind of unintended deadweight niche.\n\nI think it is=\r\n particularly fascinating that in fact nature obtains not really the same r=\r\nesult, but a far more awesome result (in terms of modularity or anything el=\r\nse), without such an ad hoc mechanism. \nIf you think about it, as long as y=\r\nou insist on cheering for fitness pressure, it prevents you from asking how=\r\n this could be - how is it possible that you can get these kinds of results=\r\n without such an unnatural side effect?\n\nI need to emphasize here the diffe=\r\nrence between being a better engineering mechanism and a better explanation=\r\n.  I am focusing now primarily on the explanatory power of the proposed mec=\r\nhanism.  But because nature is so much more accomplished than anything arti=\r\nficial, the explanatory gap here implies a dangerous potential to overlook =\r\nwhat will ultimately amount also to a major engineering gap as well.  There=\r\n is no evidence that anything except nature in its open-ended way can creat=\r\ne anything like the connectivity of natural brains.\n\nFurthermore, it is alw=\r\nays important to acknowledge nuance and subtlety in nature, which has not r=\r\neally been acknowledged yet in this conversation.  Nature is almost never a=\r\nll one way.  So it is misleading and potentially confusing to talk about br=\r\nains as simply modular or not.  The recent discussion on the Connectionists=\r\n list, where scientists have been giving all kinds of subtle and conflictin=\r\ng perspectives on modularity in natural brains in response to Jeff and JBM&#39;=\r\ns article,  echoes this nuance.   The beauty of the human brain to me is no=\r\nt that it is modular, but that it is modular to an extent, but not entirely=\r\n so, and what modularity there is is hard to pin down.  This kind of nuance=\r\n is not to me a mere footnote to the achievement of nature, but the central=\r\n point of it:  what nature achieves in spades is nuance. \n\nAnd the idea of =\r\na constant pressure of any kind is directly in conflict with the achievemen=\r\nt of nuance, because nuance is a delicate balancing act that is easily tipp=\r\ned off its perch if constant pressure in *any* direction is applied without=\r\n relief.  Jeff is concerned with short-term versus long-term issues (which =\r\nisn&#39;t really as clearly defined in an open-ended context), but even if we h=\r\nonor that concern, it is potentially na=EFve to believe that pressure in ei=\r\nther direction from the start, or even an encoding bias in either direction=\r\n from the start, is somehow going to directly align with the level of nuanc=\r\ne observed millions of years in the future.  However, while fitness pressur=\r\ne is eternal, encoding bias is malleable, so pushing in the &quot;right&quot; directi=\r\non from the start is not essential for encoding.  It&#39;s more like a hint to =\r\nget you started, whereas fitness pressure is more like a gun forever pointe=\r\nd at your back.\n\nFor example, who is to say that we should not have the opp=\r\nosite short-term worry as Jeff does =96 he worries that an encoding bias to=\r\nwards low connectivity &quot;might evolve away because of fitness pressure,&quot; but=\r\n can&#39;t we just as easily worry about *too much* modularity?  In that case, =\r\nJeff&#39;s evil twin &quot;opposite-Jeff&quot; might be worried that an initial encoding =\r\nbias towards *high* connectivity might evolve away.  It is not clear nor es=\r\ntablished fact (see Connectionists) that the exact form of the final &quot;solut=\r\nion&quot; is particularly modular or non-modular.  What it is, is subtle and som=\r\newhere in the middle.  So none of this kind of panicking about what nature =\r\n&quot;needs&quot; to harass it into such an astronomically complex future configurati=\r\non makes much sense.  We cannot say definitively the extent to which the fi=\r\nnal structure is &quot;closer&quot; to modular or non-modular, whatever that even mea=\r\nns.  Fortunately, an encoding that begins with a bias towards modularity ca=\r\nn tone it down as needed, or ramp it up even more.\n\nYet Jeff also worries a=\r\nbout about the radiation of evolutionary lineages being blocked because of =\r\nimplicit penalties: He says, &quot;You assume that evolution will branch out and=\r\n explore all these options even in the face of fitness penalties for that e=\r\nxploration. But that is not how evolution works.&quot;\n\nBut branching out and ex=\r\nploring many (not necessarily all of course) of the options is the only way=\r\n that natural evolution works.  That&#39;s what open-endedness is (unless you d=\r\non&#39;t believe natural evolution to be open-ended).  The tree of life is ever=\r\n-branching.  The worry about &quot;fitness penalties&quot; here is a red herring beca=\r\nuse it originates from closed-ended artificial EC experiments where you can=\r\n end up on the wrong path.  But nature does not have any single &quot;fitness pe=\r\nnalty&quot; or &quot;right path&quot; throughout its run because the landscape is always c=\r\nhanging as it branches and branches.  For example, before trees, being an e=\r\nxtremely tall herbivore would incur a fitness penalty, but after trees gira=\r\nffes were perfectly viable.  The penalty is not consistent.\n\nMore generally=\r\n, how can there be what you call a &quot;default fitness penalty&quot; if there is no=\r\n final goal?  Penalty with respect to what?  Keep in mind here that the ori=\r\ngin of pseudo-modular organization in nature likely predates the emergence =\r\neven of neurons.  The first neural structures piggy-backed on previously ev=\r\nolved organizational structure that likely influenced the subtle pseudo-mod=\r\nularity of connectivity from the start for reasons entirely unrelated to co=\r\nnnection cost because these organizational conventions evolved long before =\r\nneurons even existed:  the bias in the encoding was in part already there.\n=\r\n\nWhich brings me back to the origin of all such conventions - canalization =\r\n- which is the key here.   Stephane talks about a bias that exists &quot;all alo=\r\nng&quot; in evolution, but ultimately the ability to *change* bias eclipses choo=\r\nsing one up front.  Again, in the context of artificial scenarios, it&#39;s a g=\r\nood engineering hack to force in some kind of bias into the encoding or int=\r\no fitness that you expect to control things for a moderate number of genera=\r\ntions.  But in nature the scope is so vast that it can&#39;t be the final word;=\r\n it&#39;s only the initial hint.  While that hint can help, nature in the long =\r\nterm needs to choose and commit to its own biases, and to slither out of th=\r\nem from time to time, and only encoding offers that potential.  Canalizatio=\r\nn is the way nature can make long-term (though not necessarily permanent) c=\r\nommitments.  It&#39;s how conventions are established in specific lineages.\n\nIn=\r\n a genuine open-ended scenario like nature, modularity will emerge and prol=\r\niferate over vast stretches of time only if modularity leads to more specie=\r\ns emerging.  Of course, the species we observe at the end are the consequen=\r\nce of organizational principles that supported generating many species (whi=\r\nch is almost tautological).   So it need not relate to being better or wors=\r\ne, or &quot;solving&quot; anything.  It has to do with open-ended dynamics.  Air will=\r\n escape a hole in a balloon if you wait long enough.  If that hole leads to=\r\n a whole other world, you will eventually see that other world.  Modularity=\r\n, to the extent it actually exists in nature, has served as such a hole.  B=\r\nut the only way such a hole can be exploited, the only way you can keep foc=\r\nused on that area, is if it can be canalized.  An encoding that can be cana=\r\nlized allows you to maintain the subtle convention that is responsible for =\r\nspreading diversity.   \n\nStef nevertheless reminds me that &quot;selection press=\r\nure has strong impact,&quot; and I entirely agree of course.  But there are two =\r\nvery different classes of selection pressure.  One is about pushing you tow=\r\nards the new, and the other is about forcing you to commit to the old.  The=\r\nre are many ways to push towards the new, and novelty search is just one.  =\r\nIn contrast, these things we call &quot;fitness pressures&quot; (whether part of a MO=\r\nEA or not) are the opposite =96 they are toxic strait jackets applied for e=\r\nternity.  They presume that we know what we need with no nuance whatsoever =\r\neons before anything remotely related has appeared.   Again, in engineering=\r\n, fair enough =96 it can work.  But it is not an *explanation* of the produ=\r\ncts of open-ended evolution in nature, and likely is not a good way to prod=\r\nuce open-endedness artificially either.  \n\nSo the only escape I see here fr=\r\nom my argument is if you can argue somehow that you can do all these amazin=\r\ng things *without* open-ended evolution.  Then all your pressures and const=\r\nraints might make sense.  But I don&#39;t think you can argue that, which, to f=\r\ninally circle back to Martin&#39;s broad question, is why encoding is ultimatel=\r\ny superior.  A canalizeable encoding is the perfect partner for an open-end=\r\ned process.  But it is not (as Martin puts it) because it makes a particula=\r\nr &quot;bias in the encoding better.&quot;  Rather, it is because encoding lets evolu=\r\ntion delicately modify its own biases on the fly and explore all of them in=\r\n parallel.  That is, the ability to change, the ability to flexible, to com=\r\nmit but to uncommit in increments of subtlety, to radiate diversity while s=\r\ntill committing to certain biases in certain chains, is the power that made=\r\n everything happen.  Any forced competition, any constant bias, any eternal=\r\n relative judgment, which are all things that constant fitness pressure off=\r\ners, will diminish that flexibility.  It will not necessarily destroy the o=\r\npen-ended process, but it will reduce its power and ultimately therefore ca=\r\nnnot explain or account for it.\n\n\nBest,\n\nken\n\n\n--- In neat@yahoogroups.com,=\r\n &quot;martin_pyka&quot; &lt;martin.pyka@...&gt; wrote:\n&gt;\n&gt; I just would like to point out =\r\nthat, in my opinion, part of the disagreement between you and Jeff and Ken =\r\ncomes from the fact that Ken somehow made the statement &quot;it is better to im=\r\nplement the bias in the encoding than in the fitness function&quot; but in actua=\r\nl fact argues for a specific type of implementation in the encoding.\n&gt; \n&gt; T=\r\nhus, I thing the discussion should not center around the general question w=\r\nhether a bias should be incorporated in the fitness or in the encoding beca=\r\nuse in both areas there are better and worse ways to do it. The question is=\r\n more, why a specific implementation (that Ken has obviously in mind, my im=\r\npression was he thought about approaches similar to LEO) is better than ano=\r\nther.\n&gt; \n&gt; My question to Ken would be here: what is the additional ingredi=\r\nent that makes a bias in the encoding better / more plausible than *any* im=\r\nplementation of the bias in the fitness function?\n&gt;\n\n\n\n"}}