{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[{"name":"READ"}]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"userId":54567749,"authorName":"Ken","from":"&quot;Ken&quot; &lt;kstanley@...&gt;","profile":"kenstanley01","replyTo":"LIST","senderId":"H8VelDc3xJA763jO7wQY61TYvMxZUkIt0ORNo7o4vMYFQy5tQ2p9pASOoT1UHXhJv-4PDQvOhWxzQ7q0MVycUwzRYX2u","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: Evolving Soft Robots with CPPNs (New Paper & Video)","postDate":"1365992542","msgId":6045,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGtrZm84dSs0N2luQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDgwRTYwNTlBLTZEMzQtNDY3QS1COEEzLTQyQjFGMzU5NzRFRUBnbWFpbC5jb20+"},"prevInTopic":6044,"nextInTopic":6046,"prevInTime":6044,"nextInTime":6046,"topicId":6038,"numMessagesInTopic":46,"msgSnippet":"Hi Jeff, I got a real kick out of this story.  It s true it s practically verbatim the kind of thing I ve been talking about.  I love the sanctimonious voice","rawEmail":"Return-Path: &lt;kstanley@...&gt;\r\nX-Sender: kstanley@...\r\nX-Apparently-To: neat@yahoogroups.com\r\nX-Received: (qmail 99066 invoked from network); 15 Apr 2013 02:22:22 -0000\r\nX-Received: from unknown (10.193.84.131)\n  by m4.grp.bf1.yahoo.com with QMQP; 15 Apr 2013 02:22:22 -0000\r\nX-Received: from unknown (HELO ng5-ip2.bullet.mail.bf1.yahoo.com) (98.139.165.28)\n  by mta4.grp.bf1.yahoo.com with SMTP; 15 Apr 2013 02:22:22 -0000\r\nX-Received: from [98.139.164.122] by ng5.bullet.mail.bf1.yahoo.com with NNFMP; 15 Apr 2013 02:22:22 -0000\r\nX-Received: from [10.193.94.45] by tg3.bullet.mail.bf1.yahoo.com with NNFMP; 15 Apr 2013 02:22:22 -0000\r\nDate: Mon, 15 Apr 2013 02:22:22 -0000\r\nTo: neat@yahoogroups.com\r\nMessage-ID: &lt;kkfo8u+47in@...&gt;\r\nIn-Reply-To: &lt;80E6059A-6D34-467A-B8A3-42B1F35974EE@...&gt;\r\nUser-Agent: eGroups-EW/0.82\r\nMIME-Version: 1.0\r\nContent-Type: text/plain; charset=&quot;ISO-8859-1&quot;\r\nContent-Transfer-Encoding: quoted-printable\r\nX-Mailer: Yahoo Groups Message Poster\r\nX-Yahoo-Newman-Property: groups-compose\r\nX-eGroups-Msg-Info: 1:12:0:0:0\r\nFrom: &quot;Ken&quot; &lt;kstanley@...&gt;\r\nSubject: Re: Evolving Soft Robots with CPPNs (New Paper & Video)\r\nX-Yahoo-Group-Post: member; u=54567749; y=bKtYqc_ED-KfIKvvp_fwe-IA96MN5O044IJl0t4O1qIGseSYOyR8\r\nX-Yahoo-Profile: kenstanley01\r\n\r\n\n\nHi Jeff, I got a real kick out of this story.  It&#39;s true it&#39;s practically=\r\n verbatim the kind of thing I&#39;ve been talking about.  I love the sanctimoni=\r\nous voice of authority proclaiming, &quot;A scientifically rigorous analysis mus=\r\nt be given!&quot;  It sounds almost like a directive passed down from from the e=\r\nmperor of GECCO.  And so ironic given that the reviewer nevertheless openly=\r\n admits finding the results &quot;very impressive.&quot; The cognitive dissonance mus=\r\nt be painful.  Thanks for the perfect example of the p-value police run amo=\r\nk.\n\nBest,\n\nken\n\n--- In neat@yahoogroups.com, Jeff Clune &lt;jclune@...&gt; wrote:=\r\n\n&gt;\n&gt; &gt; Hi Jeff, congrats on this excellent work. That&#39;s great that IEEE pic=\r\nked it up so fast, but I&#39;m not surprised they like it. All the attention sh=\r\nows there&#39;s something intuitively appealing that feels natural about this d=\r\nomain. Maybe it could also succeed on Slashdot.\n&gt; &gt; \n&gt; &gt; \n&gt; Thanks Ken. Sin=\r\nce the IEEE post, the video has gone viral (ish). NBC did a story on it (ht=\r\ntp://goo.gl/OJldm) and it was on the front page of BuzzFeed, reddit/r/scien=\r\nce, and even Youtube&#39;s &quot;most popular videos&quot; page. So far it&#39;s received 68,=\r\n500 views in around 48 hours. It&#39;s been fun to watch people get so excited =\r\nabout this sort of work. \n&gt; \n&gt; It would be great if it got Slashdotted. I h=\r\nave been hoping it might happen on its own, but if it doesn&#39;t we may try to=\r\n submit something early next week. \n&gt; \n&gt; &gt; I also wanted to make a slightly=\r\n more controversial point of praise, which I hope you don&#39;t mind, but one o=\r\nf my favorite parts of the paper is this:\n&gt; &gt; \n&gt; &gt; &quot;Because it is notorious=\r\nly difficult to quantify attributes\n&gt; &gt; such as &quot;impressiveness&quot; and &quot;compl=\r\nexity&quot;, we make no effort\n&gt; &gt; to do so here. Instead, we attempt to visuall=\r\ny represent\n&gt; &gt; the interesting diversity of morphologies and behaviors tha=\r\nt\n&gt; &gt; evolved once evolution was provided with more materials\n&gt; &gt; and a sop=\r\nhisticated encoding.&quot;\n&gt; &gt; \n&gt; &gt; I really appreciated the open acknowledgment=\r\n of the potential pretense of these kinds of measures. Given the recognitio=\r\nn this paper is already receiving, it&#39;s nice to see that sometimes people c=\r\nan agree that something is interesting simply by looking at it rather than =\r\nthrough a mysterious quantification that no one really understands. (Althou=\r\ngh of course that doesn&#39;t mean measuring something is always bad either, bu=\r\nt it does tend to be overemphasized in many cases.)\n&gt; &gt; \n&gt; Thanks. I agree.=\r\n But, as you&#39;ve said many times, reviewers don&#39;t like evaluating subjective=\r\n things on their own, and they lean on p-values and demand meaningless quan=\r\ntitative comparisons because they are uncomfortable not having an excuse to=\r\n accept/reject a paper. I love quantitative measures and p-values when they=\r\n help, but I think it is unfortunate that many reviewers think that they ar=\r\ne *necessary* for publication. \n&gt; \n&gt; I actually submitted another paper to =\r\nGECCO that was rejected that was similar to this work in that it showed int=\r\neresting visual results, but did not attempt to force a quantification or e=\r\nxperimental comparison that would have been uninformative. The response? A =\r\nrejection, with comments like this one:\n&gt; \n&gt; &quot;The paper is grammatically we=\r\nll written, and organized. There are many illustrations showing the a varie=\r\nty of evolved results. They all look very impressive, and the system certai=\r\nnly seems to have promise.\n&gt; \n&gt; Unfortunately, there is absolutely no empir=\r\nical analysis included in the paper to support this research. Therefore, th=\r\nis paper is not suitable for academic publication in its current form. A sc=\r\nientifically rigorous analysis must be given, which is expected for all sci=\r\nentific papers in evolutionary computation, and GECCO in particular. Issues=\r\n that must be addressed include: evolutionary performance; statistical like=\r\nlihood of solution quality; effects of experimental parameters; effects of =\r\ntarget models; etc.&quot;\n&gt; \n&gt; When I read that I thought: &quot;This is exactly what=\r\n Ken has been complaining about!&quot; It&#39;s everything you&#39;ve been saying about =\r\nreviewers distilled into one comment. They like the ideas and results, and =\r\nthought the technical advance was impressive and new, but because I didn&#39;t =\r\npresent numbers and p-values they rejected it. Apparently if I had fiddled =\r\nwith the parameters a bit and showed them plots and p-vlaues=85which would =\r\nnot have shed any light on the main innovation of the paper=85then they wou=\r\nld have had an excuse to accept the paper. I was shocked to see this view e=\r\nxpressed so explicitly!\n&gt; \n&gt; \n&gt; -Jeff\n&gt; \n&gt; \n&gt; &gt; \n&gt; &gt; Best,\n&gt; &gt; \n&gt; &gt; ken \n&gt; =\r\n&gt; \n&gt; &gt; --- In neat@yahoogroups.com, Jeff Clune &lt;jclune@&gt; wrote:\n&gt; &gt; &gt;\n&gt; &gt; &gt;=\r\n Hello all,\n&gt; &gt; &gt; \n&gt; &gt; &gt; I am pleased to announce a new paper on evolving s=\r\noft robots with CPPNs. In it we try to improve the complexity of evolved vi=\r\nrtual organisms over what Karl Sims generated nearly 20 years ago. What do =\r\nyou think: are we on track to do that? Have we already? The video is the be=\r\nst way to judge.\n&gt; &gt; &gt; \n&gt; &gt; &gt; ----------Unplanned Last Minute Upate -------=\r\n-------\n&gt; &gt; &gt; I just found out that the video for the paper is on the front=\r\n page of Hacker News (I have no idea how they found it so fast without any =\r\nannouncements). \n&gt; &gt; &gt; \n&gt; &gt; &gt; If you want to help out, please go here and &quot;=\r\nup vote&quot; us. You&#39;ll need to register, but that is painless. NOTE: you may h=\r\nave to scroll to the second or third page (hopefully not!).\n&gt; &gt; &gt; \n&gt; &gt; &gt; ht=\r\ntps://news.ycombinator.com/news\n&gt; &gt; &gt; \n&gt; &gt; &gt; Look for: &quot;Bizarre Soft Robots=\r\n Evolve to Run (ieee.org)&quot;\n&gt; &gt; &gt; ------------------------------------------=\r\n----------------\n&gt; &gt; &gt; \n&gt; &gt; &gt; Cite: Cheney N, MacCurdy R, Clune J, Lipson H=\r\n (2013) Unshackling evolution: evolving soft robots with multiple materials=\r\n and a powerful generative encoding. Proceedings of the Genetic and Evoluti=\r\nonary Computation Conference. \n&gt; &gt; &gt; \n&gt; &gt; &gt; Video: http://youtu.be/z9ptOeBy=\r\nLA4\n&gt; &gt; &gt; \n&gt; &gt; &gt; PDF: http://jeffclune.com/publications/2013_Softbots_GECCO=\r\n.pdf\n&gt; &gt; &gt; \n&gt; &gt; &gt; Abstract: In 1994 Karl Sims showed that computational evo=\r\nlution can produce interesting morphologies that resemble natural organisms=\r\n. Despite nearly two decades of work since, evolved morphologies are not ob=\r\nviously more complex or natural, and the field seems to have hit a complexi=\r\nty ceiling. One hypothesis for the lack of increased complexity is that mos=\r\nt work, including Sims&#39;, evolves morphologies composed of rigid elements, s=\r\nuch as solid cubes and cylinders, limiting the design space. A second hypot=\r\nhesis is that the encodings of previous work have been overly regular, not =\r\nallowing complex regularities with variation. Here we test both hypotheses =\r\nby evolving soft robots with multiple materials and a powerful generative e=\r\nncoding called a compositional pattern-producing network (CPPN). Robots are=\r\n selected for locomotion speed. We find that CPPNs evolve faster robots tha=\r\nn a direct encoding and that the CPPN morphologies appear more natural. We =\r\nalso find that locomotion performance increases as more materials are added=\r\n, that diversity of form and behavior can be increased with different cost =\r\nfunctions without stifling performance, and that organisms can be evolved a=\r\nt different levels of resolution. These findings suggest the ability of gen=\r\nerative soft-voxel systems to scale towards evolving a large diversity of c=\r\nomplex, natural, multi-material creatures. Our results suggest that future =\r\nwork that combines the evolution of CPPN-encoded soft, multi-material robot=\r\ns with modern diversity-encouraging techniques could finally enable the cre=\r\nation of creatures far more complex and interesting than those produced by =\r\nSims nearly twenty years ago.\n&gt; &gt; &gt; \n&gt; &gt; &gt; As always, please let me know if=\r\n you have any comments or questions!\n&gt; &gt; &gt; \n&gt; &gt; &gt; PS. Here is the IEEE Spec=\r\ntrum article that found the video: http://spectrum.ieee.org/automaton/robot=\r\nics/robotics-software/bizarre-soft-robots-evolve-to-run\n&gt; &gt; &gt; \n&gt; &gt; &gt; \n&gt; &gt; &gt;=\r\n Best regards,\n&gt; &gt; &gt; Jeff Clune\n&gt; &gt; &gt; \n&gt; &gt; &gt; Assistant Professor\n&gt; &gt; &gt; Comp=\r\nuter Science\n&gt; &gt; &gt; University of Wyoming\n&gt; &gt; &gt; jeffclune@\n&gt; &gt; &gt; jeffclune.c=\r\nom\n&gt; &gt; &gt;\n&gt; &gt; \n&gt; &gt;\n&gt;\n\n\n\n"}}