{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[{"name":"READ"}]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"userId":7192225,"authorName":"Ian Badcoe","from":"Ian Badcoe &lt;ian_badcoe@...&gt;","profile":"ian_badcoe","replyTo":"LIST","senderId":"9mKiOeO1MurU6JYiksw7sOKhqNe57e_cvDfnMc1iPUaiFxUeTa2b7nxPZ9gg6kBBWVKsCQQRAinGUHDCSx_W-KNNj_nz1xMigro","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [neat] Re: Multiple networks","postDate":"1080818453","msgId":605,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDUuMi4xLjEuMC4yMDA0MDMzMTExMjkxMy4wMGJiY2NkOEBwb3AubWFpbC55YWhvby5jby51az4=","inReplyToHeader":"PGM0ZTQxNiszNDFhQGVHcm91cHMuY29tPg==","referencesHeader":"PDUuMi4xLjEuMC4yMDA0MDMyNjExMTQzMC4wMTg1N2NhMEBwb3AubWFpbC55YWhvby5jby51az4="},"prevInTopic":591,"nextInTopic":0,"prevInTime":604,"nextInTime":606,"topicId":514,"numMessagesInTopic":16,"msgSnippet":"... Hi, Although I m seriously considering Hayek as source material for techniques I will experiment with, I only thought about this so far, I didn t","rawEmail":"Return-Path: &lt;ian_badcoe@...&gt;\r\nX-Sender: ian_badcoe@...\r\nX-Apparently-To: neat@yahoogroups.com\r\nReceived: (qmail 17615 invoked from network); 1 Apr 2004 11:21:00 -0000\r\nReceived: from unknown (66.218.66.172)\n  by m4.grp.scd.yahoo.com with QMQP; 1 Apr 2004 11:21:00 -0000\r\nReceived: from unknown (HELO smtp005.mail.ukl.yahoo.com) (217.12.11.36)\n  by mta4.grp.scd.yahoo.com with SMTP; 1 Apr 2004 11:20:59 -0000\r\nReceived: from unknown (HELO xp-410.yahoo.co.uk) (ian?badcoe@212.159.73.108 with login)\n  by smtp005.mail.ukl.yahoo.com with SMTP; 1 Apr 2004 11:20:57 -0000\r\nMessage-Id: &lt;5.2.1.1.0.20040331112913.00bbccd8@...&gt;\r\nX-Sender: ian_badcoe@...\r\nX-Mailer: QUALCOMM Windows Eudora Version 5.2.1\r\nDate: Thu, 01 Apr 2004 12:20:53 +0100\r\nTo: neat@yahoogroups.com\r\nIn-Reply-To: &lt;c4e416+341a@...&gt;\r\nReferences: &lt;5.2.1.1.0.20040326111430.01857ca0@...&gt;\r\nMime-Version: 1.0\r\nContent-Type: text/plain; charset=&quot;us-ascii&quot;; format=flowed\r\nX-eGroups-Remote-IP: 217.12.11.36\r\nFrom: Ian Badcoe &lt;ian_badcoe@...&gt;\r\nSubject: Re: [neat] Re: Multiple networks\r\nX-Yahoo-Group-Post: member; u=7192225\r\nX-Yahoo-Profile: ian_badcoe\r\n\r\nAt 09:46 31/03/2004 +0000, you wrote:\n&gt;Hi Ian, I&#39;ve read the first few sections of the Baum paper in detail\n&gt;and it&#39;s really fascinating stuff.  I want to implement a system\n&gt;like this with NEAT.  Of course there are logistical questions about\n&gt;putting NEAT inside such a system, because Hayek wants control of\n&gt;who gets to reproduce but so does NEAT..so it would have to be\n&gt;resolved.\n&gt;\n&gt;One thing I wonder is how the system deals with bidding\n&gt;inconsistency.  The function that is used to determine the bid value\n&gt;is potentially quite complex, meaning that a bidder that makes\n&gt;several rational bids can later make a totally crazy bid that makes\n&gt;no sense.  Thus, such a system can be noisy and constantly needing\n&gt;to reorganize.  How serious do you see this problem?\n\nHi,\n         Although I&#39;m seriously considering Hayek as &quot;source material&quot; for \ntechniques I will experiment with, I only thought about this so far, I \ndidn&#39;t implement anything.  And from experience I know very well that \nimplementing something always reveals 2-3 nasty holes in the theory you \nthought you knew.\n\n         So what you ask is a classical example of a hole in what I&#39;d \nthought through.  It&#39;s a very good point, and maybe I misread Eric&#39;s intent \n-- he did, after all, always use fixed bids in his experiments.\n\n         I think I&#39;ll ask him, he hangs out there \n(genetic_programming@yahoogroups.com).\n\n         There is some control, they are not allowed to bid more than they \nown and maybe not more than the reward for the objective (if known).\n\n         Beyond that, a few new thoughts occur to me (sorry for \nstream-of-consciousness format):\n\n1) what you have spotted is an additional cost to using function-bids over \nfixed-bids -- e.g. that functional bids will take more generations to \nevolve, precisely because it will take along while to eliminate any \nindividuals with rare aberrant bidding behaviour\n\n2) one could maybe limit this problem by having a separately evolving \nmax-bid parameter on each individual\n\n3) the pattern-recognition approach (which Eric&#39;s examples use to choose \ny/n on a fixed, evolved bid) has an advantage in this, because I can \nimagine it easier to evolve a pattern matching certain cases (certainly a \nsubset of ones the individual&#39;s strategy could _theoretically_ be applied \nto) than to evolve a correct bid for any case\n\n4) you could use pattern-recognition and function-bids -- so that the \nfunction would not be called on to bid outside its &quot;expertise&quot;\n\n5) or you could use a network for pattern recognition (in addition to one \nfor making actions and maybe one for bidding)\n\n6) or it may just be, that in a system with function-bids, the overall \nsystem of interacting bids becomes more chaotic -- this brings us back to \nthe problem I listed before, where a &quot;rogue trader&quot; can bankrupt the whole \nsystem, requiring one to rewind the whole universe and try again.  It&#39;s a \nreal problem if the universe cannot be rewound, which it cannot, for \nexample, if it contains another evolved system...\n\n7) but all in all I think I&#39;m starting to like fixed bids for simple cases \n(of course, I don&#39;t like simple cases...)\n\nThis all ties in to (what I believe are) the other weaknesses of Hayek.  I \ndon&#39;t mean weaknesses in any sort of critical sense, but there are areas it \nnaturally addresses, and others it does not.\n\na - convoluted objectives -- if an objective may not be achievable, then in \norder to know whether to bid on working towards it, an individual would \nneed to know whether the individuals which followed it were going to \nsucceed (or bid highly)\n\nb - pleasure and pain -- in a complex environment, positive and negative \nstimuli can be expected.  Some of these will be the results of (chains of) \nindividual actions and need to be credited to an individual (the last in \nthe chain; if the system is working on multiple objectives then there may \nbe a separate chain for each one; the concpet of a &quot;chain&quot; only exists to \nthe human observer).  I don&#39;t see how to determine which individual(s) \nreceive positive stimuli.  Negative stimuli are even worse, as there&#39;s no \namortization of the cost along the chain -- one &quot;mug&quot; gets the whole blame...\n\nc - internal state -- as well as performing acts on the world, it can be \nusefuly for an individual to perform acts internal tot he system.  An \nexample might be calculating the average of some data and storing it.  The \nexistence of such calculated data in the systems internal store could be \nregarded as increasing the value of the world and thus providing profit to \nthe individual that calculated it, but as a general principal, can we \nexpect that &quot;averaging module&quot; to know whether some other module wants an \naverage or not?  I&#39;ve wondered at the need for a &quot;commissioning&quot; system, \nwhere one individual can request data and offer payment for it...\n\nd - multiple objectives -- For simple cases, Hayek, scales well to multiple \nobjectives, as each individual simply bids for how much value it thinks it \ncan contribute to whichever objective it likes -- so the most \nprofitable/progressable objective is automatically estimated.  However, if \nthe case becomes more complex, especially if there is a wide choice of \nsimilar objectives, then deciding which to pursue becomes a hard problem \nmuch as in (a)\n\n         Anyway, that&#39;s my take, my hope is that, having identified these \nlimits, eventually I&#39;ll arrive at a reformulation which addresses them \nintrinsically..\n\n         Hope this vague verbosity helps,\n\n                 Ian Badcoe\n\n\n\n\nLiving@Home - Open Source Evolving Organisms - \nhttp://livingathome.sourceforge.net/\n\n\n\n\n"}}