{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[{"name":"READ"}]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"userId":54567749,"authorName":"Ken","from":"&quot;Ken&quot; &lt;kstanley@...&gt;","profile":"kenstanley01","replyTo":"LIST","senderId":"UFWB6qQaZSqNMffcW_JUZjQzx38yFPReXRH630V7JCKWtUcA22CoU-RpkQ6WRcDONam6oOJ5zct44dCeJfHBHX80aYH9","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: GECCO Paper on HyperNEAT","postDate":"1367898211","msgId":6086,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGttOXQ5MyszYnBsQGVHcm91cHMuY29tPg==","inReplyToHeader":"PENBQ0Q4b3hXSnJSWVZxTEd1cDdqQTV0RkpObW9CZjI0d1ZRNzl0RkR1c0h6WXREMkU3UUBtYWlsLmdtYWlsLmNvbT4="},"prevInTopic":6085,"nextInTopic":6097,"prevInTime":6085,"nextInTime":6087,"topicId":6085,"numMessagesInTopic":14,"msgSnippet":"Hi All, Thomas and Shimon were gracious enough to share with me this paper early on, so I have had time to consider its implications.  Both Thomas and Shimon","rawEmail":"Return-Path: &lt;kstanley@...&gt;\r\nX-Sender: kstanley@...\r\nX-Apparently-To: neat@yahoogroups.com\r\nX-Received: (qmail 68006 invoked from network); 7 May 2013 03:43:34 -0000\r\nX-Received: from unknown (10.193.84.151)\n  by m7.grp.bf1.yahoo.com with QMQP; 7 May 2013 03:43:34 -0000\r\nX-Received: from unknown (HELO ng8-vm5.bullet.mail.gq1.yahoo.com) (98.136.219.96)\n  by mta5.grp.bf1.yahoo.com with SMTP; 7 May 2013 03:43:33 -0000\r\nX-Received: from [98.137.0.83] by ng8.bullet.mail.gq1.yahoo.com with NNFMP; 07 May 2013 03:43:33 -0000\r\nX-Received: from [10.193.94.41] by tg3.bullet.mail.gq1.yahoo.com with NNFMP; 07 May 2013 03:43:32 -0000\r\nDate: Tue, 07 May 2013 03:43:31 -0000\r\nTo: neat@yahoogroups.com\r\nMessage-ID: &lt;km9t93+3bpl@...&gt;\r\nIn-Reply-To: &lt;CACD8oxWJrRYVqLGup7jA5tFJNmoBf24wVQ79tFDusHzYtD2E7Q@...&gt;\r\nUser-Agent: eGroups-EW/0.82\r\nMIME-Version: 1.0\r\nContent-Type: text/plain; charset=&quot;ISO-8859-1&quot;\r\nContent-Transfer-Encoding: quoted-printable\r\nX-Mailer: Yahoo Groups Message Poster\r\nX-Yahoo-Newman-Property: groups-compose\r\nX-eGroups-Msg-Info: 1:12:0:0:0\r\nFrom: &quot;Ken&quot; &lt;kstanley@...&gt;\r\nSubject: Re: GECCO Paper on HyperNEAT\r\nX-Yahoo-Group-Post: member; u=54567749; y=Z3wsXo9L91bEgtl0-wjbCkep5Oi3Qo8sGkuD7uXwOrwDFi2Y46Pi\r\nX-Yahoo-Profile: kenstanley01\r\n\r\n\n\nHi All,\n\nThomas and Shimon were gracious enough to share with me this pap=\r\ner early on, so I have had time to consider its implications.  Both Thomas =\r\nand Shimon know that I take serious issue with one of its claims (regarding=\r\n &quot;fracture&quot;), so it will be no surprise to them that I am sharing with you =\r\nmy concerns.  For brevity I will refer to Thomas and Shimon as V&W here (th=\r\ne first initials of their last names).  I made a short and long version of =\r\nthis response for people who might have different amounts of time to read i=\r\nt.\n\n_________________________ \nShort version:\n\nV&W conclude that HyperNEAT =\r\n(and hence CPPNs) has a problem with an important property called &quot;fracture=\r\n.&quot;  I disagree with this conclusion and think the evidence offered for it i=\r\ns misleading.  Therefore, I made a website showing many examples of fractur=\r\ne in HyperNEAT as counter-evidence.  You may find this site interesting eve=\r\nn if you do not know about fracture because it shows internal representatio=\r\nns inside CPPNs (lots of pictures) that few have seen before:\n\nhttp://eplex=\r\n.cs.ucf.edu/hyperNEATpage/content/cppn_fracture.html\n\n_____________________=\r\n_\nLonger version:\n\n\nThe paper is divided into two parts:  In the first part=\r\n, V&W attempt three simple benchmarks with HyperNEAT and find that it fails=\r\n on slightly more complex variants, suggesting that it may have a problem w=\r\nith a lower level of problem complexity than one would expect.  I have less=\r\n issue with this part, as it is indeed worth reporting where a method has t=\r\nrouble, and could lead us to insights about why it has such trouble.    (My=\r\n bigger concerns are with the second half of the paper, on fracture.)\n\nThe =\r\nonly potential problem with the first half of the paper is that two of the =\r\nthree experiments are run in a version of HyperNEAT the authors created the=\r\nmselves, called peasNEAT (https://github.com/noio/peas).  We are not yet su=\r\nre whether peasNEAT has any fundamental implementation errors, but myself a=\r\nnd colleagues have been examining peasNEAT just to make sure we can learn f=\r\nrom its results.  What we have found at this preliminary stage is that peas=\r\nNEAT indeed contains a number of significant deviations (and maybe bugs) fr=\r\nom normal implementations of HyperNEAT (most with respect to the CPPN imple=\r\nmentation) that may account for its performance difficulties.  However, we =\r\nare not yet sure if it would change the results to fix these issues, so we =\r\ndo not yet want to imply one way or another - just something to keep in min=\r\nd when thinking about these negative results at this point.  Of course we w=\r\nill be transparent on our findings once we finish analyzing the system and =\r\nwe are not suggesting anything at this time.\n\nHowever, like I said my big c=\r\noncern is much more with the latter half.  To make the paper more fundament=\r\nal than just a few negative results, V&W needed a hypothesis to explain the=\r\n alleged bad performance of HyperNEAT on these problems, and my feeling (as=\r\n they know) is that their hypothesis is dangerously wrong and if accepted a=\r\nt face value would lead the field significantly astray.  In short, they sug=\r\ngest that HyperNEAT (and hence CPPNs) has big problems representing somethi=\r\nng called &quot;fracture.&quot;  Fracture is defined as &quot;discontinuous variation of p=\r\natterns.&quot;  They conclude that this type of pattern is &quot;highly problematic f=\r\nor HyperNEAT.&quot;\n\nV&W needed some kind of unifying insight to explain the neg=\r\native results from their first half, but this insight is the wrong one, whi=\r\nch is unfortunate because it is supported by misleading quantitative result=\r\ns (once again we may be seeing the danger of our field&#39;s heavy trust in qua=\r\nntification).  But these quantitative results are exactly what we have been=\r\n discussing (on this group) as being one of the Achilles&#39; heels of this typ=\r\ne of quantitative evolutionary experiment:  To show that HyperNEAT is bad a=\r\nt fracture they run a set of target-based experiments (again with peasNEAT)=\r\n in which HyperNEAT&#39;s objective is to match an arbitrary fractured pattern =\r\nof weights.  It would be expected based on my work with Woolley that HyperN=\r\nEAT would perform poorly at such a task.  At the same time, a more direct s=\r\ntyle of encoding based on wavelets (which they use for comparison) does bet=\r\nter.  It is not a surprise that a more direct encoding would be better at c=\r\nreating a copy of an arbitrary target pattern, but it would have few or non=\r\ne of the good properties of indirect encoding (e.g. compositionality, elabo=\r\nration of regularity, etc.).  \n\nMost concerning for me is that the hypothes=\r\nis about fracture rests solely upon the most misleading kind of target-base=\r\nd experiment.  I am still trying to understand how V&W could cite my paper =\r\nwith Brian Woolley (&quot;On the Deleterious Effects of A Priori Objectives on E=\r\nvolution and Representation&quot;) in their background section without any hint =\r\nof disagreement, yet later in the paper so explicitly violate every ounce o=\r\nf caution on target-based experiments that it suggests.  In any case, I&#39;ve =\r\nbeen expecting that sooner or later someone would probably suggest a mislea=\r\nding principle based on such a faulty target-based premise.  Since it seems=\r\n to have happened now, it is important to try to show that the conclusions =\r\nare wrong.\n\nTo be clear:  I have no problem with suggestions that HyperNEAT=\r\n may not perform well in some domains.  These are entirely fair game.  My p=\r\nroblem is with the hypothesis given about *why* some domains fare poorly wi=\r\nth HyperNEAT.\n\nBecause I believe it is important to set the record straight=\r\n that HyperNEAT and CPPNs are both good experimental platforms for observin=\r\ng fracture, I have made a page full of pictures and examples of explicit fr=\r\nacture in CPPNs.  (Like I said, I&#39;ve had some time to prepare this page sin=\r\nce I&#39;ve known about the paper for a few weeks.)  Even for those not particu=\r\nlarly interested in the argument about fracture, you might still find this =\r\nweb page interesting because it shows some fascinating (at least to me) obs=\r\nervations that few people have seen before about the internal elegance of C=\r\nPPN representations:\n\nhttp://eplex.cs.ucf.edu/hyperNEATpage/content/cppn_fr=\r\nacture.html\n\nOne of the ironies of this paper for me is that the very thing=\r\n it alleges &quot;highly problematic&quot; for CPPNs is one of the main things that m=\r\nake CPPNs so interesting.  There is literally a treasure trove of data on r=\r\nepresentation in CPPNs sitting on Picbreeder =96 thousands of patterns all =\r\nof whose CPPNs are directly visible to the public through the Picbreeder DN=\r\nA tool.  The internals of these CPPNs and what they tell us about represent=\r\nation hold a wealth of undiscovered lessons, many of them (ironically) on h=\r\now fracture is represented in sophisticated encodings.  To date, observatio=\r\nns taken with the DNA tool have not been studied formally, but as you can s=\r\nee at the site above, every image on the Picbreeder site (and probably Endl=\r\ness Forms as well) can teach us surprising lessons on representation.   \n\nI=\r\nn that sense, while the second half of V&W&#39;s paper is counterproductive and=\r\n misleading in my opinion, perhaps some good still comes from this opportun=\r\nity it creates to share with you the remarkable kinds of fracture that have=\r\n evolved in CPPNs, and perhaps to begin to open a discussion on what that t=\r\neaches us about indirect encoding and representation.\n\nWith regard to the c=\r\nhallenging problems for HyperNEAT alleged by Thomas and Shimon&#39;s paper, mys=\r\nelf and my group and colleagues still need to complete an analysis to decid=\r\ne whether there are any useful lessons to draw (though an inherent problem =\r\nwith fracture in CPPNs will likely not be the lesson).  If there is a probl=\r\nem, it is most likely a classic stepping-stone paradox: The solution does n=\r\not look like the steps that lead to the solution.  In cases like that, prob=\r\nlems that look not-so-hard can turn out deceptive in unexpected ways.  If t=\r\nhat is the case in some or all three domains, then that is certainly intere=\r\nsting and could perhaps be remedied with something like novelty search or n=\r\novelty-based multiobjectivization.  But right now I am holding off on drawi=\r\nng any conclusions because we are not yet certain whether the peasNEAT impl=\r\nementation of HyperNEAT is without a bug (which would be a less interesting=\r\n explanation).\nIn any case I hope you will take a look at the fracture webs=\r\nite and enjoy some of the images there.   \n\nI should finally note that Shim=\r\non, Thomas and I remain on good terms personally and that this is an entire=\r\nly professional disagreement (with regards to the fracture hypothesis).  I =\r\nwish both Shimon and Thomas the best and appreciate their desire to discove=\r\nr more about HyperNEAT.  \n\nBest,\n\nken\n\n\n--- In neat@yahoogroups.com, Thomas=\r\n van den Berg &lt;paranoid.ndroid@...&gt; wrote:\n&gt;\n&gt; Dear Colleagues,\n&gt; \n&gt; The pa=\r\nper &quot;Critical Factors in the Performance of HyperNEAT&quot;, written by\n&gt; Shimon=\r\n Whiteson and me, was accepted for GECCO2013. It is based on the work\n&gt; tha=\r\nt I did (and am doing) for the thesis for my MSc. A.I., on the topic of\n&gt; H=\r\nyperNEAT.\n&gt; \n&gt; This paper presents a series of experiments designed to exam=\r\nine the\n&gt; critical factors for its success. First, we determine the fewest =\r\nhidden\n&gt; nodes a genotypic network needs to solve several of these tasks. O=\r\nur\n&gt; results show that all of these tasks are easy: they can be solved with=\r\n at\n&gt; most one hidden node and require generating only trivial regular patt=\r\nerns.\n&gt; Then, we examine how HyperNEAT performs when the tasks are made har=\r\nder. Our\n&gt; results show that HyperNEAT&#39;s performance decays quickly: it fai=\r\nls to solve\n&gt; all variants of these tasks that require more complex solutio=\r\nns. Next, we\n&gt; examine the hypothesis that fracture in the problem space, k=\r\nnown to be\n&gt; challenging for regular NEAT, is even more so for HyperNEAT. O=\r\nur results\n&gt; suggest that quite complex networks are needed to cope with ev=\r\nen modest\n&gt; fracture and HyperNEAT has difficulty discovering them. Finally=\r\n, we connect\n&gt; these results to previous experiments showing that HyperNEAT=\r\n&#39;s performance\n&gt; decreases on irregular tasks. Our results suggest irregula=\r\nrity is an\n&gt; extreme form of fracture and that HyperNEAT&#39;s limitations are =\r\nthus more\n&gt; severe than those experiments suggested.\n&gt; \n&gt; Find it here:\n&gt; h=\r\nttp://staff.science.uva.nl/~whiteson/pubs/b2hd-vandenberggecco13.html\n&gt; \n&gt; =\r\nRegards,\n&gt; \n&gt; Thomas van den Berg\n&gt;\n\n\n\n"}}