{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[{"name":"READ"}]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"userId":130984297,"authorName":"joel278","from":"&quot;joel278&quot; &lt;lehman.154@...&gt;","profile":"joel278","replyTo":"LIST","senderId":"NNZ9ntGLu546pmIZdq1kDyOqpwTxCQLmDssEWB9R9m2Njs9VAyMtfWzV7HxZVzR_WFEfbKZ6fLjEDqzXZpkQFl8YtAjs","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: New Journal Article Explores New Hypothesis for Increasing Evolvability","postDate":"1367994479","msgId":6091,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGttY3I5Zit1dXVyQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDJDOTdGOTNCLTUwMzEtNDRGNy04NTZBLThFRTM4QjQwRkE5NUBnbWFpbC5jb20+"},"prevInTopic":6084,"nextInTopic":0,"prevInTime":6090,"nextInTime":6092,"topicId":6070,"numMessagesInTopic":8,"msgSnippet":"Hi Jeff, I m glad you enjoyed the paper and thanks for taking the time to consider its implications. I m happy to answer your questions. 1) For clarity, the","rawEmail":"Return-Path: &lt;lehman.154@...&gt;\r\nX-Sender: lehman.154@...\r\nX-Apparently-To: neat@yahoogroups.com\r\nX-Received: (qmail 93100 invoked from network); 8 May 2013 06:28:01 -0000\r\nX-Received: from unknown (10.193.84.168)\n  by m12.grp.bf1.yahoo.com with QMQP; 8 May 2013 06:28:01 -0000\r\nX-Received: from unknown (HELO ng14-ip2.bullet.mail.bf1.yahoo.com) (98.139.165.118)\n  by mta6.grp.bf1.yahoo.com with SMTP; 8 May 2013 06:28:01 -0000\r\nX-Received: from [98.139.164.121] by ng14.bullet.mail.bf1.yahoo.com with NNFMP; 08 May 2013 06:28:01 -0000\r\nX-Received: from [10.193.94.46] by tg2.bullet.mail.bf1.yahoo.com with NNFMP; 08 May 2013 06:28:01 -0000\r\nDate: Wed, 08 May 2013 06:27:59 -0000\r\nTo: neat@yahoogroups.com\r\nMessage-ID: &lt;kmcr9f+uuur@...&gt;\r\nIn-Reply-To: &lt;2C97F93B-5031-44F7-856A-8EE38B40FA95@...&gt;\r\nUser-Agent: eGroups-EW/0.82\r\nMIME-Version: 1.0\r\nContent-Type: text/plain; charset=&quot;ISO-8859-1&quot;\r\nContent-Transfer-Encoding: quoted-printable\r\nX-Mailer: Yahoo Groups Message Poster\r\nX-Yahoo-Newman-Property: groups-compose\r\nX-eGroups-Msg-Info: 1:12:0:0:0\r\nFrom: &quot;joel278&quot; &lt;lehman.154@...&gt;\r\nSubject: Re: New Journal Article Explores New Hypothesis for Increasing Evolvability\r\nX-Yahoo-Group-Post: member; u=130984297; y=g2G3w8M5g8MxOHUVDIuELwOlFBsz2BCB1AxNkYVYFkXW1mxozckm\r\nX-Yahoo-Profile: joel278\r\n\r\n\n\n\n\n\nHi Jeff,\n\nI&#39;m glad you enjoyed the paper and thanks for taking the tim=\r\ne to consider its implications. I&#39;m happy to answer your questions. \n\n1) Fo=\r\nr clarity, the assumption directly quoted from the paper is only about whet=\r\nher evolvability is heritabile; in general, I think that assumption often h=\r\nolds and is not what you are disputing.\n\nWhat you are questioning is whethe=\r\nr the mechanisms towards evolvability we demonstrate in the paper have any =\r\nreal-world effect or if they are simply overridden by optimization pressure=\r\n against evolvability (through pressure to converge upon some local fitness=\r\n peak, which might select against any deviation). This is an interesting qu=\r\nestion, open to speculation. Ultimately, I do not think the answer is abund=\r\nantly clear either way; if in each niche there was some sort of &#39;race&#39; betw=\r\neen optimization and evolvability, those individuals diverging through nich=\r\nes faster than optimization tamed them would yet gain from the founder effe=\r\nct -- of course if the taming pressure was so strong that no one could ever=\r\n escape you are right, the founder effect would be stymied and no new niche=\r\ns would ever be discovered. However, because nature seems quite good at spr=\r\neading through niches, this does not seem to be the case. Also, because nic=\r\nhes in nature are not purely static any pressure against evolvability from =\r\nfitness optimization may be further mitigated.\n\nBut even asking if the mech=\r\nanisms for evolvability in the paper are generally impeded interestingly hi=\r\nghlights that an important contribution of the paper may be to demonstratat=\r\ne that increasing evolvability may be the background null hypothesis, which=\r\n is an interesting shift. In other words, your argument suggests that the c=\r\nurrent question of &#39;why is evolvability so widespread,&#39; may move towards &#39;w=\r\nhat forces impede the innate tendency towards evolvability&#39;? And one potent=\r\nial such impeding force is given by the fitness-optimization argument you m=\r\nake. But even if fitness pressure does turn out to often impede the non-ada=\r\nptive mechanisms for evolvability from the paper, it is still interesting n=\r\nonetheless that the drive towards evolvability may be more fundamental than=\r\n previously thought. \n\nIn my mind, it seems a much more elegant explanation=\r\n if evolvability is fundamental and that is the reason it seems to increase=\r\n, rather than that it is fundamental, but is opposed by one type of adaptiv=\r\ne pressure, and only enabled by additional specific forms of adaptive press=\r\nure (because you then still need an explanation for why evolvability appear=\r\ns to have increased). Of course, elegance can be deceiving, and overall my =\r\nintuition that fitness-pressure does not dominate the mechanisms we show in=\r\n the paper likely reflects my novelty-search influenced perspective: That e=\r\nvolution as a whole is more a story of discovering a growing diversity of w=\r\nays to make a living than it is of static optimization towards local optima=\r\n.\n\nMore concretely, to address your concerns about mutation rates, I think =\r\nit is first important to distinguish between *genotypic* mutation rates and=\r\n the resulting *phenotypic* variability such mutation generates. In the abs=\r\ntract model in the paper, evolvability is encoded as the probability for an=\r\n organism to change its niche, which is not generally the same as a genotyp=\r\nic mutation rate (although for simplicity they are are equated in that mode=\r\nl). In the concrete ER models, for example, evolvability is an implicit fun=\r\nction of the ANN&#39;s architecture, which is perhaps more similar to nature, w=\r\nhere a genotypic mutation&#39;s phenotypic effect often results from a complex =\r\ndevelopmental process. So even if mutation rates are dialed down low by opt=\r\nimization pressure, those mutations may yet cause significant phenotypic ef=\r\nfect; and perhaps some of that significant phenotypic effect might be neutr=\r\nal with respect to reproductive success (for example, one can imagine that =\r\nsome heritable differences in human height might yet have negligible impact=\r\ns on biological success). In this way, phenotypic variability may still be =\r\nhigh even if mutation rates are driven down, and differences in such variab=\r\nility may still enable more evolvable lineages to be more likely to found n=\r\new niches.\n\nSo I think while it may be true that pressure to optimize fitne=\r\nss in nature may sometimes oppose evolvability, it is not clear that this w=\r\nill often dominate evolvability, that static optimization is the predominan=\r\nt paradigm for evolution within niches, or that selection for decreased mut=\r\nation rates need always select against phenotypic variability. \n\n2) It is t=\r\nrue that there is no consensus on how to define evolvability; however I&#39;d a=\r\nrgue that there is a growing shift in the literature (or at least a growing=\r\n openness) towards considering evolvability more generally, in terms of phe=\r\nnotypic variability, and not only limited to considering evolvability in te=\r\nrms of adaptive changes. Whereas measuring phenotypic variability can be so=\r\nmewhat context-independent, tying evolvability to adaptation means that evo=\r\nlvability becomes dependent upon particular situations, and that what is ev=\r\nolvable today may not be evolvable tomorrow. I would argue that a complex a=\r\nnimal like a human is evolvable in some sort of absolute way. It may also b=\r\ne that a person&#39;s preference for definition may reflect whether one sees ev=\r\nolution more as an optimization process or as a discovery process.\n\nAs to h=\r\now adopting a more adaptive measure would affect the interpretation of the =\r\npaper -- it is not clear. The adaptive style of definition doesn&#39;t seem to =\r\nquite apply to the models in the paper because there is no way to outcompet=\r\ne other organisms within particular niches. I suppose that if you mandate t=\r\nhat evolvability must relate to adaptive changes, then it may become imposs=\r\nible to consider models without adaptive pressure in them, because that def=\r\ninition only makes sense then with some sort of adaptive context. This seem=\r\ns strange to me, it doesn&#39;t seem like evolvability should change with the w=\r\neather.\n\n3) It is true that the organisms can mutate in any direction and t=\r\nhat oftentimes an evolvable organism will land end up near the starting nic=\r\nhe; but the bias is that more often than not the far-flung ones will be the=\r\n more evolvable ones. The reason you don&#39;t see some hiccups in Fig 3. is th=\r\nat it is averaged over many runs, as is Fig. 2. Any one run would likely ha=\r\nve some of the variance you are describing.\n\nI hope you find these answers =\r\ninteresting, I enjoy thinking about the sorts of questions you&#39;ve raised, i=\r\nn particular, how fitness pressure may interact with the evolvability mecha=\r\nnisms in the paper. Thanks again for taking the time to read the paper and =\r\nraise these well-informed questions.\n\nBest,\nJoel\n\n--- In neat@yahoogroups.c=\r\nom, Jeff Clune &lt;jclune@...&gt; wrote:\n&gt;\n&gt; Hello Joel and Ken,\n&gt; \n&gt; Congrats on=\r\n the excellent paper. I enjoyed it. \n&gt; \n&gt; Congrats also on the nice press c=\r\noverage. My weekly KurzweilAI.net email this week has your article featured=\r\n!\n&gt; \n&gt; http://www.kurzweilai.net/a-new-spin-on-origins-of-evolvability-surv=\r\nival-of-the-evolvable?utm_source=3DKurzweilAI+Weekly+Newsletter&utm_campaig=\r\nn=3Df2d8f1bc7d-UA-946742-1&utm_medium=3Demail&utm_term=3D0_147a5a48c1-f2d8f=\r\n1bc7d-282027325\n&gt; \n&gt; (nice office Ken)\n&gt; \n&gt; I have a three questions, two h=\r\nigher-level and one pedantic.\n&gt; \n&gt; 1) You write: &quot;Thus if the assumption of=\r\n evolvability&#39;s heritability holds, then such founder effects in establishi=\r\nng new niches may yield a persistent bias towards increasing evolvability =\r\n=96 even in the absence of adaptive competition between organisms.&quot;\n&gt; \n&gt; My=\r\n guess is that this assumption doesn&#39;t hold across many generations in the =\r\nscenario you outline. Your model, especially the limited capacity model, aw=\r\nards permanent winner status to the founder (if I understand it correctly),=\r\n but obviously that does not happen in nature. In nature, once a niche is f=\r\nounded, there is no pressure (for those orgs staying in the niche) to retai=\r\nn their evolvability (assuming a relatively static environment). As my muta=\r\ntion rates paper shows (http://goo.gl/I8r40), once a population is on a loc=\r\nal fitness peak there is a strong pressure to lower the mutation rate (whic=\r\nh in your model is the same thing as evolvability). Offspring of the founde=\r\nr with lower mutRates/evolvability would have higher average fitness than o=\r\nffsprings with the original, elevated mutRate/evolvability, thus leading to=\r\n a lowering of mutation rates/evolvability across generations. If that is r=\r\night, it would erase this founder effect and eliminate the appearance of ev=\r\nolvability even when averaging across niches, no? In other words, you&#39;d onl=\r\ny see this elevation in newly occupied niches, which would be a small fract=\r\nion of the total number of niches after millennia. In short, while I agree =\r\nwith this clever demonstration that evolvability can increase without selec=\r\ntion, it could be the case that selection itself eliminates this sort of ev=\r\nolvability effect, leaving us still searching for how nature generates and =\r\nmaintains evolvability. You could test this by trying your same experiments=\r\n in the abstract model, but on a rugged fitness landscape (e.g. Rastrigin),=\r\n and I&#39;m confident you&#39;d see the mutation rate/evolvability go to near zero=\r\n (that&#39;s effectively the exact experiment I did in my PLoS Comp Bio paper).=\r\n That result would jive with your belief that selection may actually preclu=\r\nde evolvability and be a hinderance to open-ended evolution, but it may als=\r\no mean that the effect you point out is not a major explanation of evolvabi=\r\nlity in the natural world where selection is a powerful force. I hope I don=\r\n&#39;t come across as someone trying to diminish the importance of your work; i=\r\nnstead I am trying to understand how far I can extrapolate it to the natura=\r\nl world. \n&gt; \n&gt; 2) You repeatedly mention that you are using one of many def=\r\ninitions of evolvability, defining it as synonymous with phenotypic variabi=\r\nlity. I got the impression that you were arguing for one definition of evol=\r\nvability from a set of common ones, perhaps even a less common one. I usual=\r\nly think of evolvability as certain kinds of phenotypic variability (e.g. e=\r\nvolution produces the subset of variants that have a higher average fitness=\r\n than the entire set of possible variants). What would the implications for=\r\n your paper be if you adopted that (I believe more common) definition of ev=\r\nolvability? Are there other major definitions of evolvability that you enco=\r\nuntered in your literature search? If so, does adopting them change the int=\r\nerpretation of your paper?\n&gt; \n&gt; 3) Here&#39;s the pedantic question. In your ab=\r\nstract model (not the limited capacity model, the unlimited one), I assume =\r\nthat mutations can move an org one step in any direction, including back to=\r\nward the center. Given that, shouldn&#39;t a higher mutation rate just mean a l=\r\narger variance around the origin? Random walks, after all, still have an av=\r\nerage location of their starting point. If so, I agree that the  far-flung =\r\nniches would disproportionately have high evolvability, but I would also ex=\r\npect to see greater variance in evolvability in the central niches than the=\r\n distant niches...but that&#39;s the opposite of Fig. 3. If each organism is on=\r\n a random walk, and higher evolvability means a faster pace, then you would=\r\n have lots of these faster organisms traversing back and forth across the c=\r\nenter too, but you don&#39;t see any of those orgs in Fig. 3. I am sure I am mi=\r\nsunderstanding something, and it is probably trivial, but I just wanted to =\r\nask in case my misunderstanding is making me not fully appreciate your work=\r\n. \n&gt; \n&gt; Congratulations again. I&#39;m still thinking about all of the implicat=\r\nions of the paper. \n&gt; \n&gt; Best regards,\n&gt; Jeff Clune\n&gt; \n&gt; Assistant Professo=\r\nr\n&gt; Computer Science\n&gt; University of Wyoming\n&gt; jeffclune@...\n&gt; jeffclune.co=\r\nm\n&gt; \n&gt; On Apr 26, 2013, at 7:04 PM, joel278 &lt;lehman.154@...&gt; wrote:\n&gt; \n&gt; &gt; =\r\n\n&gt; &gt; \n&gt; &gt; Hi Martin,\n&gt; &gt; \n&gt; &gt; Your illustration (http://www.martinpyka.de/w=\r\np-content/uploads/2013/04/evolvability.png) is very helpful in teasing apar=\r\nt how undirected genetic mutations (interpreting the isocloud on the left a=\r\ns the genetic space) can yet produce structured phenotypic changes (interpr=\r\neting the image on the right as the corresponding changes in the phenotype)=\r\n through an evolvable genotype-phenotype map. \n&gt; &gt; \n&gt; &gt; Thanks for taking t=\r\nhe effort to create the image, which also clarifies how canalization can wo=\r\nrk to potentially enhance evolvability. I am learning much from this discus=\r\nsion too.\n&gt; &gt; \n&gt; &gt; Joel\n&gt; &gt; \n&gt; &gt; --- In neat@yahoogroups.com, &quot;martin_pyka&quot;=\r\n &lt;martin.pyka@&gt; wrote:\n&gt; &gt; &gt;\n&gt; &gt; &gt; Hi Joel,\n&gt; &gt; &gt; \n&gt; &gt; &gt; thanks for your fa=\r\nst response which addressed exactly my inquiry. \n&gt; &gt; &gt; \n&gt; &gt; &gt; First, I want=\r\n to clarify that even if evolvability can reach a maximum the conclusion of=\r\n your paper is correct that it can emerge without any pressure for adaptati=\r\non in the individuals. In this regard, my question whether a maximum of evo=\r\nlvability exists was more of general nature.\n&gt; &gt; &gt; \n&gt; &gt; &gt; &gt; The way I think=\r\n about it currently is that perhaps there is no ultimate tension, and that =\r\nevolvability can generally increase without limit. The reason is that canal=\r\nization of low-level mechanisms can act to increase evolvability. For examp=\r\nle, many of the mechanisms behind development are heavily conserved, but ca=\r\nn generate much phenotypic variability through being combined and modulated=\r\n in various ways. In other words, modulating conserved features of developm=\r\nent gives evolution higher-level levers that enable small genetic changes t=\r\no be amplified and have a large meaningful phenotypic effect. Thus through =\r\ncontinued evolution of the genotype/phenotype map, perhaps evolvability can=\r\n continually increase (through exploiting canalization of lower-level mecha=\r\nnisms to generate increasingly high-level features).\n&gt; &gt; &gt; \n&gt; &gt; &gt; Yep, when=\r\n I read this I noted that this is actually also my opinion about generative=\r\n encodings. From this perspective, I would also assume that evolvability ca=\r\nn continuously increase in the sense that the genome can become more powerf=\r\nul (or more flexible) in generating new meaningful phenotypes. Maybe my imp=\r\nlicit assumption was not correct that evolvability in a phenotype map could=\r\n be depicted as iso-oriented point-cloud:\n&gt; &gt; &gt; \n&gt; &gt; &gt; left image in http:/=\r\n/www.martinpyka.de/wp-content/uploads/2013/04/evolvability.png\n&gt; &gt; &gt; \n&gt; &gt; &gt;=\r\n According to this illustration, increased evolvability would increase the =\r\nsize of the point cloud. I think I had this picture in mind when I argued i=\r\nn my previous post that evolvability cannot increase infinitely because gen=\r\notype-phenotype mappings should become instable when a certain degree of ev=\r\nolvability has been reached. However, maybe a 2d-depiction of the evolvable=\r\n phenotype-space would rather look like in the right image (I am sorry for =\r\nmy poor artwork). Through canalization, not all phenotypes in the 2d-space =\r\nare evolvable but evolvability itself can still increase!?\n&gt; &gt; &gt; \n&gt; &gt; &gt; May=\r\nbe, both pictures can also illustrate what canalization means. The left pic=\r\nture could depict all possible points in the genotype space that can be rea=\r\nched through mutation and recombination and the right image all possible po=\r\nints in the phenotype space that can be generated from it. While each bit i=\r\nn the (2d)-genotype has equal probability of been mutated, in canalized enc=\r\nodings only a well-ordered subspace of phenotypes can be reached.\n&gt; &gt; &gt; \n&gt; =\r\n&gt; &gt; Thank you for this inspiring discussion. :-) I enjoy thinking about how=\r\n all this fits together.\n&gt; &gt; &gt; \n&gt; &gt; &gt; Best,\n&gt; &gt; &gt; Martin\n&gt; &gt; &gt;\n&gt; &gt; \n&gt; &gt;\n&gt;\n\n=\r\n\n"}}