{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[{"name":"READ"}]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"userId":550414109,"authorName":"rhiever489","from":"&quot;rhiever489&quot; &lt;rhiever@...&gt;","profile":"rhiever489","replyTo":"LIST","senderId":"pUdeeJKQSpq0LuByhtIr4fz_KYO-aslUSyPixMUdvrDhQ6acrMrdgFNwTP16-IyrBciORjd2k4vzN6fx-Qp4hH2cB3VAQKM","spamInfo":{"isSpam":false,"reason":"3"},"subject":"Re: Quantitative vs. Qualitative Results","postDate":"1370112496","msgId":6106,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGtvZGZsaCs5OHA5QGVHcm91cHMuY29tPg==","inReplyToHeader":"PGtrdjdvMCt0b3RnQGVHcm91cHMuY29tPg=="},"prevInTopic":6105,"nextInTopic":6107,"prevInTime":6105,"nextInTime":6107,"topicId":6038,"numMessagesInTopic":46,"msgSnippet":"Hi Ken, The discussion going on in this thread is great. Philosophy of science is a fun topic to discuss. I would like to reiterate JBM s statements and","rawEmail":"Return-Path: &lt;rhiever@...&gt;\r\nX-Sender: rhiever@...\r\nX-Apparently-To: neat@yahoogroups.com\r\nX-Received: (qmail 36133 invoked by uid 102); 1 Jun 2013 18:48:18 -0000\r\nX-Received: from unknown (HELO mtaq4.grp.bf1.yahoo.com) (10.193.84.143)\n  by m3.grp.bf1.yahoo.com with SMTP; 1 Jun 2013 18:48:18 -0000\r\nX-Received: (qmail 6074 invoked from network); 1 Jun 2013 18:48:17 -0000\r\nX-Received: from unknown (HELO ng5-vm2.bullet.mail.bf1.yahoo.com) (98.139.164.76)\n  by mtaq4.grp.bf1.yahoo.com with SMTP; 1 Jun 2013 18:48:17 -0000\r\nX-Received: from [98.139.164.124] by ng5.bullet.mail.bf1.yahoo.com with NNFMP; 01 Jun 2013 18:48:17 -0000\r\nX-Received: from [10.193.94.109] by tg5.bullet.mail.bf1.yahoo.com with NNFMP; 01 Jun 2013 18:48:17 -0000\r\nDate: Sat, 01 Jun 2013 18:48:16 -0000\r\nTo: neat@yahoogroups.com\r\nMessage-ID: &lt;kodflh+98p9@...&gt;\r\nIn-Reply-To: &lt;kkv7o0+totg@...&gt;\r\nUser-Agent: eGroups-EW/0.82\r\nMIME-Version: 1.0\r\nContent-Type: text/plain; charset=&quot;ISO-8859-1&quot;\r\nContent-Transfer-Encoding: quoted-printable\r\nX-Mailer: Yahoo Groups Message Poster\r\nX-Yahoo-Newman-Property: groups-compose\r\nX-eGroups-Msg-Info: 2:3:4:0:0\r\nFrom: &quot;rhiever489&quot; &lt;rhiever@...&gt;\r\nSubject: Re: Quantitative vs. Qualitative Results\r\nX-Yahoo-Group-Post: member; u=550414109; y=AxWz_J3YsiWXdhCYk2dMBEohie7yTfW9C7g1X7m3TkfiVFub17k7BQ2POyZ5bs1_0P5-OeTMXDHAac8\r\nX-Yahoo-Profile: rhiever489\r\n\r\nHi Ken,\n\nThe discussion going on in this thread is great. Philosophy of sci=\r\nence is a fun topic to discuss. I would like to reiterate JBM&#39;s statements =\r\nand respond to some of the points brought up in this thread.\n\n### What do w=\r\ne have to prove? ###\n\nKen writes,\n&gt; Nevertheless, JBM says, &quot;I think that i=\r\nt is much harder to write a convincing paper without any quantitative test =\r\nthan with the help of measures/comparisons/etc.&quot;  Again, many would share t=\r\nhis sentiment.  But if you think about it, what exactly do we need to be &quot;c=\r\nonvinced&quot; of?  Why do we think science (or AI especially) is about convinci=\r\nng someone of something?  Why do we need e.g. 30 strangers to validate an i=\r\nntuition we already feel deeply that something is interesting?  The links i=\r\nn the chain of progress are from inspiration, not from convincing.  There a=\r\nre many ideas that are neither right nor wrong anyway, but worth exploring =\r\nbecause they will lead us to new revelations.  To me, capturing the essence=\r\n of nature is as much about a feeling as it is about a result.  And my expe=\r\nrience in practice bears that out.\n\nWe don&#39;t have to convince others of an =\r\nidea/finding to continue working on that research path ourselves (unless we=\r\n need funding ;-)), but we *must* convince others of that idea/finding if w=\r\ne want that work published. Even moreso if we want other people to build of=\r\nf of that idea. Convincing others of an idea/finding is core to scientific =\r\nprogress. This is why we have peer review for journals, blog posts dedicate=\r\nd to discussing research findings, regular seminars at universities, and co=\r\nnferences that are dedicated to convincing people of the validity and usefu=\r\nlness of our work.\n\nThis fact is why we need methods to prove the validity =\r\nand usefulness of our work, which I&#39;ll discuss below.\n\n### Quantitative vs.=\r\n qualitative analyses ###\n\nThe reason why qualitative results are often ins=\r\nufficient is because we are using evolution as a discovery tool. As we all =\r\nknow, by definition, evolution is a random process. This means that the res=\r\nult of a single evolutionary run could be purely due to chance, and have no=\r\nthing to do with the technique(s) presented in the paper.\n\nWhat if we show =\r\nqualitative results of multiple evolutionary runs? At that point, if the ph=\r\nenomenon is truly reproducible across replicate evolutionary runs (w/ diffe=\r\nrent seeds), then we already have a simple qualitative metric: How many rep=\r\nlicates reproduced the phenomenon. Of course, that is a weak qualitative an=\r\nalysis, but if other measures are lacking, it would still be more informati=\r\nve than saying, &quot;this technique worked once (here&#39;s a video).&quot;\n\nLet&#39;s groun=\r\nd this idea with a concrete example. Last year at ALife, one of the present=\r\ners in the Artificial Life track presented work where (they openly admitted=\r\n) that the phenomenon only occurred 1 out of 100 replicates. IOW, the resea=\r\nrcher had N=3D1. They went on to talk about how the environment shaped the =\r\nobserved phenomenon in that single replicate. Would this ever pass in any o=\r\nther field? Would *you* believe that the environment had any effect with N=\r\n=3D1? Effectively, that is what showing a qualitative result is.\n\nIn scienc=\r\ne, it is vital to show that our results are reproducible and measurable. Th=\r\nus, by that very nature, we must provide a quantitative analysis of our res=\r\nults. However, in my (and many others&#39;) view, I do not think that how the r=\r\nesults are presented is the core problem. Rather, the problem lies in how t=\r\nhe experiments are designed and the hypotheses addressed (or lack thereof).=\r\n\n\n### Hypothesis testing ###\n\nThis is an argument that was huge in the biol=\r\nogy community some 50 years ago. I refer to, e.g., &quot;Strong Inference&quot; by J =\r\nPlatt (1964). What is the best (or, most expedient) way to do science? Plat=\r\nt&#39;s paper has some great quotes, and he eloquently touches on some relevant=\r\n subjects for the very conversation we are having here.\n\nFirst, let&#39;s touch=\r\n on the culture of method development. Too much research focuses on method =\r\ndevelopment rather than testing a hypothesis that actually advances the fie=\r\nld. I&#39;ve read too many papers that say, &quot;we hypothesize that our method wil=\r\nl work in task A.&quot; That&#39;s technically a testable hypothesis, but what does =\r\ntesting that hypothesis really tell us? Has anyone outside of your work gro=\r\nup actually wondered about that question? Testing that hypothesis just show=\r\ns that our method works on task A, but like JBM said, the field as a whole =\r\ndoesn&#39;t actually learn much from it.\n\nInstead of showing that our method wo=\r\nrks on task A, we can address broader hypotheses with the method. What is i=\r\nt about our method that allows it to work on task A? For example, what fund=\r\namental body plan does a robot need for an evolved ANN to control it? [&quot;Mor=\r\nphological change in machines accelerates the evolution of robust behavior&quot;=\r\n, Bongard (2011)] Or, how does using a generative encoding vs. a direct enc=\r\noding affect mutation effect size? [&quot;Evolving Coordinated Quadruped Gaits w=\r\nith the HyperNEAT Generative Encoding&quot;, Clune et al. (2009)] These papers d=\r\nemonstrated new methods while also answering questions that are broadly int=\r\neresting beyond that method. Method development should occur *alongside* th=\r\ne science, but it should not be the focus of the science itself.\n\nWhat&#39;s wo=\r\nrse, this culture of method development has led to a culture of method comp=\r\narison, e.g., &quot;our method outperforms method X on benchmark A.&quot; In this kin=\r\nd of work, method development really is the focus of the research. As Ken a=\r\nttests, after spending months reading this kind of literature, it leaves yo=\r\nu knowing little more than &quot;method X is better than method Y on tasks A, B,=\r\n and C.&quot; This kind of work has no lasting effect because the hypotheses it =\r\naddresses are weak.\n\nAs such, the field would benefit from researchers focu=\r\nsing more on what broader hypotheses they want to address with their work, =\r\nrather than what method will produce a phenomenon. What broadly interesting=\r\n questions can we answer with our method?\n\n\n--- In neat@yahoogroups.com, &quot;K=\r\nen&quot; &lt;kstanley@...&gt; wrote:\n&gt;\n&gt; \n&gt; \n&gt; Hi JBM, thanks for getting deeper into =\r\nthis fascinating issue of how we can be confident that a paper has strong r=\r\nesults.  I hope you don&#39;t mind that I changed the subject line to make this=\r\n thread easier to find in the future.\n&gt; \n&gt; I think we all broadly agree tha=\r\nt there is no single formula for a good paper and you and Jeff are arguing =\r\nmore about matters of degree.  I am very interested in this subject as you =\r\nknow and I think it merits a lot more attention than it usually gets, which=\r\n is one reason I&#39;m glad you got deeper into it.  So here I want to add some=\r\n more weight to the case for qualitative papers.  I should warn everyone up=\r\n front that I took this opportunity basically to write an essay, so this is=\r\n a long post full of my thoughts on this issue.\n&gt; \n&gt; I believe most people =\r\nin our field would agree with JBM&#39;s assertion that there is &quot;a strong corre=\r\nlation between weak papers and papers without strong quantitative results.&quot;=\r\n\n&gt; \n&gt; I want to question that assumption because I do not believe it is tru=\r\ne even though it is widely assumed to be true and in fact is perhaps the en=\r\ngine behind the entire reviewing philosophy in AI.  In fact, this issue of =\r\nhow science should progress is ultimately not a scientific issue but a phil=\r\nosophical issue.  That is, when you begin to discuss which kinds of results=\r\n are most useful for future progress, it is a meta-discussion about how sci=\r\nence progresses.  Paul Feyerabend, who was a kind of radical philosopher of=\r\n science, has a really nice quote on this issue that I find inspirational: =\r\n\n&gt; \n&gt; &quot;To those who look at the rich material provided by history, and who =\r\nare not intent on impoverishing it in order to please their lower instincts=\r\n, their craving for intellectual security in the form of clarity, precision=\r\n, &#39;objectivity&#39;, &#39;truth&#39;, it will become clear that there is only one princ=\r\niple that can be defended under all circumstances and in all stages of huma=\r\nn development. It is the principle: anything goes.&quot; \n&gt; Against Method: Outl=\r\nine of an Anarchistic Theory of Knowledge (1975)\n&gt; \n&gt; My personal experienc=\r\ne fits very well with this idea.  There will be times in history where quan=\r\ntification is what we need, and other times when it is the last thing we ne=\r\ned.  And I believe the worship of quantification has recently, at this poin=\r\nt in the history of our field, been mostly an obstacle to progress put in p=\r\nlace by those &quot;craving for intellectual security,&quot; as Feyerabend puts it.  =\r\nBut insecurity is not a good foundation for the building of wisdom because =\r\nexploration requires courage and a willingness to confront ambiguity.  Quan=\r\ntification at this time in AI is largely an attempt to escape from ambiguit=\r\ny, and thereby becomes a form of deception.\n&gt; \n&gt; Consider what I have calle=\r\nd the &quot;objective paradox&quot;: often if you measure the ability of a method or =\r\nencoding in EC to achieve a specific objective, your conclusions about what=\r\n that method can achieve in general will be entirely skewed and misleading.=\r\n  Target-based benchmarks, rather than giving confidence, are causing us to=\r\n miss the forest for the trees.  Think how in my paper with Brian Woolley (=\r\nhttp://eplex.cs.ucf.edu/publications/2011/woolley-gecco11) we could not re-=\r\nevolve many images on Picbreeder with NEAT and CPPNs (which are the very me=\r\nthods behind Picbreeder).  So in the quantitative world we would conclude t=\r\nhat CPPNs cannot evolve such images.  And in fact results of this sort (sho=\r\nwing method X cannot solve problem A) are published all the time, and almos=\r\nt entirely misleading.  \n&gt; \t\n&gt; They are also the basis of highly deceptive =\r\ncomparisons between method X and Y.  We like to say if method X &quot;performs s=\r\nignificantly better&quot; than method Y on task A then method X is somehow &quot;bett=\r\ner.&quot;  But the truth is that often the ability of an encoding to evolve to a=\r\n specific target is a bad sign for its ability to ever produce anything int=\r\neresting.  Think about direct encodings:  they will always win on low-dimen=\r\nsional target-matching problems but are a dead end for evolving anything tr=\r\nuly complex.  We are fooling ourselves with quantification.\n&gt; \n&gt; Even peopl=\r\ne who are aware of Woolley&#39;s result and agree with our conclusions *still* =\r\npublish this kind of result because our culture is so deeply entrenched in =\r\nthis kind of quantification that we simply have no idea what else to do.  I=\r\nf we were willing to truly embrace the absurdity of this kind of analysis, =\r\nsomeone would have the courage to proclaim that DNA is incapable of evolvin=\r\ng humans (which were of course never set as the objective of evolution).  A=\r\nfter all, if humans were set as objective targets for evolution from the st=\r\nart, there would be no humans.  \n&gt; \n&gt; How many of us have tried to test met=\r\nhod X on objective A and found method X wanting and then published the resu=\r\nlt?  And how many such papers would you consider &quot;strong?&quot;  Our culture of =\r\nworshipping quantification has often led us astray on the real power of evo=\r\nlution and the potential of different encodings.  If intuition trumped quan=\r\ntification (a heretical suggestion) this fundamental confusion would not ha=\r\nve arisen so severely.\n&gt; \n&gt; Now I want to look at this issue from the oppos=\r\nite direction, where my own experience has been much more positive: how qua=\r\nlitative observations often lead to unexpected leaps of insight in a way qu=\r\nantitative results rarely have for me.  In fact, almost every idea in which=\r\n I have been involved is the result of a qualitative observation, exactly t=\r\nhe kind that worshipers of quantification seem to want to prevent us from p=\r\nublishing and sharing with each other.  \n&gt; \n&gt; For example, before I thought=\r\n of NEAT I read dozens of neuroevolution papers (this was in the Fall of 19=\r\n99).  There were tons of quantitative results and comparisons, but at the e=\r\nnd of four months of reading all this literature, I did not remember any of=\r\n the quantitative results.  Instead, what was left with me was a &quot;feeling&quot; =\r\nthat something qualitative was missing:  Regardless of performance, none of=\r\n these methods had the feel of nature when it came to the tendency for comp=\r\nlexity to increase elegantly and indefinitely.  And that is where the inspi=\r\nration for NEAT began, by ignoring quantitative results.  If I had followed=\r\n them, I would simply have built upon the &quot;best&quot; neuroevolution method of t=\r\nhe time, which had been my original plan, having been brought up too in the=\r\n culture of quantification.  So then there would be no NEAT.\n&gt; \n&gt; My idea f=\r\nor CPPNs was also from an entirely qualitative observation.  It actually ca=\r\nme before Picbreeder.  The main insight was actually from evolving a spaces=\r\nhip image in Mattias Fagerlund&#39;s old NEAT-based Genetic Art program.  The e=\r\nxperience of evolving the spaceship was so exciting to me at the time that =\r\nI put up a whole website on it: http://www.cs.utexas.edu/users/kstanley/roc=\r\nket.html  \n&gt; \n&gt; There was not a single quantitative result, but I was convi=\r\nnced that I had seen something, qualitatively, that resonated with nature. =\r\n It was that qualitative feeling, that recognition of something deep in the=\r\n results, that led to CPPNs.  It was a couple years later that the whole th=\r\neory solidified and I wrote the journal article on CPPNS: http://eplex.cs.u=\r\ncf.edu/publications/2007/stanley-gpem07\n&gt; \n&gt; One interesting thing about th=\r\nat CPPN journal article is that it is almost entirely qualitative.  As you =\r\ncan imagine, that posed problems for review, but I was determined not to po=\r\nllute it with meaningless quantification. For me, the images speak for them=\r\nselves.\n&gt; \n&gt; Those observations on CPPNs and their resulting symmetries and=\r\n regularities are also what led to David D&#39;Ambrosio, Jason Gauci and myself=\r\n creating HyperNEAT - again, the inspiration for the idea was not any quant=\r\nitative demonstration of anything.  \n&gt; \n&gt; And finally, as some of you know,=\r\n novelty search itself was not inspired by a quantitative result.  Rather, =\r\nit comes *again* from evolving pictures - in this case it was my experience=\r\n of evolving the Picbreeder Car: picbreeder.org/search/showgenome.php?sid=\r\n=3D464\n&gt; What shocked me from the experience of evolving the car was that I=\r\n had not been trying to evolve a car.  I could not stop thinking about that=\r\n, about how I did something really hard (from a qualitative perspective) by=\r\n not trying to do it.  I later noticed that almost every interesting image =\r\non the site has the same strange story.  I discussed the implications of th=\r\nese observations with Joel Lehman, which led us both to novelty search.\n&gt; \n=\r\n&gt; Now someone could argue that these ideas may all turn out &quot;weak&quot; in the e=\r\nnd.  But that would be a strange philosophy of science; it would suggest th=\r\nat we should never have explored down these roads in the first place.  Of c=\r\nourse we cannot know where any road leads until we take it - and I think at=\r\n least it&#39;s clear these were roads worth exploring though no one can say th=\r\ney lead ultimately to the greatest truths.  But it&#39;s still worth the lesson=\r\ns along the way.  \n&gt; \n&gt; Someone might also think, okay, your inspirations m=\r\nay have been qualitative but your *results* were mainly quantitative, and s=\r\nomehow that&#39;s what matters (though recall the CPPN paper does not have quan=\r\ntitative results).  As JBM points out, our novelty search paper did have qu=\r\nantitative results that ultimately convinced him something interesting was =\r\ngoing on.  But I think again the focus here on &quot;results&quot; misses the forest =\r\nfor the trees.  What is more important for the progress of science than the=\r\n results is the *inspiration* that leads to the ideas that produced the res=\r\nults.  If the inspiration is withheld, if I cannot share with you the analo=\r\ngue of the spaceship or the car in the future, then you can never draw from=\r\n those inspirations to find new roads for us to travel.  The kind of scienc=\r\ne that I believe JBM and many others idealize cuts out all the inspiration =\r\nfrom the public sphere and leaves us only to share its fruits when someone =\r\nis lucky enough in private to see something interesting (and try to quantif=\r\ny it then).\n&gt; \n&gt; Nevertheless, JBM says, &quot;I think that it is much harder to=\r\n write a convincing paper without any quantitative test than with the help =\r\nof measures/comparisons/etc.&quot;  Again, many would share this sentiment.  But=\r\n if you think about it, what exactly do we need to be &quot;convinced&quot; of?  Why =\r\ndo we think science (or AI especially) is about convincing someone of somet=\r\nhing?  Why do we need e.g. 30 strangers to validate an intuition we already=\r\n feel deeply that something is interesting?  The links in the chain of prog=\r\nress are from inspiration, not from convincing.  There are many ideas that =\r\nare neither right nor wrong anyway, but worth exploring because they will l=\r\nead us to new revelations.  To me, capturing the essence of nature is as mu=\r\nch about a feeling as it is about a result.  And my experience in practice =\r\nbears that out.\n&gt; \n&gt; Here is where I want to return to the intellectual ins=\r\necurity that Feyerabend raises.  I think our quantitative culture all boils=\r\n down to this problem of insecurity.  We do not trust ourselves to have val=\r\nid intuitions.  We dismiss our own ability to think, as with JBM&#39;s tongue-i=\r\nn-cheeck parody, &quot;look, cool simulated robots.&quot;  But I want to question why=\r\n we are so insecure in our own qualitative judgments?  \n&gt; \n&gt; For those of u=\r\ns with PhDs, our countries invested something like 25 years into our educat=\r\nion.  Shouldn&#39;t someone who supposedly succeeded in jumping through intelle=\r\nctual hoop after hoop after hoop - eventually impressing their peers enough=\r\n to be hired, even eventually to be tenured or promoted - be able to think =\r\nfor themselves sufficiently to decide whether the &quot;cool robots&quot; are worth s=\r\nharing with other scientists because they might inspire new ideas?  If we a=\r\nre really entirely unqualified after all those years of supposedly learning=\r\n to be a scientist, then what was the use of all that public investment?  W=\r\nas it simply to validate that we are able to check p-values that someone el=\r\nse reports in an X vs. Y quantitative comparison?  That&#39;s all we&#39;re qualifi=\r\ned to do?  Why do we deny our intellectual curiosity and ability to think f=\r\nor ourselves?  \n&gt; \n&gt; You may think it can&#39;t be done.  Maybe you think my pe=\r\nrsonal experience with NEAT, CPPNs, HyperNEAT, novelty search, etc. is some=\r\n kind of fluke that doesn&#39;t really represent science and how it works.  May=\r\nbe you think that kind of qualitative approach may work for Ken for some re=\r\nason but it can&#39;t work in general.  But why would that be?  Isn&#39;t it possib=\r\nle that we are all prematurely discrediting our intellectual potential to t=\r\nhink for ourselves?  We have created a culture in which the spaceships and =\r\ncars of science must be hidden, buried until their discoverers figure out (=\r\nor give up figuring out) their deeper implications.  I do not support publi=\r\nshing a paper simply because of some &quot;cool robots,&quot; but I do support qualif=\r\nied scientists deciding for themselves, from their experience and intuition=\r\ns, whether those cool robots might be the seed of an important chain of ide=\r\nas.  And I do not want those cool robots hidden from me as a reader of scie=\r\nntific literature if they might be such a seed.  When I looked at Jeff&#39;s re=\r\ncent video of his cool robots, I could feel those wheels of intuition turni=\r\nng in my mind.  I still don&#39;t know if it leads to anything, but I don&#39;t nee=\r\nd any quantification to know that that feeling is more than enough to justi=\r\nfy publishing that paper, and I&#39;m grateful he and his coauthors did not try=\r\n to obfuscate it with a veil of needless quantification.\n&gt; \n&gt; Best,\n&gt; \n&gt; ke=\r\nn\n\n\n"}}