{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[{"name":"READ"}]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"userId":550414109,"authorName":"rhiever489","from":"&quot;rhiever489&quot; &lt;rhiever@...&gt;","profile":"rhiever489","replyTo":"LIST","senderId":"3OTJjucwcaBE4wl_rGv1ZrS2Nx7oPf4to1Hl5T2tjyTDQjFmnFNBBSlaUiREHcjClJ4SsavTKuywrkenNWS8CfM0zeoqNzA","spamInfo":{"isSpam":false,"reason":"3"},"subject":"Re: Quantitative vs. Qualitative Results","postDate":"1370119442","msgId":6107,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGtvZG1laSszZ3YyQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGtvYWxlbis0cHN1QGVHcm91cHMuY29tPg=="},"prevInTopic":6106,"nextInTopic":6108,"prevInTime":6106,"nextInTime":6108,"topicId":6038,"numMessagesInTopic":46,"msgSnippet":"Hey Jeff, This is cool work and I think it s a good step toward addressing a fundamentally interesting question: How can we seed an evolving 3D object","rawEmail":"Return-Path: &lt;rhiever@...&gt;\r\nX-Sender: rhiever@...\r\nX-Apparently-To: neat@yahoogroups.com\r\nX-Received: (qmail 68331 invoked by uid 102); 1 Jun 2013 20:44:05 -0000\r\nX-Received: from unknown (HELO mtaq3.grp.bf1.yahoo.com) (10.193.84.142)\n  by m4.grp.bf1.yahoo.com with SMTP; 1 Jun 2013 20:44:05 -0000\r\nX-Received: (qmail 22597 invoked from network); 1 Jun 2013 20:44:05 -0000\r\nX-Received: from unknown (HELO ng5-vm7.bullet.mail.gq1.yahoo.com) (98.136.219.59)\n  by mtaq3.grp.bf1.yahoo.com with SMTP; 1 Jun 2013 20:44:05 -0000\r\nX-Received: from [98.137.0.89] by ng5.bullet.mail.gq1.yahoo.com with NNFMP; 01 Jun 2013 20:44:04 -0000\r\nX-Received: from [10.193.94.110] by tg9.bullet.mail.gq1.yahoo.com with NNFMP; 01 Jun 2013 20:44:04 -0000\r\nDate: Sat, 01 Jun 2013 20:44:02 -0000\r\nTo: neat@yahoogroups.com\r\nMessage-ID: &lt;kodmei+3gv2@...&gt;\r\nIn-Reply-To: &lt;koalen+4psu@...&gt;\r\nUser-Agent: eGroups-EW/0.82\r\nMIME-Version: 1.0\r\nContent-Type: text/plain; charset=&quot;ISO-8859-1&quot;\r\nContent-Transfer-Encoding: quoted-printable\r\nX-Mailer: Yahoo Groups Message Poster\r\nX-Yahoo-Newman-Property: groups-compose\r\nX-eGroups-Msg-Info: 2:3:4:0:0\r\nFrom: &quot;rhiever489&quot; &lt;rhiever@...&gt;\r\nSubject: Re: Quantitative vs. Qualitative Results\r\nX-Yahoo-Group-Post: member; u=550414109; y=V_tQUmIR9w74I5vgEPZ1jZ4XsQcbGwCmK1nLaGBLH6wp86tSB-OQZ3l-QP08T2tJ-zw4Ny0HAM0jI8s\r\nX-Yahoo-Profile: rhiever489\r\n\r\nHey Jeff,\n\nThis is cool work and I think it&#39;s a good step toward addressing=\r\n a fundamentally interesting question: How can we seed an evolving 3D objec=\r\nt generator with a predetermined object? It&#39;s also a great example of what =\r\nI was talking about in my previous comment in response to Ken. First, I&#39;ll =\r\nanswer your question.\n\n&gt; I won&#39;t take any criticism of our paper personally=\r\n. I just think that sometimes arguments are more informative when there is =\r\na specific example to be discussed, instead of remaining entirely abstract.=\r\n I also think this paper is a nice example of a technique that can&#39;t be qua=\r\nntified in an informative way, yet remains an interesting contribution. If =\r\nyou were our reviewer, would you insist upon a quantitative comparison for =\r\nthis paper? How would you recommend such a test be made? Do you agree that =\r\nwe should encourage reviewers to reject such papers, or that we should work=\r\n to encourage reviewers to consider such papers?\n\nI agree that it&#39;s hard to=\r\n quantify the results in this paper because the result is &quot;yup, it worked i=\r\nn my system.&quot; At this point, the best you could&#39;ve done was (as you mention=\r\ned) compared it to how closely targeted evolution gets to the desired targe=\r\nt. Since you have a measure of how &quot;close&quot; the phenotype is to the target p=\r\nhenotype (distanceFromSurface), you can quantify the distance from the desi=\r\nred target that each method achieves. Of course, each method would need to =\r\nbe run in replicate at least 30 times to get a reasonable mean and 95% conf=\r\nidence interval.\n\n\nSome more comments about the paper:\n\nHere&#39;s what I got f=\r\nrom the paper: You wanted to create a method to seed a 3D object generator =\r\nwith a predetermined 3D object. You devised a method to enable this feature=\r\n based on CPPNs. You showed that it works pretty well and matches the desir=\r\ned object on EndlessForms.\n\nNotice how each sentence narrows the relevant a=\r\nudience down more and more. The question went from &quot;How do I seed a 3D obje=\r\nct generator with a predetermined object?&quot; to &quot;How do I seed a 3D object ge=\r\nnerator based on CPPNs with a predetermined object?&quot; to &quot;How do I seed my 3=\r\nD object generator based on CPPNs, EndlessForms, with a predetermined objec=\r\nt?&quot;\n\nLet&#39;s say I had my own 3D object generating website, UnlimitedForms, b=\r\nut it was based on regular ANNs. What could I take from this paper? Or what=\r\n if I was only interested in 2D pictures, but still wanted to seed them sim=\r\nilarly? Or what if I have no interest in evolving 2D/3D objects at all, but=\r\n want to know clever methods for seeding a GA with a predetermined phenotyp=\r\ne? These are all important points to consider when presenting a new method,=\r\n especially because everyone has their own pet method that they like to use=\r\n.\n\nIf you did the work discussed in Section 4B for this paper, you would ha=\r\nve a much easier time quantifying the results. You also would&#39;ve gotten at =\r\na much more broadly interesting question about evolvability while simultane=\r\nously presenting your new technique.\n\nAlso, given that this is a methods pa=\r\nper, I&#39;m surprised the methods section is so short. The new technique that =\r\nyou introduced in this paper (Section 2C) only received about 2/3 page of t=\r\next, and no figures dedicated to it. From my first two reads through that s=\r\nection, I still don&#39;t completely understand how the method works. I would s=\r\nay that that would be the critical section of the paper for readers to unde=\r\nrstand if they were to use your technique, worthy of at least one figure an=\r\nd more detailed explanation.\n\nCheers,\nRandy\n\n\n--- In neat@yahoogroups.com, =\r\n&quot;Jeff&quot; &lt;jclune@...&gt; wrote:\n&gt;\n&gt; Hello all,\n&gt; \n&gt; Our recent conversation in t=\r\nhis &quot;Quantitative vs. Qualitative Results&quot; thread was started in part becau=\r\nse a paper I am on was rejected from GECCO for not having any quantitative =\r\nresults. That paper was recently accepted at CEC. I&#39;d be interested to hear=\r\n your thoughts on this paper in light of our conversation now that you can =\r\nsee the specific paper that was rejected. \n&gt; \n&gt; I&#39;d be especially intereste=\r\nd to hear from those of you who argued that non-quantitative papers should =\r\nbe rejected (or, at least, should have a much higher threshold to gain acce=\r\nptance). Obviously I think this paper is interesting and will benefit the s=\r\ncientific community, partly because it suggests new ideas (though it can&#39;t =\r\nquantify all of them yet). Do you think our field is better off barring suc=\r\nh papers because they can&#39;t quantitatively &quot;prove&quot; they are better than som=\r\ne alternate algorithm in some way? Of course I&#39;m not advocating that all pa=\r\npers should lack quantitative results; just that we should not rule out suc=\r\nh papers if they don&#39;t have statistical comparisons. I do want to stress th=\r\nat I always include--and as a reviewer, insist upon--a statistical test wit=\r\nh a p-value *if* a quantitative claim is made, but that policy is not incon=\r\nsistent with the view that many interesting, subjective, qualitative observ=\r\nations are scientifically worthwhile too. \n&gt; \n&gt; I won&#39;t take any criticism =\r\nof our paper personally. I just think that sometimes arguments are more inf=\r\normative when there is a specific example to be discussed, instead of remai=\r\nning entirely abstract. I also think this paper is a nice example of a tech=\r\nnique that can&#39;t be quantified in an informative way, yet remains an intere=\r\nsting contribution. If you were our reviewer, would you insist upon a quant=\r\nitative comparison for this paper? How would you recommend such a test be m=\r\nade? Do you agree that we should encourage reviewers to reject such papers,=\r\n or that we should work to encourage reviewers to consider such papers?\n&gt; \n=\r\n&gt; Here is the cite and PDF: \n&gt; \n&gt; Clune J, Chen A, Lipson H (2013) Upload A=\r\nny Object and Evolve it: Injecting Complex Geometric Patterns into CPPNs fo=\r\nr Further Evolution. Proceedings of the IEEE Congress on Evolutionary Compu=\r\ntation.\n&gt; \n&gt; http://jeffclune.com/publications/2013-Clune-SeededCPPN-CEC.pd=\r\nf\n&gt; \n&gt; I look forward to hearing your thoughts. \n&gt; \n&gt; Best regards,\n&gt; Jeff =\r\nClune\n&gt; \n&gt; Assistant Professor\n&gt; Computer Science\n&gt; University of Wyoming\n&gt;=\r\n jeffclune@...\n&gt; jeffclune.com\n\n\n"}}