{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[{"name":"READ"}]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"userId":550414109,"authorName":"rhiever489","from":"&quot;rhiever489&quot; &lt;rhiever@...&gt;","profile":"rhiever489","replyTo":"LIST","senderId":"v0cKNi8BlREZQNW9BnGsmT3dyJqymift-IVgPqSgHW_Orp_MkwV9ibBIr2oLC7URcwEuBVcAhMSxaw1LC2XbOVtsB7HmvNI","spamInfo":{"isSpam":false,"reason":"3"},"subject":"Re: Quantitative vs. Qualitative Results","postDate":"1370308487","msgId":6122,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGtvamYyNys1dDE4QGVHcm91cHMuY29tPg==","inReplyToHeader":"PDA4RTczRTAxLThBQjAtNEQzMy05MTRCLUY2RjAzQTEwMjcyM0BnbWFpbC5jb20+"},"prevInTopic":6121,"nextInTopic":6123,"prevInTime":6121,"nextInTime":6123,"topicId":6038,"numMessagesInTopic":46,"msgSnippet":"Hey Jeff, ... Correct, I wouldn t insist on a quantitative measure in that case. However, as I said before, what does saying they are [interestingly]","rawEmail":"Return-Path: &lt;rhiever@...&gt;\r\nX-Sender: rhiever@...\r\nX-Apparently-To: neat@yahoogroups.com\r\nX-Received: (qmail 3913 invoked by uid 102); 4 Jun 2013 01:14:48 -0000\r\nX-Received: from unknown (HELO mtaq4.grp.bf1.yahoo.com) (10.193.84.143)\n  by m9.grp.bf1.yahoo.com with SMTP; 4 Jun 2013 01:14:48 -0000\r\nX-Received: (qmail 30743 invoked from network); 4 Jun 2013 01:14:48 -0000\r\nX-Received: from unknown (HELO ng23-vm10.bullet.mail.bf1.yahoo.com) (66.196.80.41)\n  by mtaq4.grp.bf1.yahoo.com with SMTP; 4 Jun 2013 01:14:48 -0000\r\nX-Received: from [98.139.164.125] by ng23.bullet.mail.bf1.yahoo.com with NNFMP; 04 Jun 2013 01:14:48 -0000\r\nX-Received: from [10.193.94.106] by tg6.bullet.mail.bf1.yahoo.com with NNFMP; 04 Jun 2013 01:14:48 -0000\r\nDate: Tue, 04 Jun 2013 01:14:47 -0000\r\nTo: neat@yahoogroups.com\r\nMessage-ID: &lt;kojf27+5t18@...&gt;\r\nIn-Reply-To: &lt;08E73E01-8AB0-4D33-914B-F6F03A102723@...&gt;\r\nUser-Agent: eGroups-EW/0.82\r\nMIME-Version: 1.0\r\nContent-Type: text/plain; charset=&quot;ISO-8859-1&quot;\r\nContent-Transfer-Encoding: quoted-printable\r\nX-Mailer: Yahoo Groups Message Poster\r\nX-Yahoo-Newman-Property: groups-compose\r\nX-eGroups-Msg-Info: 2:3:4:0:0\r\nFrom: &quot;rhiever489&quot; &lt;rhiever@...&gt;\r\nSubject: Re: Quantitative vs. Qualitative Results\r\nX-Yahoo-Group-Post: member; u=550414109; y=TrgCZ0clyxPYrboSXtoAEVh6SL1BRrZAKbC7a6ScY_lexY5BLdirBCb5KXEkAl3GZTKj3flfF-Aix4Q\r\nX-Yahoo-Profile: rhiever489\r\n\r\nHey Jeff,\n\n&gt; We could have an interesting conversation about these observat=\r\nion, and someone could even defend that L-systems are more natural (e.g. th=\r\ney better resemble plants), but it&#39;s not the case that that conversation wo=\r\nuld be better had with numbers, or would be best settled by a quantitative =\r\nmetric. The point is that until we invent true AI with similar pattern-reco=\r\ngnition to humans, we don&#39;t have the ability to quantify the recognition of=\r\n interestingly different types of patterns even though those differences ar=\r\ne obvious to humans. This is the same reason why &quot;monet-ness&quot; is pretty cle=\r\nar to us when we see it, but we can&#39;t quantify it well/easily. I should poi=\r\nnt out that I&#39;m not saying that phenomena like &quot;monet-ness&quot; are not quantif=\r\niable in principle=85.eventually we will invent AI that can &quot;see&quot; the world=\r\n and recognize high-dimnsional clusters (like &quot;monet-ness&quot; and &quot;pollack-nes=\r\ns&quot; as different things, as well as quantify &quot;naturalness&quot;) and at that poin=\r\nt we probably can quantify these traits, but at present we can&#39;t do that in=\r\n a way that is ultimately helpful. If you are a reviewer and you force some=\r\none to try to quantify properties like &quot;naturalness&quot;, &quot;monet-ness&quot;, etc., y=\r\nou are making things worse only in the name of claiming it&#39;s objective beca=\r\nuse it is quantitative. Your brain is simply better at some things than our=\r\n algorithms, and for those domains we should use our brains to evaluate the=\r\n results, not numbers. Doing so doesn&#39;t make the statements &quot;hollow&quot;, unint=\r\neresting, or unscientific. You will of course object that they are &quot;subject=\r\nive&quot; judgements, and they are, but they are the best we&#39;ve got and they can=\r\n still be helpful. I will agree (in line with JBM) that we should only acce=\r\npt such results when they are &quot;obvious to us&quot;, so maybe the claim &quot;CPPNs ar=\r\ne more natural than L-Systems&quot; should be curbed by a reviewer, but somethin=\r\ng as obvious as &quot;they are different&quot; should not. \n\n&gt; Do you still agree wit=\r\nh this statement after my above examples? Surely you agree that Jackson Pol=\r\nlack paints in a different style than Monet, but I&#39;m guessing you also woul=\r\ndn&#39;t insist on a quantitative measure before making that claim in a scienti=\r\nfic publication. If you would insist on that, then I think you are forgetti=\r\nng that quantitative measures are supposed to be tools that help advance sc=\r\nientific progress, not chains that should bind us and slow us down. \n\nCorre=\r\nct, I wouldn&#39;t insist on a quantitative measure in that case. However, as I=\r\n said before, what does saying &quot;they are [interestingly] different&quot; tell us=\r\n? How can we take that statement and build off of it, other than saying tha=\r\nt we made something else that looks interestingly different? I could have a=\r\n program use a random number generator to make some random art and some of =\r\nthose art pieces would be interestingly different as well. What does that t=\r\nell us about the process underlying it? Like you said, we can&#39;t claim that =\r\nany method produces more &quot;natural&quot; or more &quot;monet-y&quot; designs with a qualita=\r\ntive analysis, so can we really say anything substantial that someone could=\r\n take and advance the field with?\n\nI think that&#39;s a major concern to addres=\r\ns: Can we make any substantial claims with a qualitative analysis?\n\n\n&gt; By t=\r\nhat rationale you don&#39;t think the Picbreeder paper should have been publish=\r\ned, or Karl Sims work, is that right? The Picbreeder papers collectively ha=\r\nve over 100 citations, and Sims&#39; work arguably kickstarted/inspired the ent=\r\nire field of artificial life and has thousands of citations. Picbreeder als=\r\no visually demonstrates the power of CPPNs, provides an intuitive testbed f=\r\nor learning how they work, but also taught us lessons about Evolutionary Co=\r\nmputation in general; the entire idea for novelty search emerged as a resul=\r\nt of the Picbreeder system! If your attitudes for what merits a publication=\r\n were universal, no one would pursue this type of work because of the low v=\r\nalue you place on it would mean that doing so would not help one&#39;s career, =\r\nand thus such important work would not be done. I don&#39;t really get why we w=\r\nould want to eliminate such valuable work. So much crap gets published just=\r\n because it has a few quantitative comparisons: I think we can spare a few =\r\npaper slots for work that is interesting, yet not quantifiable. \n\nI&#39;m not s=\r\nure if cherrypicking a few success cases out of far more failures proves th=\r\ne point. I won&#39;t say that all proof of concept work is not worth publishing=\r\n (obviously some is), and it&#39;s nearly impossible to judge the impact work w=\r\nill have in the long term. However, it is fair to assume that work that tea=\r\nches us something new about the world (see the examples I listed before, e.=\r\ng., Bongard 2011) is more likely to have a lasting impact than a proof of c=\r\noncept in a particular system.\n\nThe most straightforward way to learn somet=\r\nhing about a phenomenon is to measure it. That way, the argument over the r=\r\nesults immediately goes to an objective discussion (&quot;what is the proper way=\r\n to measure this?&quot;) rather than subjective (&quot;well, I think this looks more =\r\nMonet-y...&quot;). Science progresses most expediently by discussing how we can =\r\nmeasure and reproduce phenomena, rather than waving our hands and talking f=\r\nrom a subjective standpoint.\n\n\n&gt; This comment reveals that we did fail to c=\r\nommunicate the technique, because with the Seeded-CPPN technique CPPNs are =\r\nnot trained in any way. It&#39;s possible that this misunderstanding contribute=\r\ns to your belief that the Seeded-CPPN technique should be compared to targe=\r\nt-based evolution, because if we were indeed were *training* CPPNs to repro=\r\nduce an object then it would be more reasonable to require a comparison to =\r\nalternate methods of training them to reproduce the same object (i.e. targe=\r\nt-based evolution). Note: the technique does allow for *further* evolution =\r\nof an arbitrary shape=85so evolutionary &quot;training&quot; does occur, but only aft=\r\ner starting from the seed shape. \n&gt; \n&gt; With the Seeded-CPPN technique, you =\r\ndon&#39;t train the CPPN: you inject the geometry of the seed object into the C=\r\nPPN via the ds (distanceToSurface) input. For each voxel, that ds input con=\r\nveys the distance between that voxel and the surface of the surface (outer =\r\nshell) of the target object (along with a sign indicating if that voxel is =\r\ninside or outside the object). A CPPN recreates the shape by filling in all=\r\n voxels inside the shape, but the technique also allows for warping of the =\r\nobject. For example, for a CPPN to increase the size of the target output s=\r\nimilarly in all dimensions, it could find all voxels that are x centimeters=\r\n away from, and outside of, the target object and fill them (and everything=\r\n inside of them) in.&quot; For a CPPN to increase the width, but not the height,=\r\n of an object, it could fill in the original object plus any voxels x cm aw=\r\nay in the width-dimension, etc. Or it could do more complicated things base=\r\nd on the shape&#39;s geometry. Thus the CPPN can immediately start from a desir=\r\ned pattern (in this case the shape of the object) and then elaborate on tha=\r\nt shape by adding/subtracting from the original design, or by warping the o=\r\nriginal design. \n\nAha, I get it now. And yes -- I would also now agree that=\r\n making a comparison to targeted evolution would not be valuable at that po=\r\nint, since you are not training the CPPN to reproduce the shape at all. Ind=\r\need, as Ken said, your message here is that you can seed a CPPN in such a w=\r\nay then evolve it into other objects -- objects that either look similar an=\r\nd that look completely dissimilar.\n\nThat said, a qualitative analysis may n=\r\not thoroughly prove your point. You&#39;ve shown that the Seeded-CPPNs can evol=\r\nve into slightly morphed or completely dissimilar shapes in a few instances=\r\n, but what happens over hundreds of instances? Is morphing into a completel=\r\ny dissimilar shape an extremely rare event, or is it common? What about sli=\r\nghtly morphed shapes? Or are a large portion of the mutations neutral? What=\r\never the answer to these questions, what would the implications of those an=\r\nswers be for someone who wanted to use Seeded-CPPNs?\n\nNow that I understand=\r\n your paper better, there are many unanswered questions that would be impor=\r\ntant for me to know if I wanted to use the Seeded-CPPN technique, and I&#39;m f=\r\nairly sure only a quantitative analysis could answer them.\n\n\nCheers,\nRandy\n=\r\n\n\n"}}