{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[{"name":"READ"}]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"userId":55268137,"authorName":"shimonw","from":"&quot;shimonw&quot; &lt;shimon@...&gt;","profile":"shimonw","replyTo":"LIST","senderId":"qSFC2_JIkuja8hkG9z5fMTfphteJyN0_gXZlzNl31SJscJnN_Zf0OfQs7gn6bhFswPZXF_QjQ-XYe4fY8sMsJG6rN3k77A","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: GECCO Paper on HyperNEAT","postDate":"1370604382","msgId":6127,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGtvc2cwdStjMTI4QGVHcm91cHMuY29tPg==","inReplyToHeader":"PGtvMzU2NitnOWxvQGVHcm91cHMuY29tPg=="},"prevInTopic":6101,"nextInTopic":6128,"prevInTime":6126,"nextInTime":6128,"topicId":6085,"numMessagesInTopic":14,"msgSnippet":"Hi Ken, Thanks for your interesting and thought-provoking comments.  I ll give some brief reactions here, and I hope we can have a productive discussion about","rawEmail":"Return-Path: &lt;shimon@...&gt;\r\nX-Sender: shimon@...\r\nX-Apparently-To: neat@yahoogroups.com\r\nX-Received: (qmail 58333 invoked by uid 102); 7 Jun 2013 11:26:24 -0000\r\nX-Received: from unknown (HELO mtaq1.grp.bf1.yahoo.com) (10.193.84.32)\n  by m6.grp.bf1.yahoo.com with SMTP; 7 Jun 2013 11:26:24 -0000\r\nX-Received: (qmail 20288 invoked from network); 7 Jun 2013 11:26:23 -0000\r\nX-Received: from unknown (HELO ng3-vm2.bullet.mail.bf1.yahoo.com) (98.139.164.74)\n  by mtaq1.grp.bf1.yahoo.com with SMTP; 7 Jun 2013 11:26:23 -0000\r\nX-Received: from [98.139.164.123] by ng3.bullet.mail.bf1.yahoo.com with NNFMP; 07 Jun 2013 11:26:23 -0000\r\nX-Received: from [10.193.94.45] by tg4.bullet.mail.bf1.yahoo.com with NNFMP; 07 Jun 2013 11:26:23 -0000\r\nDate: Fri, 07 Jun 2013 11:26:22 -0000\r\nTo: neat@yahoogroups.com\r\nMessage-ID: &lt;kosg0u+c128@...&gt;\r\nIn-Reply-To: &lt;ko3566+g9lo@...&gt;\r\nUser-Agent: eGroups-EW/0.82\r\nMIME-Version: 1.0\r\nContent-Type: text/plain; charset=&quot;ISO-8859-1&quot;\r\nContent-Transfer-Encoding: quoted-printable\r\nX-Mailer: Yahoo Groups Message Poster\r\nX-Yahoo-Newman-Property: groups-compose\r\nX-eGroups-Msg-Info: 1:12:0:0:0\r\nFrom: &quot;shimonw&quot; &lt;shimon@...&gt;\r\nSubject: Re: GECCO Paper on HyperNEAT\r\nX-Yahoo-Group-Post: member; u=55268137; y=2QSWc82ob4eusDnQztCVW1l-Uk4jRyZZ9JonqnrXVkcxCA\r\nX-Yahoo-Profile: shimonw\r\n\r\nHi Ken,\n\nThanks for your interesting and thought-provoking comments.  I&#39;ll =\r\ngive some brief reactions here, and I hope we can have a productive discuss=\r\nion about it at GECCO.\n\n1) I won&#39;t comment for now on the new experiments y=\r\nou&#39;ve been running because the details are not available yet.  Instead, I w=\r\nill just comment on the various walking gait domains, because the details o=\r\nf the additional results you mentioned are in that case already available, =\r\nin newly published GECCO papers.  \n\nFIrst of all, these are very cool resul=\r\nts, and nice success stories for HyperNEAT.  It&#39;s great to see that the GDS=\r\n community is continuing the push the envelope in terms of robot locomotion=\r\n, which seems to be emerging as a nice application for indirect encodings. =\r\n \n\nHowever, I would simply caution against placing all these variations on =\r\nthe walking gait task on a one-dimensional spectrum of difficulty.  In our =\r\npaper, we took the orignal walking gait task and made only one change (incr=\r\neasing the mass of the torso) which clearly makes the task harder.  In the =\r\npapers Ken mentioned, there are other differences, e.g., the use of an SUPG=\r\n encoding, the use of CTRNNs, the use of a different substrate topology, an=\r\nd varying the length of the legs.\n\nIt&#39;s completely legitimate to make these=\r\n changes and they don&#39;t detract from the results at all.   But they are con=\r\nfounding factors when it comes to comparing HyperNEAT&#39;s performance on walk=\r\ning gait tasks of different difficulties.  Some of these changes may make t=\r\nhe task harder in some ways but other changes may make it easier in others =\r\nways, and so far we don&#39;t have experimental results that control for these =\r\nfactors.\n\n2) I hope to avoid a semantic debate about what is a &quot;target-base=\r\nd&quot; FF.  If you want to include what I was calling a &quot;regular&quot; FF in the sco=\r\npe of target-based FFs, I won&#39;t object.  But my point is that, regardless o=\r\nf what you call them, there is an important difference between FFs that req=\r\nuire a single specific phenotype and FFs that require only that some goal b=\r\ne achieved.  For the latter, there may be many ways to skin the cat, though=\r\n in any interesting problem, good solutions are still quite rare.  The dist=\r\ninction is important because, while the former category is arguably only of=\r\n theoretical interest, the second category corresponds to what I consider t=\r\nhe most interesting and important class of FFs, because these are the FFs t=\r\nhat naturally arise in a very large number of real-world optimization probl=\r\nems.  \n\nSo, using your terminology, I agree it is reasonable to say HyperNE=\r\nAT&#39;s difficulties with fracture are probably limited to &quot;target-based&quot; FFs.=\r\n  But for me, this is a potentially serious restriction, since target-based=\r\n FFs include not just pathological FFs but a large class of real-world FFs.=\r\n\n\nRegarding the wavelet method, I would still definitely call this an indir=\r\nect encoding, but it is in some sense &quot;less indirect&quot; because it lacks the =\r\ncompositional functions of HyperNEAT. It&#39;s a perfectly reasonable hypothesi=\r\ns that such compositionality is advantageous in some ways.  However, if tha=\r\nt&#39;s true, then we should be able to demonstrate that by finding tasks where=\r\n HyperNEAT outperforms the wavelet method (FYI, in the extended analysis Th=\r\nomas is conducting for his master&#39;s thesis, we have found one variation of =\r\nthe line-following task where this is the case).  So in that sense, the wav=\r\nelet method is a useful baseline, which is the whole reason we introduced i=\r\nt.\n\n3) If it&#39;s true that it takes ~6 nodes to represent fracture, then I th=\r\nink this a potentially important point.  On regular FFs, it could contribut=\r\ne to the difficulty of discovering fracture, since representations that hav=\r\ne only some of the necessary components may not be rewarded (I think you wo=\r\nuld call this &quot;deception&quot;).  In Picbreeder-like tasks, we already see that =\r\nfracture can evolve anyway, but this doesn&#39;t mean it wouldn&#39;t do it even be=\r\ntter if fracture required fewer nodes to represent.  If we think that the s=\r\nolutions to many interesting problems require fracture, then I think it&#39;s a=\r\nt least possible that one could devise a better representation for such pro=\r\nblems than the CPPNs used in HyperNEAT.\n\nAs I understand it, your approach =\r\nto dealing with &quot;regular&quot; FFs is to reformulate them &quot;in a way that respect=\r\ns the need for phenotypic diversity and open-endedness.&quot;  That&#39;s a very int=\r\neresting approach and I think it has a lot of merit, but I don&#39;t think it w=\r\nill solve all our problems because it presupposes that such a reformulation=\r\n is possible (or that the prior knowledge it requires is available).  In so=\r\nme cases, I think we are just stuck with hard FFs and we need to develop be=\r\ntter methods to deal with them.\n\nRegarding the idea that &quot;an unhappy and un=\r\nhealthy indirect encoding is one with only a strict target to which to aspi=\r\nre&quot;: this is a very intriguing hypothesis, but to me it is only a hypothesi=\r\ns.  I think it&#39;s true of existing indirect encodings, but that for me does =\r\nnot in any way rule out the possibility of developing a different indirect =\r\nencoding for which that is not true, and I think that&#39;s one thing we should=\r\n be working on.   One of the reasons that I&#39;m interested in indirect encodi=\r\nngs is that I strongly believe this can be done.\n\nCheers,\nShimon\n\n\n\n"}}