{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[{"name":"READ"}]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"userId":403065338,"authorName":"Stéphane Doncieux","from":"=?ISO-8859-1?Q?St=E9phane_Doncieux?= &lt;stephane.doncieux@...&gt;","profile":"stephane.doncieux","replyTo":"LIST","senderId":"SNmzVQZOSHb1XPH3Ed0jwyhnPd-aujhXjtmHUBSZXUEGNG5_3I298J0r9Q9k8dW3XkohLuyhY8qP_QvDMCo3ISoiV4YoiIhUdsckJVhppdWF_Txdj0QNin7LFonINpm9UTQ1s7uORLKq","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: behavioral vs genetic divesrity","postDate":"1371324431","msgId":6147,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDUxQkNDMDBGLjcwODAxMDRAZ21haWwuY29tPg=="},"prevInTopic":6146,"nextInTopic":6148,"prevInTime":6146,"nextInTime":6148,"topicId":6136,"numMessagesInTopic":14,"msgSnippet":"Hi Ken, I certainly did not want to say that genetic diversity is not important. I just wanted to say that behavioral diversity should not be neglected and","rawEmail":"Return-Path: &lt;stephane.doncieux@...&gt;\r\nX-Sender: stephane.doncieux@...\r\nX-Apparently-To: neat@yahoogroups.com\r\nX-Received: (qmail 61622 invoked by uid 102); 15 Jun 2013 19:27:12 -0000\r\nX-Received: from unknown (HELO mtaq3.grp.bf1.yahoo.com) (10.193.84.142)\n  by m12.grp.bf1.yahoo.com with SMTP; 15 Jun 2013 19:27:12 -0000\r\nX-Received: (qmail 17318 invoked from network); 15 Jun 2013 19:27:12 -0000\r\nX-Received: from unknown (HELO mail-we0-f171.google.com) (74.125.82.171)\n  by mtaq3.grp.bf1.yahoo.com with SMTP; 15 Jun 2013 19:27:12 -0000\r\nX-Received: by mail-we0-f171.google.com with SMTP id m46so1373259wev.30\n        for &lt;neat@yahoogroups.com&gt;; Sat, 15 Jun 2013 12:27:12 -0700 (PDT)\r\nX-Received: by 10.180.126.2 with SMTP id mu2mr1481959wib.63.1371324432585;\n        Sat, 15 Jun 2013 12:27:12 -0700 (PDT)\r\nReturn-Path: &lt;stephane.doncieux@...&gt;\r\nX-Received: from MacBook-Pro-de-Stephane-Doncieux.local (ram94-9-88-175-75-53.fbx.proxad.net. [88.175.75.53])\n        by mx.google.com with ESMTPSA id h8sm11520956wiz.9.2013.06.15.12.27.11\n        for &lt;neat@yahoogroups.com&gt;\n        (version=TLSv1 cipher=ECDHE-RSA-RC4-SHA bits=128/128);\n        Sat, 15 Jun 2013 12:27:12 -0700 (PDT)\r\nMessage-ID: &lt;51BCC00F.7080104@...&gt;\r\nDate: Sat, 15 Jun 2013 21:27:11 +0200\r\nUser-Agent: Mozilla/5.0 (Macintosh; Intel Mac OS X 10.6; rv:17.0) Gecko/20130509 Thunderbird/17.0.6\r\nMIME-Version: 1.0\r\nTo: neat@yahoogroups.com\r\nContent-Type: text/plain; charset=ISO-8859-1\r\nContent-Transfer-Encoding: 7bit\r\nX-eGroups-Msg-Info: 1:12:0:0:0\r\nFrom: =?ISO-8859-1?Q?St=E9phane_Doncieux?= &lt;stephane.doncieux@...&gt;\r\nSubject: Re: behavioral vs genetic divesrity\r\nX-Yahoo-Group-Post: member; u=403065338; y=NqJ2yO5i_K8-PJCXi1Ahbz8lDal1xRDvZ1kJAjNC27nQ40T4-X_Y5wmgkuI\r\nX-Yahoo-Profile: stephane.doncieux\r\n\r\nHi Ken,\n\nI certainly did not want to say that genetic diversity is not important.\nI just wanted to say that behavioral diversity should not be neglected\nand that genotypic diversity, in my opinion, should not be preferred\nover behavioral diversity if one only is to be used. I have the feeling\nthat genotypic diversity is not the main bottleneck, but I do also think\nthat it is important (and the performance of NEAT prove it). The thing\nis that keeping a good diversity in the genotype space is not enough to\nguarantee a good diversity in the behavioral space, as many different\nneural networks may have the same behavior (think about neurons that are\nnot connected to outputs or neural network parts connected to sensors\nthat are not activated for a while) and likewise very close neural\nnetworks may result in very different behaviors. \n\nBy the way, I completely agree with you, Ken, genotypic and behavioral\ndiversity are very probably complimentary. Combining both will certainly\nlead to better results and it would be interesting to further\ninvestigate it.\n\nBest,\n\nstef\n\n&gt;\n&gt; Hi Stef,\n&gt;\n&gt; I changed the subject again just to make it easier to keep track as\nthe conversation branches.\n&gt;\n&gt; Thanks for pointing out these insights and your work on behavioral vs.\ngenetic diversity. It does appear that behavioral diversity and novelty\nare emerging through recent research such as your own as more critical\nfactors in maintaining healthy diversity than genetic diversity, in\nparticular when the diversity is in service of achieving a traditional\nobjective (i.e. when one of the multiple objectives is some kind of\ntask-specific performance measure).\n&gt;\n&gt; However, genetic diversity may still play a useful role in combination\nwith behavioral diversity or novelty, which I want to illustrate here.\nRecall that the original motivation in NEAT for maintaining genetic\ndiversity was to ensure that genetic innovations (i.e. additions of\nstructure) are not eliminated prematurely. That is, the point is to\nensure that individuals with new structure are not eliminated before\nthey have a chance to show their potential by optimizing their weights\nover several more generations. Placing them in protected species gives\nthem that opportunity to optimize further.\n&gt;\n&gt; However, recent results such as yours suggest that when you have a\ntarget objective, protecting behavioral diversity is so effective (most\nlikely because it help avoid deception) that a system with only\nbehavioral diversity will likely come closer to the objective than one\nwith only genetic diversity.\n&gt;\n&gt; But that leaves open the possibility that genetic diversity can\ncomplement behavioral diversity or novelty. One interesting question is\nwhether in the &quot;Encouraging Behavioral Diversity in Evolutionary\nRobotics&quot; paper the results would be even better if *both* behavioral\ndiversity/novelty and genetic diversity were combined (as our group has\ndone in recent papers). Going back to the motivation in NEAT for genetic\ndiversity, the logic for why it would still matter when combined with\nbehavioral diversity/novelty can be seen:\n&gt;\n&gt; Just as we do not know at first for any structural innovation whether\nthat innovation might lead to higher fitness in an objective-based\nproblem, we also do not know initially whether a particular structural\ninnovation might lead later to more *novelty*. Often structural\nadditions in neuroevolution lead to a complete collapse in behavior,\nwhich obviously hurts fitness, but also hurts novelty because degenerate\nbehaviors are not considered novel (except at the very beginning of the\nrun). Therefore, if you are not protecting genetic diversity when\nnovelty/behavioral diversity are one of the objectives, then you are\nrisking prematurely eliminating genotypes before their potential for\nnovelty has been explored.\n&gt;\n&gt; However, perhaps more significant in magnitude than even that scenario\nis whether novelty alone (as in novelty search) can drive a search as\neffectively without genetic diversity than it can with it. When you are\nsearching for a specific objective target, deception is the overriding\npathology, which is why behavioral diversity is such a potent antidote.\nHowever, if you are searching only for novelty, then obviously deception\nis no longer the issue (since you are not looking for any one thing),\nwhich means that now other pathologies (such as prematurely losing\nstructural innovations from the population) would become more important.\nTherefore, the impact of forgoing genetic diversity might be more\nevident in that context.\n&gt;\n&gt; Furthermore, even if this issue is most evident in pure novelty\nsearch, it may still appear to some extent in any search where\nbehavioral diversity is important, since genetic diversity ultimately\ndrives behavioral diversity.\n&gt;\n&gt; This issue probably merits further study. I only mean to raise the\nquestion, not to argue that the answer is conclusive. I&#39;m guessing the\nreal answer is probably nuanced. For example, it may be that genetic\ndiversity is more important early in a run when small structural changes\ntend to have the most dramatic effects on behavior. Perhaps in later\ngenerations because the effect tends to be less the need for genotypic\nprotection might reduce. But my guess is that ultimately genetic\ndiversity and behavioral diversity both play a role in healthy\nevolution, and in fact complement each other (because genetic diversity\nhelps foster behavioral diversity). I would also guess the effect would\nbe more pronounced the more a search relies on novelty as its primary\ndriver (with pure novelty search being the most extreme such case). Of\ncourse these are currently just speculations on my part.\n&gt;\n&gt; Best,\n&gt;\n&gt; ken\n\n\n"}}