{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[{"name":"READ"}]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"userId":464818732,"authorName":"Jeff Clune","from":"Jeff Clune &lt;jclune@...&gt;","profile":"jeffreyclune","replyTo":"LIST","senderId":"rWgXXncii0HnMaQjqXuoKsPgdfVPlPWDRPn6Q-7CcxFrZHtRU_UK_Uv_3H47DxVpH1qQppdyDdUKxYVaUqmbCnb_xps","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [neat] New Paper on Combining Interactive Evolution with Novelty Search","postDate":"1400102296","msgId":6334,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDJCRjBERkIwLTA3Q0ItNDU2RS05REZELURFMkQwMjExN0VDQ0BnbWFpbC5jb20+","inReplyToHeader":"PGxrYmEzbytjZWVkYjFAWWFob29Hcm91cHMuY29tPg==","referencesHeader":"PGxrYmEzbytjZWVkYjFAWWFob29Hcm91cHMuY29tPg=="},"prevInTopic":6315,"nextInTopic":6335,"prevInTime":6333,"nextInTime":6335,"topicId":6315,"numMessagesInTopic":7,"msgSnippet":"Hello Ken and Brian, Congrats on your nice paper, especially for being nominated for a Best Paper award. ThatÆs great! I love the paper in general. I also","rawEmail":"Return-Path: &lt;jclune@...&gt;\r\nX-Sender: jclune@...\r\nX-Apparently-To: neat@yahoogroups.com\r\nX-Received: (qmail 74403 invoked by uid 102); 14 May 2014 21:18:24 -0000\r\nX-Received: from unknown (HELO mtaq6.grp.bf1.yahoo.com) (10.193.84.37)\n  by m16.grp.bf1.yahoo.com with SMTP; 14 May 2014 21:18:24 -0000\r\nX-Received: (qmail 6562 invoked from network); 14 May 2014 21:18:23 -0000\r\nX-Received: from unknown (HELO mail-ie0-f173.google.com) (209.85.223.173)\n  by mtaq6.grp.bf1.yahoo.com with SMTP; 14 May 2014 21:18:23 -0000\r\nX-Received: by mail-ie0-f173.google.com with SMTP id rp18so165733iec.4\n        for &lt;neat@yahoogroups.com&gt;; Wed, 14 May 2014 14:18:23 -0700 (PDT)\r\nX-Received: by 10.42.92.82 with SMTP id s18mr5745204icm.64.1400102303654;\n        Wed, 14 May 2014 14:18:23 -0700 (PDT)\r\nX-Original-Return-Path: &lt;jclune@...&gt;\r\nX-Received: from temp07.cs.uwyo.edu (uwyo-129-72-157-13.uwyo.edu. [129.72.157.13])\n        by mx.google.com with ESMTPSA id ab1sm36924681igd.12.2014.05.14.14.18.17\n        for &lt;neat@yahoogroups.com&gt;\n        (version=TLSv1 cipher=ECDHE-RSA-RC4-SHA bits=128/128);\n        Wed, 14 May 2014 14:18:18 -0700 (PDT)\r\nContent-Type: multipart/alternative; boundary=&quot;Apple-Mail=_32CBDB03-5539-4473-A5FE-0E1C3A3668E6&quot;\r\nMessage-Id: &lt;2BF0DFB0-07CB-456E-9DFD-DE2D02117ECC@...&gt;\r\nMime-Version: 1.0 (Mac OS X Mail 7.2 &#92;(1874&#92;))\r\nDate: Wed, 14 May 2014 15:18:16 -0600\r\nReferences: &lt;lkba3o+ceedb1@...&gt;\r\nTo: neat users group group &lt;neat@yahoogroups.com&gt;\r\nIn-Reply-To: &lt;lkba3o+ceedb1@...&gt;\r\nX-Mailer: Apple Mail (2.1874)\r\nX-eGroups-Msg-Info: 1:12:0:0:0\r\nSubject: Re: [neat] New Paper on Combining Interactive Evolution with Novelty Search\r\nX-Yahoo-Group-Post: member; u=464818732; y=GrLQSQk5bD915qtq7rpyDI3m-Z9KS-zQIm8a2cw8Taf6iJ5BUHya\r\nX-Yahoo-Profile: jeffreyclune\r\nFrom: Jeff Clune &lt;jclune@...&gt;\r\n\r\n\r\n--Apple-Mail=_32CBDB03-5539-4473-A5FE-0E1C3A3668E6\r\nContent-Transfer-Encoding: quoted-printable\r\nContent-Type: text/plain;\n\tcharset=windows-1252\r\n\r\nHello Ken and Brian,\n\nCongrats on your nice paper, especially for being nom=\r\ninated for a Best Paper award. That=92s great!\n\nI love the paper in general=\r\n. I also have a question about one specific result that I find quite intere=\r\nsting. Actually, it=92s something that I=92ve noticed in previous NS papers=\r\n, but it really jumped out at me in your paper. As such, Joel also may have=\r\n thoughts on the subject. \n\nFigure 7 is fascinating to me. The first thing =\r\nthat jumps out (which I=92ve noticed in previous NS papers), is that there =\r\nare very few points in the upper right corner of the hard map for the Novel=\r\nty Search treatment (by =93upper right corner I=92m including the thin hall=\r\nway that leads to the open, upper-right corner). Similarly, there are few p=\r\noints in the intermediate chambers of the Medium map for the NS treatment (=\r\nI=92ll focus on the hard map the rest of this email, but all of the observa=\r\ntions apply to the medium map too). Those non-well-tread areas suggests a h=\r\nuge nonlinearity in exploratory skills: my hypothesis is that the search pr=\r\nocess searches for a long while and then, boom, it suddenly produces a robo=\r\nt with the right skill set and then the problem is solved. One might expect=\r\n different from NS: one could expect it to slowly fill up the map. In fact,=\r\n this seeming nonlinearity is one reason that Roby Velez and I wanted to in=\r\nvestigate whether NS does produce such general exploratory skills in the 20=\r\n14 GECCO paper we posted recently (video: http://youtu.be/P-EqOBqjTyU   =97=\r\n pdf: http://goo.gl/Iv180r ).\n\nIf you watch videos of robots in the lineage=\r\n that produces the champion, do you see such a nonlinearity? Are there a se=\r\nries of robots that get just a bit further down the path and then, all of t=\r\nhe sudden, an amazing robot that happens to explore all the way to the goal=\r\n? If not, what is the explanation for the scarcity of points? It seems a bi=\r\nt weird that NS can produce a robot that goes all the way to the goal witho=\r\nut stopping at lots of intermediate points unless it really is good at some=\r\n general exploration skill such as wall-following, and it thus happens to w=\r\nander past the goal (at which point the stopping criterion kicks in). \n\nInt=\r\nerestingly, the fitness treatment also has this paucity of points in the up=\r\nper right-hand corner. That suggests that fitness is also producing these g=\r\neneral exploratory skills on par with NS, which is exactly what Roby and I =\r\nfound. So, if the NS robots do exhibit this nonlinear skill level-up, it se=\r\nems fitness does too. Do videos of the champ lineage show a nonlinearity he=\r\nre too? \n\nThose questions could have been asked of the original NS papers. =\r\nSpecifically in light of the new data in this paper, it=92s also interestin=\r\ng to note how the pattern changes for the other treatments. The directed tr=\r\neatment has a few more points, though it is not obviously more and could be=\r\n noise and not signal. But it=92s clear that IEC and NA-IEC are very differ=\r\nent. \n\nIEC had to inch its way toward a solution. One can empathize with th=\r\ne pain the human subjects (eplex lab members and friends/family, I presume!=\r\n) had to go through to get to a solution. Why do you think IEC was worse th=\r\nan directed evolution in this regard? I can=92t think of a good explanation=\r\n, and would be interested in your thoughts. One fun thing you could do with=\r\n this data set is test the evolvability of these genomes in the large maze =\r\nfrom the paper Roby and I just put out (and other mazes): the prediction ac=\r\ncording to the thesis that objective-driven evolution creates non-evolvable=\r\n, brittle, overwrought genomes is that these genomes would not be very evol=\r\nvable compared to the NS and Fitness genomes. \n\nThe NA-IEC data is also int=\r\neresting. On the one hand, it=92s less pathological than IEC in that there =\r\nare fewer points. But, as you mention, the humans did transition into objec=\r\ntive-driven evaluators at corners: it seems they selected anything that tur=\r\nned the corner just a bit more, inching their way around the bend. If that=\r\n=92s true, we should also expect these genomes to be less evolvable than th=\r\nose evolved by NS, Fitness, and even DirectedFitness. Why do you think NS d=\r\noesn=92t produce these corner bends, but NA-IEC does? Maybe it=92s because =\r\nNA-IEC doesn=92t spend so much time spinning its wheels early before findin=\r\ng that nonlinear level-up robot that can suddenly explore really well. \n\nWh=\r\nat do you think? It would be interesting to carry those experiments out, bu=\r\nt even if that never happens I=92d enjoy hearing your thoughts and predicti=\r\nons on these subjects. \n\nCongrats again on the nice work!\n \nBest regards,\nJ=\r\neff Clune\n\nAssistant Professor\nComputer Science\nUniversity of Wyoming\njeffc=\r\nlune@...\njeffclune.com\n\nOn May 6, 2014, at 12:36 PM, kstanley@...=\r\ns.edu wrote:\n\n&gt; Brian Woolley and I are pleased to announce our new GECCO p=\r\naper, &quot;A Novel Human-Computer Collaboration: Combining Novelty Search with =\r\nInteractive Evolution.&quot;  \n&gt; \n&gt; http://eplex.cs.ucf.edu/papers/woolley_gecco=\r\n14.pdf\n&gt; \n&gt; This paper discloses some interesting results that show that in=\r\n the hard maze domain, a human in collaboration with novelty search (and an=\r\n objective optimization function) can actually do better than novelty searc=\r\nh alone, fitness alone, human+objective optimization alone, and more.  By b=\r\netter I don&#39;t just mean in terms of number of evaluations, but even (surpri=\r\nsingly) in total clock time.  \n&gt; \n&gt; The main insight is that humans and nov=\r\nelty search (NS) are complementary forces.  NS does a great job of collecti=\r\nng potential stepping stones from the search space, but humans are extremel=\r\ny sensitive to certain very delicate key features (that may be difficult to=\r\n formalize even in a behavior characterization).  Thus if NS does most of t=\r\nhe work but humans are allowed to interleave a few very critical key decisi=\r\nons, the collaboration makes a good team.  \n&gt; \n&gt; I think of NS in this cont=\r\next as a sort of substitute for all the other users on Picbreeder when you =\r\nare instead alone by yourself with only a computer to help you.  Ideally, y=\r\nou&#39;d have hundreds of people scavenging the search space and presenting you=\r\n with every interesting stepping stone that they can, but short of that, NS=\r\n can play a similar role.\n&gt; \n&gt; One other aspect of this study that I think =\r\nis particularly interesting is the insight that we do not necessarily &quot;help=\r\n&quot; people simply by trying to figure out where they want to go and then auto=\r\nmating the search towards that inferred objective.  I think a lot of people=\r\n have the intuition that it would be cool if interactive evolution could fi=\r\ngure out the kinds of things you like and then sort of accelerate itself by=\r\n choosing the stuff you would have chosen, but much faster.  However, what =\r\nthis study shows is that we humans have a much more pressing problem than s=\r\nimply wishing to be a faster version of ourselves - rather, we need to push=\r\ned out of our comfort zone from time to time to help us see the possibiliti=\r\nes we never imagined.  Otherwise we, just like an objective search, may ten=\r\nd to stagnate.  NS can provide that push.\n&gt; \n&gt; Best,\n&gt; \n&gt; ken\n&gt; \n&gt; \n\n\r\n--Apple-Mail=_32CBDB03-5539-4473-A5FE-0E1C3A3668E6\r\nContent-Transfer-Encoding: quoted-printable\r\nContent-Type: text/html;\n\tcharset=windows-1252\r\n\r\n&lt;html&gt;&lt;head&gt;&lt;meta http-equiv=3D&quot;Content-Type&quot; content=3D&quot;text/html charset=\r\n=3Dwindows-1252&quot;&gt;&lt;/head&gt;&lt;body style=3D&quot;word-wrap: break-word; -webkit-nbsp-=\r\nmode: space; -webkit-line-break: after-white-space;&quot;&gt;Hello Ken and Brian,&lt;d=\r\niv&gt;&lt;br&gt;&lt;/div&gt;&lt;div&gt;Congrats on your nice paper, especially for being nominat=\r\ned for a Best Paper award. That=92s great!&lt;/div&gt;&lt;div&gt;&lt;br&gt;&lt;/div&gt;&lt;div&gt;I love =\r\nthe paper in general. I also have a question about one specific result that=\r\n I find quite interesting. Actually, it=92s something that I=92ve noticed i=\r\nn previous NS papers, but it really jumped out at me in your paper. As such=\r\n, Joel also may have thoughts on the subject.&nbsp;&lt;div apple-content-edite=\r\nd=3D&quot;true&quot;&gt;\n&lt;/div&gt;\n&lt;/div&gt;&lt;div&gt;&lt;br&gt;&lt;/div&gt;&lt;div&gt;Figure 7 is fascinating to me.=\r\n The first thing that jumps out (which I=92ve noticed in previous NS papers=\r\n), is that there are very few points in the upper right corner of the hard =\r\nmap for the Novelty Search treatment (by =93upper right corner I=92m includ=\r\ning the thin hallway that leads to the open, upper-right corner). Similarly=\r\n, there are few points in the intermediate chambers of the Medium map for t=\r\nhe NS treatment (I=92ll focus on the hard map the rest of this email, but a=\r\nll of the observations apply to the medium map too). Those non-well-tread a=\r\nreas suggests a huge nonlinearity in exploratory skills: my hypothesis is t=\r\nhat the search process searches for a long while and then, boom, it suddenl=\r\ny produces a robot with the right skill set and then the problem is solved.=\r\n One might expect different from NS: one could expect it to slowly fill up =\r\nthe map. In fact, this seeming nonlinearity is one reason that Roby Velez a=\r\nnd I wanted to investigate whether NS does produce such general exploratory=\r\n skills in the 2014 GECCO paper we posted recently (video: &lt;a href=3D&quot;http:=\r\n//youtu.be/P-EqOBqjTyU&quot;&gt;http://youtu.be/P-EqOBqjTyU&lt;/a&gt; &nbsp; =97 pdf:&nbs=\r\np;&lt;a href=3D&quot;http://goo.gl/Iv180r&quot;&gt;http://goo.gl/Iv180r&lt;/a&gt; ).&lt;/div&gt;&lt;div&gt;&lt;b=\r\nr&gt;&lt;/div&gt;&lt;div&gt;If you watch videos of robots in the lineage that produces the=\r\n champion, do you see such a nonlinearity? Are there a series of robots tha=\r\nt get just a bit further down the path and then, all of the sudden, an amaz=\r\ning robot that happens to explore all the way to the goal? If not, what is =\r\nthe explanation for the scarcity of points? It seems a bit weird that NS ca=\r\nn produce a robot that goes all the way to the goal without stopping at lot=\r\ns of intermediate points unless it really is good at some general explorati=\r\non skill such as wall-following, and it thus happens to wander past the goa=\r\nl (at which point the stopping criterion kicks in).&nbsp;&lt;/div&gt;&lt;div&gt;&lt;br&gt;&lt;/d=\r\niv&gt;&lt;div&gt;Interestingly, the fitness treatment also has this paucity of point=\r\ns in the upper right-hand corner. That suggests that fitness is also produc=\r\ning these general exploratory skills on par with NS, which is exactly what =\r\nRoby and I found. So, if the NS robots do exhibit this nonlinear skill leve=\r\nl-up, it seems fitness does too. Do videos of the champ lineage show a nonl=\r\ninearity here too?&nbsp;&lt;/div&gt;&lt;div&gt;&lt;br&gt;&lt;/div&gt;&lt;div&gt;Those questions could hav=\r\ne been asked of the original NS papers. Specifically in light of the new da=\r\nta in this paper, it=92s also interesting to note how the pattern changes f=\r\nor the other treatments. The directed treatment has a few more points, thou=\r\ngh it is not obviously more and could be noise and not signal. But it=92s c=\r\nlear that IEC and NA-IEC are very different.&nbsp;&lt;/div&gt;&lt;div&gt;&lt;br&gt;&lt;/div&gt;&lt;div=\r\n&gt;IEC had to inch its way toward a solution. One can empathize with the pain=\r\n the human subjects (eplex lab members and friends/family, I presume!) had =\r\nto go through to get to a solution. Why do you think IEC was worse than dir=\r\nected evolution in this regard? I can=92t think of a good explanation, and =\r\nwould be interested in your thoughts. One fun thing you could do with this =\r\ndata set is test the evolvability of these genomes in the large maze from t=\r\nhe paper Roby and I just put out (and other mazes): the prediction accordin=\r\ng to the thesis that objective-driven evolution creates non-evolvable, brit=\r\ntle, overwrought genomes is that these genomes would not be very evolvable =\r\ncompared to the NS and Fitness genomes.&nbsp;&lt;/div&gt;&lt;div&gt;&lt;br&gt;&lt;/div&gt;&lt;div&gt;The =\r\nNA-IEC data is also interesting. On the one hand, it=92s less pathological =\r\nthan IEC in that there are fewer points. But, as you mention, the humans di=\r\nd transition into objective-driven evaluators at corners: it seems they sel=\r\nected anything that turned the corner just a bit more, inching their way ar=\r\nound the bend. If that=92s true, we should also expect these genomes to be =\r\nless evolvable than those evolved by NS, Fitness, and even DirectedFitness.=\r\n Why do you think NS doesn=92t produce these corner bends, but NA-IEC does?=\r\n Maybe it=92s because NA-IEC doesn=92t spend so much time spinning its whee=\r\nls early before finding that nonlinear level-up robot that can suddenly exp=\r\nlore really well.&nbsp;&lt;/div&gt;&lt;div&gt;&lt;br&gt;&lt;/div&gt;&lt;div&gt;What do you think? It woul=\r\nd be interesting to carry those experiments out, but even if that never hap=\r\npens I=92d enjoy hearing your thoughts and predictions on these subjects.&n=\r\nbsp;&lt;/div&gt;&lt;div&gt;&lt;br&gt;&lt;/div&gt;&lt;div&gt;Congrats again on the nice work!&lt;/div&gt;&lt;div&gt;&n=\r\nbsp;&lt;/div&gt;&lt;div apple-content-edited=3D&quot;true&quot;&gt;&lt;span style=3D&quot;font-family: &#39;T=\r\nimes&#39;; font-size: 14px; color: rgb( 0,  0,  0)&quot;&gt;&lt;div style=3D&quot;color: rgb(0,=\r\n 0, 0); font-family: Times; font-style: normal; font-variant: normal; font-=\r\nweight: normal; letter-spacing: normal; line-height: normal; orphans: 2; te=\r\nxt-align: -webkit-auto; text-indent: 0px; text-transform: none; white-space=\r\n: normal; widows: 2; word-spacing: 0px; -webkit-text-size-adjust: auto; -we=\r\nbkit-text-stroke-width: 0px; word-wrap: break-word; -webkit-nbsp-mode: spac=\r\ne; -webkit-line-break: after-white-space; &quot;&gt;&lt;span style=3D&quot;font-family: Tim=\r\nes; color: rgb(0, 0, 0); &quot;&gt;&lt;div style=3D&quot;color: rgb(0, 0, 0); font-family: =\r\nTimes; font-style: normal; font-variant: normal; font-weight: normal; lette=\r\nr-spacing: normal; line-height: normal; orphans: 2; text-align: -webkit-aut=\r\no; text-indent: 0px; text-transform: none; white-space: normal; widows: 2; =\r\nword-spacing: 0px; -webkit-text-size-adjust: auto; -webkit-text-stroke-widt=\r\nh: 0px; word-wrap: break-word; -webkit-nbsp-mode: space; -webkit-line-break=\r\n: after-white-space; &quot;&gt;&lt;span style=3D&quot;font-family: Times; color: rgb(0, 0, =\r\n0); &quot;&gt;&lt;div style=3D&quot;color: rgb(0, 0, 0); font-family: Times; font-style: no=\r\nrmal; font-variant: normal; font-weight: normal; letter-spacing: normal; li=\r\nne-height: normal; orphans: 2; text-align: -webkit-auto; text-indent: 0px; =\r\ntext-transform: none; white-space: normal; widows: 2; word-spacing: 0px; -w=\r\nebkit-text-size-adjust: auto; -webkit-text-stroke-width: 0px; word-wrap: br=\r\neak-word; -webkit-nbsp-mode: space; -webkit-line-break: after-white-space; =\r\n&quot;&gt;&lt;div style=3D&quot;color: rgb(0, 0, 0); font-family: Times; font-style: normal=\r\n; font-variant: normal; font-weight: normal; letter-spacing: normal; line-h=\r\neight: normal; orphans: 2; text-align: -webkit-auto; text-indent: 0px; text=\r\n-transform: none; white-space: normal; widows: 2; word-spacing: 0px; -webki=\r\nt-text-size-adjust: auto; -webkit-text-stroke-width: 0px; word-wrap: break-=\r\nword; -webkit-nbsp-mode: space; -webkit-line-break: after-white-space; &quot;&gt;&lt;s=\r\npan style=3D&quot;font-family: Times; color: rgb(0, 0, 0); &quot;&gt;&lt;div style=3D&quot;color=\r\n: rgb(0, 0, 0); font-family: Times; font-style: normal; font-variant: norma=\r\nl; font-weight: normal; letter-spacing: normal; line-height: normal; orphan=\r\ns: 2; text-align: -webkit-auto; text-indent: 0px; text-transform: none; whi=\r\nte-space: normal; widows: 2; word-spacing: 0px; -webkit-text-size-adjust: a=\r\nuto; -webkit-text-stroke-width: 0px; word-wrap: break-word; -webkit-nbsp-mo=\r\nde: space; -webkit-line-break: after-white-space; &quot;&gt;&lt;span style=3D&quot;font-fam=\r\nily: Times; color: rgb(0, 0, 0); &quot;&gt;&lt;div style=3D&quot;color: rgb(0, 0, 0); font-=\r\nfamily: Times; font-style: normal; font-variant: normal; font-weight: norma=\r\nl; letter-spacing: normal; line-height: normal; orphans: 2; text-align: -we=\r\nbkit-auto; text-indent: 0px; text-transform: none; white-space: normal; wid=\r\nows: 2; word-spacing: 0px; -webkit-text-size-adjust: auto; -webkit-text-str=\r\noke-width: 0px; word-wrap: break-word; -webkit-nbsp-mode: space; -webkit-li=\r\nne-break: after-white-space; &quot;&gt;&lt;span style=3D&quot;font-family: Times; color: rg=\r\nb(0, 0, 0); &quot;&gt;&lt;div style=3D&quot;color: rgb(0, 0, 0); font-family: Times; font-s=\r\ntyle: normal; font-variant: normal; font-weight: normal; letter-spacing: no=\r\nrmal; line-height: normal; orphans: 2; text-align: -webkit-auto; text-inden=\r\nt: 0px; text-transform: none; white-space: normal; widows: 2; word-spacing:=\r\n 0px; -webkit-text-size-adjust: auto; -webkit-text-stroke-width: 0px; word-=\r\nwrap: break-word; -webkit-nbsp-mode: space; -webkit-line-break: after-white=\r\n-space; &quot;&gt;&lt;span style=3D&quot;font-family: Times; color: rgb(0, 0, 0); &quot;&gt;&lt;div st=\r\nyle=3D&quot;color: rgb(0, 0, 0); font-family: Times; font-style: normal; font-va=\r\nriant: normal; font-weight: normal; letter-spacing: normal; line-height: no=\r\nrmal; orphans: 2; text-align: -webkit-auto; text-indent: 0px; text-transfor=\r\nm: none; white-space: normal; widows: 2; word-spacing: 0px; -webkit-text-si=\r\nze-adjust: auto; -webkit-text-stroke-width: 0px; word-wrap: break-word; -we=\r\nbkit-nbsp-mode: space; -webkit-line-break: after-white-space; &quot;&gt;&lt;span style=\r\n=3D&quot;font-family: Times; color: rgb(0, 0, 0); &quot;&gt;&lt;div style=3D&quot;color: rgb(0, =\r\n0, 0); font-family: Times; font-style: normal; font-variant: normal; font-w=\r\neight: normal; letter-spacing: normal; line-height: normal; orphans: 2; tex=\r\nt-align: -webkit-auto; text-indent: 0px; text-transform: none; white-space:=\r\n normal; widows: 2; word-spacing: 0px; -webkit-text-size-adjust: auto; -web=\r\nkit-text-stroke-width: 0px; word-wrap: break-word; -webkit-nbsp-mode: space=\r\n; -webkit-line-break: after-white-space; &quot;&gt;&lt;div style=3D&quot;color: rgb(0, 0, 0=\r\n); font-family: Times; font-style: normal; font-variant: normal; font-weigh=\r\nt: normal; letter-spacing: normal; line-height: normal; orphans: 2; text-al=\r\nign: -webkit-auto; text-indent: 0px; text-transform: none; white-space: nor=\r\nmal; widows: 2; word-spacing: 0px; -webkit-text-size-adjust: auto; -webkit-=\r\ntext-stroke-width: 0px; word-wrap: break-word; -webkit-nbsp-mode: space; -w=\r\nebkit-line-break: after-white-space; &quot;&gt;&lt;div style=3D&quot;color: rgb(0, 0, 0); f=\r\nont-family: Times; font-style: normal; font-variant: normal; font-weight: n=\r\normal; letter-spacing: normal; line-height: normal; orphans: 2; text-align:=\r\n -webkit-auto; text-indent: 0px; text-transform: none; white-space: normal;=\r\n widows: 2; word-spacing: 0px; -webkit-text-size-adjust: auto; -webkit-text=\r\n-stroke-width: 0px; word-wrap: break-word; -webkit-nbsp-mode: space; -webki=\r\nt-line-break: after-white-space; &quot;&gt;&lt;span class=3D&quot;Apple-style-span&quot; style=\r\n=3D&quot;border-collapse: separate; color: rgb(0, 0, 0); font-family: Times; fon=\r\nt-style: normal; font-variant: normal; font-weight: normal; letter-spacing:=\r\n normal; line-height: normal; orphans: 2; text-align: -webkit-auto; text-in=\r\ndent: 0px; text-transform: none; white-space: normal; widows: 2; word-spaci=\r\nng: 0px; border-spacing: 0px; -webkit-text-decorations-in-effect: none; -we=\r\nbkit-text-size-adjust: auto; -webkit-text-stroke-width: 0px; &quot;&gt;&lt;div style=\r\n=3D&quot;word-wrap: break-word; -webkit-nbsp-mode: space; -webkit-line-break: af=\r\nter-white-space; &quot;&gt;&lt;span class=3D&quot;Apple-style-span&quot; style=3D&quot;border-collaps=\r\ne: separate; color: rgb(0, 0, 0); font-family: Times; font-style: normal; f=\r\nont-variant: normal; font-weight: normal; letter-spacing: normal; line-heig=\r\nht: normal; orphans: 2; text-align: -webkit-auto; text-indent: 0px; text-tr=\r\nansform: none; white-space: normal; widows: 2; word-spacing: 0px; border-sp=\r\nacing: 0px; -webkit-text-decorations-in-effect: none; -webkit-text-size-adj=\r\nust: auto; -webkit-text-stroke-width: 0px; &quot;&gt;&lt;div style=3D&quot;word-wrap: break=\r\n-word; -webkit-nbsp-mode: space; -webkit-line-break: after-white-space; &quot;&gt;&lt;=\r\nspan class=3D&quot;Apple-style-span&quot; style=3D&quot;border-collapse: separate; color: =\r\nrgb(0, 0, 0); font-variant: normal; letter-spacing: normal; line-height: no=\r\nrmal; orphans: 2; text-align: -webkit-auto; text-indent: 0px; text-transfor=\r\nm: none; white-space: normal; widows: 2; word-spacing: 0px; border-spacing:=\r\n 0px; -webkit-text-decorations-in-effect: none; -webkit-text-size-adjust: a=\r\nuto; -webkit-text-stroke-width: 0px; &quot;&gt;&lt;div style=3D&quot;word-wrap: break-word;=\r\n -webkit-nbsp-mode: space; -webkit-line-break: after-white-space; &quot;&gt;&lt;span c=\r\nlass=3D&quot;Apple-style-span&quot; style=3D&quot;border-collapse: separate; color: rgb(0,=\r\n 0, 0); font-variant: normal; letter-spacing: normal; line-height: normal; =\r\norphans: 2; text-align: -webkit-auto; text-indent: 0px; text-transform: non=\r\ne; white-space: normal; widows: 2; word-spacing: 0px; border-spacing: 0px; =\r\n-webkit-text-decorations-in-effect: none; -webkit-text-size-adjust: auto; -=\r\nwebkit-text-stroke-width: 0px; &quot;&gt;&lt;div style=3D&quot;font-weight: normal; font-st=\r\nyle: normal; word-wrap: break-word; -webkit-nbsp-mode: space; -webkit-line-=\r\nbreak: after-white-space; &quot;&gt;Best regards,&lt;br&gt;&lt;font class=3D&quot;Apple-style-spa=\r\nn&quot; color=3D&quot;#0a5d19&quot;&gt;&lt;b&gt;Jeff Clune&lt;/b&gt;&lt;/font&gt;&lt;br&gt;&lt;br&gt;Assistant Professor&lt;br=\r\n&gt;Computer Science&lt;/div&gt;&lt;div style=3D&quot;font-weight: normal; font-style: norma=\r\nl; word-wrap: break-word; -webkit-nbsp-mode: space; -webkit-line-break: aft=\r\ner-white-space; &quot;&gt;University of Wyoming&lt;br&gt;&lt;a href=3D&quot;mailto:jeffclune@uwyo=\r\n.edu&quot;&gt;jeffclune@...&lt;/a&gt;&lt;br&gt;jeffclune.com&lt;/div&gt;&lt;/span&gt;&lt;/div&gt;&lt;/span&gt;&lt;/di=\r\nv&gt;&lt;/span&gt;&lt;/div&gt;&lt;/span&gt;&lt;/div&gt;&lt;/div&gt;&lt;/div&gt;&lt;/span&gt;&lt;/div&gt;&lt;/span&gt;&lt;/div&gt;&lt;/span&gt;&lt;/=\r\ndiv&gt;&lt;/span&gt;&lt;/div&gt;&lt;/span&gt;&lt;/div&gt;&lt;/div&gt;&lt;/span&gt;&lt;/div&gt;&lt;/span&gt;&lt;/div&gt;&lt;/span&gt;\n&lt;/div=\r\n&gt;\n&lt;br&gt;&lt;div&gt;&lt;div&gt;On May 6, 2014, at 12:36 PM, &lt;a href=3D&quot;mailto:kstanley@cs.=\r\nutexas.edu&quot;&gt;kstanley@...&lt;/a&gt; wrote:&lt;/div&gt;&lt;br class=3D&quot;Apple-inter=\r\nchange-newline&quot;&gt;&lt;blockquote type=3D&quot;cite&quot;&gt;\n\n\n\n\n\n\n\n\n\n\n\n\n \n&lt;div style=3D&quot;back=\r\nground-color: #fff;&quot;&gt;\n&lt;span style=3D&quot;display:none&quot;&gt;&nbsp;&lt;/span&gt;\n\n\n\n    &lt;di=\r\nv id=3D&quot;ygrp-text&quot;&gt;&lt;p&gt;Brian Woolley and I are pleased to announce our new G=\r\nECCO paper, &quot;A Novel Human-Computer Collaboration: Combining Novelty Search=\r\n with Interactive Evolution.&quot;&nbsp; &lt;br&gt;&lt;br&gt;&lt;a rel=3D&quot;nofollow&quot; target=3D&quot;_=\r\nblank&quot; href=3D&quot;http://eplex.cs.ucf.edu/papers/woolley_gecco14.pdf&quot;&gt;http://e=\r\nplex.cs.ucf.edu/papers/woolley_gecco14.pdf&lt;/a&gt;&lt;br&gt;&lt;br&gt;This paper discloses =\r\nsome interesting results that show that in the hard maze domain, a human in=\r\n collaboration with novelty search (and an objective optimization function)=\r\n can actually do better than novelty search alone, fitness alone, human+obj=\r\nective optimization alone, and more.&nbsp; By better I don&#39;t just mean in t=\r\nerms of number of evaluations, but even (surprisingly) in total clock time.=\r\n&nbsp; &lt;br&gt;&lt;br&gt;The main insight is that humans and novelty search (NS) are =\r\ncomplementary forces.&nbsp; NS does a great job of collecting potential ste=\r\npping stones from the search space, but humans are extremely sensitive to c=\r\nertain very delicate key features (that may be difficult to formalize even =\r\nin a behavior characterization).&nbsp; Thus if NS does most of the work but=\r\n humans are allowed to interleave a few very critical key decisions, the co=\r\nllaboration makes a good team.&nbsp; &lt;br&gt;&lt;br&gt;I think of NS in this context =\r\nas a sort of substitute for all the other users on Picbreeder when you are =\r\ninstead alone by yourself with only a computer to help you.&nbsp; Ideally, =\r\nyou&#39;d have hundreds of people scavenging the search space and presenting yo=\r\nu with every interesting stepping stone that they can, but short of that, N=\r\nS can play a similar role.&lt;br&gt;&lt;br&gt;One other aspect of this study that I thi=\r\nnk is particularly interesting is the insight that we do not necessarily &quot;h=\r\nelp&quot; people simply by trying to figure out where they want to go and then a=\r\nutomating the search towards that inferred objective.&nbsp; I think a lot o=\r\nf people have the intuition that it would be cool if interactive evolution =\r\ncould figure out the kinds of things you like and then sort of accelerate i=\r\ntself by choosing the stuff you would have chosen, but much faster.&nbsp; H=\r\nowever, what this study shows is that we humans have a much more pressing p=\r\nroblem than simply wishing to be a faster version of ourselves - rather, we=\r\n need to pushed out of our comfort zone from time to time to help us see th=\r\ne possibilities we never imagined.&nbsp; Otherwise we, just like an objecti=\r\nve search, may tend to stagnate.&nbsp; NS can provide that push.&lt;br&gt;&lt;br&gt;Bes=\r\nt,&lt;br&gt;&lt;br&gt;ken&lt;/p&gt;\n\n    &lt;/div&gt;\n     \n\n    \n\n&lt;/div&gt;\n\n\n\n&lt;!-- end group email -=\r\n-&gt;\n\n&lt;/blockquote&gt;&lt;/div&gt;&lt;br&gt;&lt;/body&gt;&lt;/html&gt;\r\n--Apple-Mail=_32CBDB03-5539-4473-A5FE-0E1C3A3668E6--\r\n\n"}}