{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[{"name":"READ"}]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"userId":127853030,"authorName":"Colin Green","from":"Colin Green &lt;cgreen@...&gt;","profile":"alienseedpod","replyTo":"LIST","senderId":"AB2xsllW1Zu4V-lOyNlw5-66e8HF_xki3OfQHMJ0XUMfXZg4uD7HGReRhgN487QXR0QrSHFPJbi0Nh2ZBLwPzB9VBivE4tk5Zg","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [neat] Re: Further Introduction","postDate":"1064351735","msgId":88,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDNGNzBCN0Y3LjQwNzA4MDFAZHNsLnBpcGV4LmNvbT4=","referencesHeader":"PGJrbmlwbiszbWRzQGVHcm91cHMuY29tPg=="},"prevInTopic":87,"nextInTopic":89,"prevInTime":87,"nextInTime":89,"topicId":82,"numMessagesInTopic":20,"msgSnippet":"... I agree that self organisation provides canalization, and for me models based upon the chemical signalling in biology seem the most promising. As was aid","rawEmail":"Return-Path: &lt;cgreen@...&gt;\r\nX-Sender: cgreen@...\r\nX-Apparently-To: neat@yahoogroups.com\r\nReceived: (qmail 50280 invoked from network); 23 Sep 2003 21:15:43 -0000\r\nReceived: from unknown (66.218.66.167)\n  by m13.grp.scd.yahoo.com with QMQP; 23 Sep 2003 21:15:43 -0000\r\nReceived: from unknown (HELO pengo.systems.pipex.net) (62.241.160.193)\n  by mta6.grp.scd.yahoo.com with SMTP; 23 Sep 2003 21:15:42 -0000\r\nReceived: from dsl.pipex.com (81-86-175-101.dsl.pipex.com [81.86.175.101])\n\tby pengo.systems.pipex.net (Postfix) with ESMTP id 559854C004F3\n\tfor &lt;neat@yahoogroups.com&gt;; Tue, 23 Sep 2003 22:15:39 +0100 (BST)\r\nMessage-ID: &lt;3F70B7F7.4070801@...&gt;\r\nDate: Tue, 23 Sep 2003 22:15:35 +0100\r\nUser-Agent: Mozilla/5.0 (Windows; U; Windows NT 5.1; en-US; rv:1.0.0) Gecko/20020530\r\nX-Accept-Language: en-us, en\r\nMIME-Version: 1.0\r\nTo: neat@yahoogroups.com\r\nSubject: Re: [neat] Re: Further Introduction\r\nReferences: &lt;bknipn+3mds@...&gt;\r\nContent-Type: text/plain; charset=us-ascii; format=flowed\r\nContent-Transfer-Encoding: 7bit\r\nFrom: Colin Green &lt;cgreen@...&gt;\r\nReply-To: cgreen@...\r\nX-Yahoo-Group-Post: member; u=127853030\r\nX-Yahoo-Profile: alienseedpod\r\n\r\nKenneth Stanley wrote:\n\n&gt;--- In neat@yahoogroups.com, Colin Green &lt;cgreen@d...&gt; wrote:\n&gt;\n&gt;&gt; or whether the \n&gt;&gt;    \n&gt;&gt;\n&gt;&gt;development phase seen in biology is purely a necessity of existing \n&gt;&gt;\n&gt;&gt;and trying to grow in the real, physical world with limited resources\n&gt;&gt;    \n&gt;&gt;\n&gt;Definitely that is the big question.  What aspects of biological\n&gt;development are computationally efficient and what aspects are\n&gt;necessitated by physics?  That&#39;s one reason I wrote the Taxonomy\n&gt;paper, to point out that no one has sorted this out yet.  There are\n&gt;several properties of biological development that we really need to\n&gt;implement with experiments to see how they contribute to evolvability.\n&gt;It is almost certain, though, that some of these properties are\n&gt;crucial, such as canalization (as you say below).\n&gt; \n&gt;  \n&gt;\n&gt;&gt;At the same time I can see that a more indirect encoding might\n&gt;&gt;    \n&gt;&gt;\n&gt;possibly \n&gt;  \n&gt;\n&gt;&gt;support robustness in a genome encoding (canalization). This is\n&gt;&gt;    \n&gt;&gt;\n&gt;were \n&gt;  \n&gt;\n&gt;&gt;things get difficult, certainly the relative positioning in my own \n&gt;&gt;system gives us some sort of canalization as does my connection strategy \n&gt;&gt;    \n&gt;&gt;\n&gt;\n&gt;Yes I agree that your technique, particularly the closest-connection\n&gt;rule, provides some kind of canalization.\n&gt;(Cangelosi et al. implemented a similar rule)  But one thing\n&gt;that I&#39;ve been talking about with people at UT is the connection\n&gt;between canalization and self-organization.  That is, a system\n&gt;that is canalized needs to be ability to self-organize, since \n&gt;otherwise it is brittle.  And self-organization would seem to require\n&gt;some kind of signaling among parts.  So signaling might be key.\n&gt;  \n&gt;\nI agree that self organisation provides canalization, and for me models \nbased upon the chemical signalling in biology seem the most promising. \nAs was aid in the taxonomy paper,  we don&#39;t necessarily have to simulate \nchemical diffusion and the complex spacial signalling that goes on \nbecause we can explictly provide positional information, thus providing \na computational short-cut. Computer models are also not limited to \nlimites of physical space, e.g. my NN model has a 1D positioning system \nbut the number of connections is limitless and any neuron can connect to \nany other regardless of positioning. Capitalizing on freedoms we have \n(within computer models) hopefully goes some way to making up for the \nlack of resources available in a computer model when compared to nature.\n\n\n&gt;&gt;For now I&#39;m interested in implementing speciation and seeing what\n&gt;&gt;    \n&gt;&gt;\n&gt;sort \n&gt;  \n&gt;\n&gt;&gt;of impact it has. As in crossover I intend to compare the tree \n&gt;&gt;structures in order to generate a compatibility number with which\n&gt;&gt;    \n&gt;&gt;\n&gt;to \n&gt;  \n&gt;\n&gt;&gt;drive the speciation. This then should create a system very much\n&gt;&gt;    \n&gt;&gt;\n&gt;like \n&gt;  \n&gt;\n&gt;&gt;NEAT but with the ability to complexify - that&#39;s the theory anyhow\n&gt;&gt;    \n&gt;&gt;\n&gt;:-)\n&gt;  \n&gt;\n&gt;\n&gt;That sounds like it will be quite interesting.  But when you said,\n&gt;&quot;NEAT but with the ability to complexify,&quot; did you mean &quot;but without\n&gt;the ability to complexify?&quot;  I&#39;m not clear how complexification enters\n&gt;into your system?\n&gt;  \n&gt;\nSorry I am using the wrong term. I meant &#39;the ability for re-use&#39; - via \nthe reference node.\n\n&gt;Also, are you putting in some kind of historical marking system?  If\n&gt;not, how can you implement accurate speciation?  Similar looking trees\n&gt;can have quite different meanings,can&#39;t they?\n&gt;  \n&gt;\nYes, that became apparent when I came to code the comparison routine. :) \n Yeh, like NEAT I use an &#39;innovation&#39; number on each node of the tree.\n\nPreliminary results don&#39;t show any significant benefit from speciation, \nhowever I have identified a possible reason why and I have some avenues \nof investigation to follow up. Basically on close inspection of the \ntrees I can see a large number of redundant(neutral) nodes. Allowing \nneutral nodes to leak in effectively means that the fitness search space \nis not closely coupled to the compatibility space. Two genomes that \ndescribe the same network can have wildly different tree structures due \nto large numbers of neutral nodes and are therefore deemed incompatible.\n\nMy evaluation function already goes some way to tackle this problem by \nreducing the fitness scores with a punishment factor. This is basically \na weighted combination of genome size, decoded network size (complexity \nactually, since I factor in connections) and CPU decode time. However it \nseems the punishment is not strong enough to keep the neutral nodes from \nproliferating.  However if I increase the punishment too much I am \nafraid of stifling innovation.\n\nPerhaps one solution is to use a stepped punishment function. E.g. \ninstead of:\n\npunishment = numberOfNodes / 3.0;\n  use\npunishment = floor(numberOfNodes / 3.0);\n\nUsing this function allows genomes to more freely explore the search \nspace in jumps of 3 nodes. When they reach 4, 7, 10 etc. they are \nsuddenly punished and have a big step to overcome (which is bad). In \nexperiments this approach definitely improved search times, but I feel \nthe the stepping may come back to bite me.\n\nOut of curiousity does anyone know if NEAT has been applied to the prey \ncapture problem? This is the only environment I have available to-date \nfor comparison with other systems.\n\nCheers,\n\nColin.\n\n\n\n\n"}}