{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[{"name":"READ"}]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"userId":127853030,"authorName":"Colin Green","from":"Colin Green &lt;cgreen@...&gt;","profile":"alienseedpod","replyTo":"LIST","senderId":"k7GOj12F2nxQGT0noUTVf969yZMXIpXbIM39Z-mxbPSuBF8R8CdwQiAE65PIMQGXagx1pNC189avrvgv9XbcpT1hL3woWbLskA","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [neat] Bloat","postDate":"1086124735","msgId":935,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDQwQkNGMkJGLjkwMDAyMDhAZHNsLnBpcGV4LmNvbT4=","inReplyToHeader":"PDE5YjEwZDUxMDQwNTMwMDYyNDc4OTVhZmNkQG1haWwuZ21haWwuY29tPg==","referencesHeader":"PGM5YXNqbCt0dGluQGVHcm91cHMuY29tPiA8MTliMTBkNTEwNDA1MzAwNjI0Nzg5NWFmY2RAbWFpbC5nbWFpbC5jb20+"},"prevInTopic":912,"nextInTopic":938,"prevInTime":934,"nextInTime":936,"topicId":904,"numMessagesInTopic":68,"msgSnippet":"Hi Derek, Ken, ... You re right that culling stagnant species does often give rise to jumps in a search. But do you agree that some gradual improvements come","rawEmail":"Return-Path: &lt;cgreen@...&gt;\r\nX-Sender: cgreen@...\r\nX-Apparently-To: neat@yahoogroups.com\r\nReceived: (qmail 56406 invoked from network); 1 Jun 2004 21:18:58 -0000\r\nReceived: from unknown (66.218.66.167)\n  by m25.grp.scd.yahoo.com with QMQP; 1 Jun 2004 21:18:58 -0000\r\nReceived: from unknown (HELO shockwave.systems.pipex.net) (62.241.160.9)\n  by mta6.grp.scd.yahoo.com with SMTP; 1 Jun 2004 21:18:57 -0000\r\nReceived: from dsl.pipex.com (81-86-175-101.dsl.pipex.com [81.86.175.101])\n\tby shockwave.systems.pipex.net (Postfix) with ESMTP id 204A61C00182\n\tfor &lt;neat@yahoogroups.com&gt;; Tue,  1 Jun 2004 22:18:56 +0100 (BST)\r\nMessage-ID: &lt;40BCF2BF.9000208@...&gt;\r\nDate: Tue, 01 Jun 2004 22:18:55 +0100\r\nUser-Agent: Mozilla/5.0 (Windows; U; Windows NT 5.1; en-US; rv:1.5) Gecko/20031007\r\nX-Accept-Language: en-us, en\r\nMIME-Version: 1.0\r\nTo: neat@yahoogroups.com\r\nReferences: &lt;c9asjl+ttin@...&gt; &lt;19b10d5104053006247895afcd@...&gt;\r\nIn-Reply-To: &lt;19b10d5104053006247895afcd@...&gt;\r\nContent-Type: text/plain; charset=ISO-8859-1; format=flowed\r\nContent-Transfer-Encoding: 7bit\r\nX-eGroups-Remote-IP: 62.241.160.9\r\nFrom: Colin Green &lt;cgreen@...&gt;\r\nSubject: Re: [neat] Bloat\r\nX-Yahoo-Group-Post: member; u=127853030\r\nX-Yahoo-Profile: alienseedpod\r\n\r\nHi Derek, Ken,\n\nDerek James wrote:\n\n&gt;&gt;&gt;--- In neat@yahoogroups.com, Colin Green &lt;cgreen@d...&gt; wrote:\n&gt;&gt;&gt;      \n&gt;&gt;&gt;\n&gt;&gt;But some junk may be a precursor to building some larger useful structure.\n&gt;&gt;    \n&gt;&gt;\n&gt;\n&gt;Well, I guess this is really an open question.  It&#39;s possible that\n&gt;either neutral, or even maladaptive, structure could be coopted at a\n&gt;later point and made useful.  Ken says he&#39;s seen jumps out of stagnant\n&gt;stretches and seems to attribute it to this dynamic.  I guess I\n&gt;haven&#39;t worked with NEAT enough to experience this phenomenon, but\n&gt;there certainly could be other explanations.  For example, speciation\n&gt;could be key in kicking out of stagnant stretches.\n&gt;  \n&gt;\nYou&#39;re right that culling stagnant species does often give rise to \n&#39;jumps&#39; in a search. But do you agree that some gradual improvements \ncome about by connecting to neurons that were previously not \ncontributing to the fitness of a genome. This must be the case because \nas I said before ALL neurons start out like this. So really the question \nis not whether redundant structure sometimes gets incorporated, but how \nmuch redundant structure gets incorporated and participates in the \nsearch process? how much redundancy is too much? That is, at what point \ndo we say that the structure has become so large that the chances of it \nrepresenting something beneficial are so small that we should throw it away?\n\nI don&#39;t think there is really a limit since some small sub-structure \nwithin a large random network may get connected too and become \nbeneficial. I think this must happen in nature to some extent since DNA \nseems so abundant and seems to contain a whole load of junk (not proven \nthough AFAIK, junk DNA could turn out to have a useful and direct role). \nFrom that you could conclude that DNA  is cheap to carry around and \ntherefore nature has not much reason to keep it trimmed to a minimum, \ncertainly I think I&#39;m right in saying that there are a lot of genes in \nthe human genome that are from our ancient history and are permanently \ndisabled. Another example would be birds that carry around a lot of \ndinosaur DNA(their distant ancestors) - I think genes for teeth have \nbeen found in birds for example.  So nature just switches of genes and \nalso(I think!) carries a load of junk, some of which I&#39;m sure would have \nbeen used as starting points for building new novel proteins in the past.\n\nWhen I first read about NEAT I was slightly perplexed by it&#39;s lack of \npunishment for genome size. I was sure that such a system would bloat \nout of control in a very short time, and without the benefit that nature \nhas of massive parallelism and literaly all the time in the world, this \nreally isn&#39;t a good thing. But then I started thinking that allowing \njunk to accumulate as nature does may actually be one of NEATs strong \npoints. Derek&#39;s right that this isn&#39;t proven (AFAIK), but instinctively \nI feel that it is and that it&#39;s definitely worth some investigation.\n\n&gt;But if this proved to be the case, this seems counter to the\n&gt;methodology of incrementally adding features and testing them along\n&gt;the way.  If we have good reason to think that excess raw material\n&gt;that&#39;s not adaptive now will become so at some point, and that this is\n&gt;important to kicking out of stagnation, then why start minimally?\n&gt;\n&gt;Why not start with a fair amount of junk?\n&gt;  \n&gt;\nWell why not indeed?  One problem here is that if you have a lot of \nconnections coming into an output node then it becomes difficult, if not \nimposible for any individual deletions mutations to effect the \nfunctionality of the network, since you will just get a load of noise on \nthe output node from all of the different connnections. But it is quite \npossible to start with genomes that have interconected hidden nodes that \nare completely self contained, or that only connect to inputs nodes. The \nsearch can then choose to connect into these hidden nodes selectively.  \nThis might actually be a good way of searching, just dump a load of \nstructures from past experiments into a seed population, ensure they \naren&#39;t connected to output nodes and you have something very similar to \ndisabled genes in biological DNA.\n\n&gt;On Sat, 29 May 2004 20:42:29 -0000, Kenneth Stanley\n&gt;&lt;kstanley@...&gt; wrote:\n&gt;  \n&gt;\n&gt;&gt;To the extent\n&gt;&gt;that your &quot;bloated&quot; solution works, you probably couldn&#39;t have\n&gt;&gt;gotten it to work in that larger space if you&#39;d started in it\n&gt;&gt;directly, but now here you are in a more promising part of that\n&gt;&gt;space.  \n&gt;&gt;    \n&gt;&gt;\n&gt;\n&gt;But how do you know you&#39;re in a more promising part of the search\n&gt;space?  It could be that all that excess neutral topology could become\n&gt;adaptive at some point, but there&#39;s a greater likelihood that it will\n&gt;not.\n&gt;  \n&gt;\nYes that&#39;s right. But that is what evolution is all about. The vast \nmajority of the time it comes up with useless structures, and every once \nin a while (like every few million years or so) something novel is \nfound. Obviously we don&#39;t have a millions or billions of years, but then \nwe aren&#39;t trying to evolve enzymes an eyes! We&#39;re taling about \nstructures that are several orders of magnitude less complex.\n\n&gt;&gt; It even brings up a\n&gt;&gt;question which Derek, Philip, and I have talked about in email,\n&gt;&gt;which is whether the nice results for blended runs also apply in\n&gt;&gt;very complex domains.\n&gt;&gt;    \n&gt;&gt;\n&gt;\n&gt;Well, this may depend on the gradient of the fitness function.  I\n&gt;think Shimon&#39;s notion of task decomposition addresses this. \n&gt;Basically, you wouldn&#39;t want to try to evolve a robotic soccer team\n&gt;against a high-performing hand-coded team, based just on\n&gt;wins/losses/ties.  Your evolving controllers will just lose every\n&gt;time.  But if you can successfully decompose the problem (which real\n&gt;soccer players do), into distinct objectives (dribbling, passing,\n&gt;shooting) you can incrementally build up skills and hopefully combine\n&gt;them to solve holistic goals, such as winning a game.\n&gt;\n&gt;It seems to me that an incremental approach to improving fitness\n&gt;correlates with the notion of incrementally adding topological\n&gt;features and testing them along the way.\n&gt;  \n&gt;\nYes I agree. I think a smoth fitness curve, rather than several large \nsteps is important. I think that nature has in the past climbed up some \nvery big steps as well as travelling up some nice steady curves. You can \nsee this if you look at a one of those evolution &#39;family-tree&#39; type \ndiagrams. There have been long periods of time where everything stayed \npretty much the same and then for no apparent reason at several points \nin history there has been a sudden explosion of species - a single jump \nwas made somewhere and this then leads to a long period of travelling up \na gentle fitness curve until the next plateu is reached. Then we wait \nanother 20 million years or whavtever for the next jump.  We don&#39;t have \ntime to ewait for big jumps, so the smoother the fitness curve the \nbetter, but in most problems you are going to need a series of very \nsmall jumps, and to make these jumps you need more than a single extra \nconnection ina network, you need several of them to be incorporated all \nat once.\n\nApologies for the slightly longer than expected reply, hope it doesn&#39;t \nsound too much like rambling :)\n\nColin.\n\n\n"}}