{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[{"name":"READ"}]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"userId":183620858,"authorName":"Derek James","from":"Derek James &lt;djames@...&gt;","profile":"blue5432","replyTo":"LIST","senderId":"HF-SyNWuFGWlnDxUcAAOnrjqjgw_NpELJUWzQ6t-DkOjr6Cd8mpiK0qwfTUJnB1Pj3G3pym3OmOo3udub9OGXJwBfsGX","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [neat] Bloat","postDate":"1086200141","msgId":954,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDE5YjEwZDUxMDQwNjAyMTExNTNmNjViODcwQG1haWwuZ21haWwuY29tPg==","inReplyToHeader":"PDQwQkNGMkJGLjkwMDAyMDhAZHNsLnBpcGV4LmNvbT4=","referencesHeader":"PGM5YXNqbCt0dGluQGVHcm91cHMuY29tPiA8MTliMTBkNTEwNDA1MzAwNjI0Nzg5NWFmY2RAbWFpbC5nbWFpbC5jb20+IDw0MEJDRjJCRi45MDAwMjA4QGRzbC5waXBleC5jb20+"},"prevInTopic":938,"nextInTopic":958,"prevInTime":953,"nextInTime":955,"topicId":904,"numMessagesInTopic":68,"msgSnippet":"... That was just one possible explanation for fitness jumps following stagnant stretches.  There may be others. ... I m not really sure that is the question.","rawEmail":"Return-Path: &lt;djames@...&gt;\r\nX-Sender: djames@...\r\nX-Apparently-To: neat@yahoogroups.com\r\nReceived: (qmail 49658 invoked from network); 2 Jun 2004 18:15:42 -0000\r\nReceived: from unknown (66.218.66.166)\n  by m22.grp.scd.yahoo.com with QMQP; 2 Jun 2004 18:15:42 -0000\r\nReceived: from unknown (HELO mproxy.gmail.com) (216.239.56.242)\n  by mta5.grp.scd.yahoo.com with SMTP; 2 Jun 2004 18:15:42 -0000\r\nReceived: by mproxy.gmail.com with SMTP id x71so12650cwb\n        for &lt;neat@yahoogroups.com&gt;; Wed, 02 Jun 2004 11:15:41 -0700 (PDT)\r\nReceived: by 10.11.122.64 with SMTP id u64mr503990cwc;\n        Wed, 02 Jun 2004 11:15:41 -0700 (PDT)\r\nMessage-ID: &lt;19b10d5104060211153f65b870@...&gt;\r\nDate: Wed, 2 Jun 2004 13:15:41 -0500\r\nTo: neat@yahoogroups.com\r\nIn-Reply-To: &lt;40BCF2BF.9000208@...&gt;\r\nMime-Version: 1.0\r\nContent-Type: text/plain; charset=US-ASCII\r\nContent-Transfer-Encoding: 7bit\r\nReferences: &lt;c9asjl+ttin@...&gt; &lt;19b10d5104053006247895afcd@...&gt; &lt;40BCF2BF.9000208@...&gt;\r\nX-eGroups-Remote-IP: 216.239.56.242\r\nFrom: Derek James &lt;djames@...&gt;\r\nSubject: Re: [neat] Bloat\r\nX-Yahoo-Group-Post: member; u=183620858\r\nX-Yahoo-Profile: blue5432\r\n\r\nOn Tue, 01 Jun 2004 22:18:55 +0100, Colin Green &lt;cgreen@...&gt; wrote:\n&gt; You&#39;re right that culling stagnant species does often give rise to\n&gt; &#39;jumps&#39; in a search. \n\nThat was just one possible explanation for fitness jumps following\nstagnant stretches.  There may be others.\n\n&gt; But do you agree that some gradual improvements\n&gt; come about by connecting to neurons that were previously not\n&gt; contributing to the fitness of a genome. This must be the case because\n&gt; as I said before ALL neurons start out like this. So really the question\n&gt; is not whether redundant structure sometimes gets incorporated, but how\n&gt; much redundant structure gets incorporated and participates in the\n&gt; search process? \n\nI&#39;m not really sure that is the question.  New connections arise, but\nthey may be forming new connections to neurons that *were* already\ndoing something useful.  Not all new topological additions are linking\nup redundant structures.\n\nIn biology, as far as I understand, more often than not new features\nare coopted from features that already served another adaptive purpose\n(this dynamic is called &quot;exaptation&quot;).  It is widely held that\nfeathers first evolved for the purposes of insulation, and were later\ncoopted for flight.  Another hypothesis proposes that legs evolved\nfrom lateral fins used to help fish that foraged near shores, with\ndense vegetation and debris, to navigate more easily in such\nenvironments (helping them &quot;semi-walk&quot; through or over dense aquatic\nvegetation and push themselves along the river bottom in shallow\nareas).\n\nRarely do organisms carry around a bunch of neutral morphology just\nwaiting for it to become adaptive.  That&#39;s not a very good\nevolutionary strategy.\n\nHowever, you bring up a good point about excess capacity in DNA, or\njunk DNA.  More below...\n\n&gt; I don&#39;t think there is really a limit since some small sub-structure\n&gt; within a large random network may get connected too and become\n&gt; beneficial. I think this must happen in nature to some extent since DNA\n&gt; seems so abundant and seems to contain a whole load of junk (not proven\n&gt; though AFAIK, junk DNA could turn out to have a useful and direct role).\n&gt; From that you could conclude that DNA  is cheap to carry around and\n&gt; therefore nature has not much reason to keep it trimmed to a minimum,\n&gt; certainly I think I&#39;m right in saying that there are a lot of genes in\n&gt; the human genome that are from our ancient history and are permanently\n&gt; disabled. \n\nRight...and this is a good point.  NEAT already employs this concept\nwith the notion of disabled connection genes.  But there is a *huge*\ndifference between carrying around a lot of disabled DNA, as opposed\nto actually expressing all of that DNA in the phenotype.  One is\ncheap, as you point out...the other is grossly expensive.\n\nOur implementation of NEAT does not use disabled genes, so of course\nwe didn&#39;t use them in the experiments for our paper.  They might be\nvery important.  We won&#39;t know for sure (until somebody does the\nexperiments). :)\n\nSo I could be sold that &quot;junk DNA&quot; might be useful, perhaps extremely\nso.  But the idea of a lot of neutral or slightly maladaptive\nstructure expressed in the phenotype, that is just waiting around to\nbecome useful?  I&#39;m *highly* skeptical that this is a good idea.\n\n&gt; &gt;Why not start with a fair amount of junk?\n&gt; &gt;\n&gt; Well why not indeed?  One problem here is that if you have a lot of\n&gt; connections coming into an output node then it becomes difficult, if not\n&gt; imposible for any individual deletions mutations to effect the\n&gt; functionality of the network, since you will just get a load of noise on\n&gt; the output node from all of the different connnections. But it is quite\n&gt; possible to start with genomes that have interconected hidden nodes that\n&gt; are completely self contained, or that only connect to inputs nodes. The\n&gt; search can then choose to connect into these hidden nodes selectively.\n&gt; This might actually be a good way of searching, just dump a load of\n&gt; structures from past experiments into a seed population, ensure they\n&gt; aren&#39;t connected to output nodes and you have something very similar to\n&gt; disabled genes in biological DNA.\n\nI think the easiest way to mimic junk DNA from biology is to simply\nstart with a lot of random genes that are simply not expressed, and\nallow them to collect up during the run.  Although, do you use\ndisabled genes to determine compatibility?  If so, this calculation\ncan be computationally expensive, and if you have extremely large\ngenomes that you have to compare every generation, that might be an\nissue.\n\n&gt; Yes that&#39;s right. But that is what evolution is all about. The vast\n&gt; majority of the time it comes up with useless structures, and every once\n&gt; in a while (like every few million years or so) something novel is\n&gt; found. \n\nRight...but the useless structures are not generally kept around.  You\ndon&#39;t see organisms with lots of useless organs or appendages just\nwaiting to become useful.\n\n&gt; Apologies for the slightly longer than expected reply, hope it doesn&#39;t\n&gt; sound too much like rambling :)\n\nNo...I think it&#39;s a good discussion.\n\nDerek\n\n"}}