{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[{"name":"READ"}]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"userId":127853030,"authorName":"Colin Green","from":"Colin Green &lt;cgreen@...&gt;","profile":"alienseedpod","replyTo":"LIST","senderId":"VXRAqEUiygNb5kg5OTPzrZMeed48KcNvF7Ilojk74iLxPYo72OkLP2heezMspbMVC7OgbsoI1vigTRCmo29HcCHUpENAUFesLA","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [neat] Bloat","postDate":"1086214550","msgId":958,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDQwQkU1MTk2LjgwMTA1MDJAZHNsLnBpcGV4LmNvbT4=","inReplyToHeader":"PDE5YjEwZDUxMDQwNjAyMTExNTNmNjViODcwQG1haWwuZ21haWwuY29tPg==","referencesHeader":"PGM5YXNqbCt0dGluQGVHcm91cHMuY29tPiA8MTliMTBkNTEwNDA1MzAwNjI0Nzg5NWFmY2RAbWFpbC5nbWFpbC5jb20+IDw0MEJDRjJCRi45MDAwMjA4QGRzbC5waXBleC5jb20+IDwxOWIxMGQ1MTA0MDYwMjExMTUzZjY1Yjg3MEBtYWlsLmdtYWlsLmNvbT4="},"prevInTopic":954,"nextInTopic":961,"prevInTime":957,"nextInTime":959,"topicId":904,"numMessagesInTopic":68,"msgSnippet":"... Agreed. ... I m still not sure if you ve grasped my main point here. Ok so sometimes a new connection appears and it immediately increases the fitness of a","rawEmail":"Return-Path: &lt;cgreen@...&gt;\r\nX-Sender: cgreen@...\r\nX-Apparently-To: neat@yahoogroups.com\r\nReceived: (qmail 3766 invoked from network); 2 Jun 2004 22:15:53 -0000\r\nReceived: from unknown (66.218.66.167)\n  by m10.grp.scd.yahoo.com with QMQP; 2 Jun 2004 22:15:53 -0000\r\nReceived: from unknown (HELO colossus.systems.pipex.net) (62.241.160.73)\n  by mta6.grp.scd.yahoo.com with SMTP; 2 Jun 2004 22:15:53 -0000\r\nReceived: from dsl.pipex.com (81-86-175-101.dsl.pipex.com [81.86.175.101])\n\tby colossus.systems.pipex.net (Postfix) with ESMTP id A62321C001A6\n\tfor &lt;neat@yahoogroups.com&gt;; Wed,  2 Jun 2004 23:15:49 +0100 (BST)\r\nMessage-ID: &lt;40BE5196.8010502@...&gt;\r\nDate: Wed, 02 Jun 2004 23:15:50 +0100\r\nUser-Agent: Mozilla/5.0 (Windows; U; Windows NT 5.1; en-US; rv:1.5) Gecko/20031007\r\nX-Accept-Language: en-us, en\r\nMIME-Version: 1.0\r\nTo: neat@yahoogroups.com\r\nReferences: &lt;c9asjl+ttin@...&gt; &lt;19b10d5104053006247895afcd@...&gt; &lt;40BCF2BF.9000208@...&gt; &lt;19b10d5104060211153f65b870@...&gt;\r\nIn-Reply-To: &lt;19b10d5104060211153f65b870@...&gt;\r\nContent-Type: text/plain; charset=ISO-8859-1; format=flowed\r\nContent-Transfer-Encoding: 7bit\r\nX-eGroups-Remote-IP: 62.241.160.73\r\nFrom: Colin Green &lt;cgreen@...&gt;\r\nSubject: Re: [neat] Bloat\r\nX-Yahoo-Group-Post: member; u=127853030\r\nX-Yahoo-Profile: alienseedpod\r\n\r\nDerek James wrote:\n\n&gt;On Tue, 01 Jun 2004 22:18:55 +0100, Colin Green &lt;cgreen@...&gt; wrote:\n&gt;  \n&gt;\n&gt;&gt;You&#39;re right that culling stagnant species does often give rise to\n&gt;&gt;&#39;jumps&#39; in a search. \n&gt;&gt;    \n&gt;&gt;\n&gt;\n&gt;That was just one possible explanation for fitness jumps following\n&gt;stagnant stretches.  There may be others.\n&gt;  \n&gt;\nAgreed.\n\n&gt;&gt;But do you agree that some gradual improvements\n&gt;&gt;come about by connecting to neurons that were previously not\n&gt;&gt;contributing to the fitness of a genome. This must be the case because\n&gt;&gt;as I said before ALL neurons start out like this. So really the question\n&gt;&gt;is not whether redundant structure sometimes gets incorporated, but how\n&gt;&gt;much redundant structure gets incorporated and participates in the\n&gt;&gt;search process? \n&gt;&gt;    \n&gt;&gt;\n&gt;\n&gt;I&#39;m not really sure that is the question.  New connections arise, but\n&gt;they may be forming new connections to neurons that *were* already\n&gt;doing something useful.  Not all new topological additions are linking\n&gt;up redundant structures.\n&gt;  \n&gt;\nI&#39;m still not sure if you&#39;ve grasped my main point here. Ok so sometimes \na new connection appears and it immediately increases the fitness of a \ngenome - good. But whenever a neuron is added it can *never* be \nimmediately beneficial because NEAT adds them in such a way as to make \nthem equivalent to the connection that was split. In order to make that \nneuron useful a further mutation in a later generation must connect to \nthat neuron. So therefore this neuron is a very minimal type of \nredundant structure, I can prove that this redundant structure sometimes \ngets incorporated and made useful because I have seen networks that have \nhidden nodes and these networks are proven to need those hidden nodes to \ndo what they do.\n\nIf we establish this as a fact then we can go on to ask - are larger \nredundant structures sometimes incorporated and made useful? and not \njust single neurons?\n\n&gt;In biology, as far as I understand, more often than not new features\n&gt;are coopted from features that already served another adaptive purpose\n&gt;(this dynamic is called &quot;exaptation&quot;).  It is widely held that\n&gt;feathers first evolved for the purposes of insulation, and were later\n&gt;coopted for flight.  Another hypothesis proposes that legs evolved\n&gt;from lateral fins used to help fish that foraged near shores, with\n&gt;dense vegetation and debris, to navigate more easily in such\n&gt;environments (helping them &quot;semi-walk&quot; through or over dense aquatic\n&gt;vegetation and push themselves along the river bottom in shallow\n&gt;areas).\n&gt;\n&gt;  \n&gt;\nOk this really is encroaching on the subjest of indirect encodings, \nwhich I purposefully put to one side since that&#39;s a whole other subject.\n\n&gt;However, you bring up a good point about excess capacity in DNA, or\n&gt;junk DNA.  More below...\n&gt;\n&gt;  \n&gt;\n&gt;&gt;I don&#39;t think there is really a limit since some small sub-structure\n&gt;&gt;within a large random network may get connected too and become\n&gt;&gt;beneficial. I think this must happen in nature to some extent since DNA\n&gt;&gt;seems so abundant and seems to contain a whole load of junk (not proven\n&gt;&gt;though AFAIK, junk DNA could turn out to have a useful and direct role).\n&gt;&gt;From that you could conclude that DNA  is cheap to carry around and\n&gt;&gt;therefore nature has not much reason to keep it trimmed to a minimum,\n&gt;&gt;certainly I think I&#39;m right in saying that there are a lot of genes in\n&gt;&gt;the human genome that are from our ancient history and are permanently\n&gt;&gt;disabled. \n&gt;&gt;    \n&gt;&gt;\n&gt;\n&gt;Right...and this is a good point.  NEAT already employs this concept\n&gt;with the notion of disabled connection genes.  But there is a *huge*\n&gt;difference between carrying around a lot of disabled DNA, as opposed\n&gt;to actually expressing all of that DNA in the phenotype.  One is\n&gt;cheap, as you point out...the other is grossly expensive.\n&gt;  \n&gt;\nYes I see your point. Expressing all of the junk in the phenotype may \nwork to some extent but it wouldn&#39;t be very efficient. I sort of touched \non this in the last post when I mentioned that junk structures that \nconnect to output nodes would drown out any signals from useful \nstructures. This would be like me having, say, loads of extra limbs - \nthe usual four are useful, but start adding extra ones and they just get \nin the way :)\n\n&gt;So I could be sold that &quot;junk DNA&quot; might be useful, perhaps extremely\n&gt;so.  But the idea of a lot of neutral or slightly maladaptive\n&gt;structure expressed in the phenotype, that is just waiting around to\n&gt;become useful?  I&#39;m *highly* skeptical that this is a good idea.\n&gt;  \n&gt;\nYes I agree with this.\n\n[...]\n\n&gt;\n&gt;I think the easiest way to mimic junk DNA from biology is to simply\n&gt;start with a lot of random genes that are simply not expressed, and\n&gt;allow them to collect up during the run.  Although, do you use\n&gt;disabled genes to determine compatibility?  If so, this calculation\n&gt;can be computationally expensive, and if you have extremely large\n&gt;genomes that you have to compare every generation, that might be an\n&gt;issue.\n&gt;  \n&gt;\nWell my code includes disabled genes in determining compatibility, and \nI&#39;m pretty sure I based this on Ken&#39;s NEAT code/papers. Perhaps what we \nneed then is some library of structures external to the population of \ngenomes. A new mutation could be to randomly insert pieces of structure \nfrom this library into a genome. That way you get the as-yet-unproven \nbenefit of &#39;junk DNA&#39; without the baggage of having to carry it around \nin the genomes. If a useful &#39;chunk&#39; is found then it then becomes part \nof a genome and subject to propogation through the population through \nthe normal means of crossover and asexual reproduction.\n\n&gt;&gt;Yes that&#39;s right. But that is what evolution is all about. The vast\n&gt;&gt;majority of the time it comes up with useless structures, and every once\n&gt;&gt;in a while (like every few million years or so) something novel is\n&gt;&gt;found. \n&gt;&gt;    \n&gt;&gt;\n&gt;\n&gt;Right...but the useless structures are not generally kept around.  You\n&gt;don&#39;t see organisms with lots of useless organs or appendages just\n&gt;waiting to become useful.\n&gt;  \n&gt;\nWell that&#39;s not entirely true. If the useless appendages hinder the \norganism or require a significant resources to grow and/or maintain then \nindividuals with these characteristics will be selected against over \ntime. But if the appendages aren&#39;t too expensive and aren&#39;t getting in \nthe way then they can indeed stick around. One that comes to mind is the \nhuman appendix, and I&#39;ve never found my little toe to be all that \nuseful. Well Ok you did say &#39;generally&#39; - these &#39;extras&#39; are mostly \nspecial cases. I agree with the general priniciple that organisms don&#39;t \ncarry around loads of  appendages in the hope that one might become \nuseful, like some biological equivalent of a swiss army knife :)\n\nColin.\n\n\n\n\n"}}