{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[{"name":"READ"}]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"userId":54567749,"authorName":"Kenneth Stanley","from":"&quot;Kenneth Stanley&quot; &lt;kstanley@...&gt;","profile":"kenstanley01","replyTo":"LIST","senderId":"xHbuibt_fJZLTd6119lCEWYMNuoEP7vFCOOb15zGF0akagO8W4oXBY4BahsHl3ohO_KNKap0JuZDBbJtdYrBqV6nO_9oOl7Mz5VkTeLwnbeT","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: Bloat","postDate":"1086381051","msgId":1000,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGM5cW01cis0a2ZjQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDE5YjEwZDUxMDQwNjA0MTI0MzUxNzQ0ODM2QG1haWwuZ21haWwuY29tPg=="},"prevInTopic":998,"nextInTopic":1001,"prevInTime":999,"nextInTime":1001,"topicId":904,"numMessagesInTopic":68,"msgSnippet":"... you ... don t ... accumulation ... would ... I think the problem here is that we are speaking in general terms about several distinct situations.  For","rawEmail":"Return-Path: &lt;kstanley@...&gt;\r\nX-Sender: kstanley@...\r\nX-Apparently-To: neat@yahoogroups.com\r\nReceived: (qmail 16794 invoked from network); 4 Jun 2004 20:33:49 -0000\r\nReceived: from unknown (66.218.66.167)\n  by m22.grp.scd.yahoo.com with QMQP; 4 Jun 2004 20:33:49 -0000\r\nReceived: from unknown (HELO n24.grp.scd.yahoo.com) (66.218.66.80)\n  by mta6.grp.scd.yahoo.com with SMTP; 4 Jun 2004 20:33:49 -0000\r\nReceived: from [66.218.67.179] by n24.grp.scd.yahoo.com with NNFMP; 04 Jun 2004 20:30:52 -0000\r\nDate: Fri, 04 Jun 2004 20:30:51 -0000\r\nTo: neat@yahoogroups.com\r\nMessage-ID: &lt;c9qm5r+4kfc@...&gt;\r\nIn-Reply-To: &lt;19b10d51040604124351744836@...&gt;\r\nUser-Agent: eGroups-EW/0.82\r\nMIME-Version: 1.0\r\nContent-Type: text/plain; charset=ISO-8859-1\r\nContent-Length: 4845\r\nX-Mailer: Yahoo Groups Message Poster\r\nX-eGroups-Remote-IP: 66.218.66.80\r\nFrom: &quot;Kenneth Stanley&quot; &lt;kstanley@...&gt;\r\nSubject: Re: Bloat\r\nX-Yahoo-Group-Post: member; u=54567749\r\nX-Yahoo-Profile: kenstanley01\r\n\r\n--- In neat@yahoogroups.com, Derek James &lt;djames@g...&gt; wrote:\n&gt; On Fri, 04 Jun 2004 00:17:33 -0000, Kenneth Stanley\n&gt; &lt;kstanley@c...&gt; wrote:\n&gt; &gt; Well sure I agree that is bloat, but it&#39;s only bloating because \nyou\n&gt; &gt; are adding structure faster than it can be evaluated.  \n&gt; \n&gt; But according to the arguments I&#39;m hearing in this thread, you \ndon&#39;t\n&gt; necessarily think it is necessary to immediately evaluate all\n&gt; structure, right?  I thought I heard you arguing for the \naccumulation\n&gt; of untested structure, in the hope that at some *later* point it \nwould\n&gt; prove beneficial.\n&gt; \n&gt; So if accumulations of structure that aren&#39;t contributing to the\n&gt; fitness of the organism aren&#39;t bloat, then what is?\n&gt; \n\nI think the problem here is that we are speaking in general terms \nabout several distinct situations.  For example, to say &quot;NEAT is \nbased on a gradualist philosophy&quot; or &quot;bloat is bad&quot; and ask whether \nsuch statements are true or false is entirely missing the complex \nnuances of the dynamics of a system like this.  It depends on the \nsituation; blanket statements don&#39;t capture the reality.\n\nWhat I am saying is this:\n\n-If fitness is consistently improving, then structure should be \nadded gradually and in increments, while leaving the smaller \nstructures around as well until they fall behind in fitness.  \n\n-If fitness is stagnating, the range of spaces being explored should \nbe expanded.  If fitness is stagnating, it is *not* a good idea to \ntry to add structure only gradually and evaluate every little bit to \nsee whether its an improvement because whatever you add may have no \neffect until you enter a sufficiently large space to express a \nbetter solution.\n\n-&quot;Not contributing to fitness&quot; is different than &quot;reducing \nfitness.&quot;  You are using these terms interchangeably.  If I am \nstagnating and I manage to add structure that does not reduce \nfitness, that is a good thing, not a bad thing, because I&#39;m \nincreasing my range of candidate spaces.\n\n-Duplicating a &quot;good&quot; gene in DNA is really not the same as taking \none good thing and getting two of them.  The goodness of a gene is \ncompletely context-dependent and a lot of the time duplicating it in \na new context has absolutely no immediate benefit, just as adding \nnew neural structure may have no immediate benefit, yet no cost on \nperformance either.\n\n-&quot;Accumulation of untested structure&quot; is a misnomer (you said I was \narguing against it, but it&#39;s not what I&#39;m talking about).  All \nstructure should be tested.  If you let untested structure \naccumulate, fitness would plunge.  The point is to allow tested \nneutral structure to accumulate during periods of stagnation, but \nonly in certain species.  That is not bloat, that&#39;s good policy.\n\n&gt; Colin suggests keeping such structure around for a certain amount \nof\n&gt; time, and then after a certain period of stagnation, killing those\n&gt; organisms off.  Is it only bloat after it has been given a large\n&gt; number of generations to try to prove itself?\n&gt; \n&gt; &gt; Again, it&#39;s kind of loaded to call it &quot;superfluous.&quot;  You are \nassuming\n&gt; &gt; what you&#39;re trying to prove in a way.  That extra structure may \nbe\n&gt; &gt; necessary, as Colin&#39;s been saying.  But I also wonder if it slows\n&gt; &gt; anything down anyway.  In general the performance of anything\n&gt; &gt; surviving in NEAT that has more structure is in the ballpark of \nthe\n&gt; &gt; performance of things with less structure.  In other words, you \ndon&#39;t\n&gt; &gt; end up keeping around extra structure that severely cripples\n&gt; &gt; performance.  So where are you seeing the slowdown?  \n&gt; \n&gt; It increases the network activation, compatibility calculation, and\n&gt; the dimensionality of the search.\n&gt; \n\nThe point with NEAT is that we are trying to get access to good \nparts of high-dimensional space.  To say that increasing \ndimensionality is flat out bad is a generalization.  NEAT is based \non the philosophy that starting search *directly* in high-\ndimensional space is not going to work, so you have to ascend into \nit.  But certainly when lower-dimensional spaces have been \nexhaustively searched, expanding dimensionality is a good idea, not \na bad one.\n\n&gt; If these aren&#39;t really issues, then why doesn&#39;t NEAT start with a\n&gt; range of complexity in the initial population?  The more complex\n&gt; individuals in the initial population will perform as well as the \nless\n&gt; complex individuals.\n&gt; \n\nBut that&#39;s the whole point: complex individuals *won&#39;t* perform as \nwell as simple ones if you just start out with a range like that!  \nBut if you build up to higher levels of complexity than they will \neventually perform better than their simpler counterparts.  There is \nan event of ascension that happens when the complex networks surpass \nthe others; that&#39;s why we are investing in the future by protecting \ninnovation- we eventually anticipate these more complex genotypes \nbecoming better.\n\nken\n\n\n"}}