{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[{"name":"READ"}]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"userId":54567749,"authorName":"Kenneth Stanley","from":"&quot;Kenneth Stanley&quot; &lt;kstanley@...&gt;","profile":"kenstanley01","replyTo":"LIST","senderId":"9a3SeOzXYdI1AoHNLDb-NidEoRtXAz1bi-CeseUfNgTpLChtj-BsS_Diaohx-F6u-VSlVt2d6O-4cx8w8-g4DR_z5c_bphRMjDbaOZVU5sIX","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: Bloat","postDate":"1086650004","msgId":1023,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGNhMnNxaytvaW5hQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGNhMnBxMCs4NG5hQGVHcm91cHMuY29tPg=="},"prevInTopic":1022,"nextInTopic":1024,"prevInTime":1022,"nextInTime":1024,"topicId":904,"numMessagesInTopic":68,"msgSnippet":"Derek and Philip (and others who may have used a similar interpretation), First, anyone else who had this confusion please let me know.  (I m wondering how","rawEmail":"Return-Path: &lt;kstanley@...&gt;\r\nX-Sender: kstanley@...\r\nX-Apparently-To: neat@yahoogroups.com\r\nReceived: (qmail 88813 invoked from network); 7 Jun 2004 23:13:51 -0000\r\nReceived: from unknown (66.218.66.217)\n  by m25.grp.scd.yahoo.com with QMQP; 7 Jun 2004 23:13:51 -0000\r\nReceived: from unknown (HELO n9.grp.scd.yahoo.com) (66.218.66.93)\n  by mta2.grp.scd.yahoo.com with SMTP; 7 Jun 2004 23:13:51 -0000\r\nReceived: from [66.218.67.135] by n9.grp.scd.yahoo.com with NNFMP; 07 Jun 2004 23:13:26 -0000\r\nDate: Mon, 07 Jun 2004 23:13:24 -0000\r\nTo: neat@yahoogroups.com\r\nMessage-ID: &lt;ca2sqk+oina@...&gt;\r\nIn-Reply-To: &lt;ca2pq0+84na@...&gt;\r\nUser-Agent: eGroups-EW/0.82\r\nMIME-Version: 1.0\r\nContent-Type: text/plain; charset=ISO-8859-1\r\nContent-Length: 4782\r\nX-Mailer: Yahoo Groups Message Poster\r\nX-eGroups-Remote-IP: 66.218.66.93\r\nFrom: &quot;Kenneth Stanley&quot; &lt;kstanley@...&gt;\r\nSubject: Re: Bloat\r\nX-Yahoo-Group-Post: member; u=54567749\r\nX-Yahoo-Profile: kenstanley01\r\n\r\nDerek and Philip (and others who may have used a similar \ninterpretation),\n\nFirst, anyone else who had this confusion please let me know.  (I&#39;m \nwondering how widespread it is.)\n\nIt is probably inevitable that in a fairly large and complicated \nsystem people will interpret certain things that seem clear to each \nindividual in different ways.  Unfortunately this seems to be the \ncase here, and I&#39;m sorry about the confusion.\n\nUltimately, the difference between our two systems is just in the \nrate of adding links and nodes.  That rate is indeed quite different \n(unless you made yours extremely small), but otherwise, both systems \nare still NEAT, so I don&#39;t think it&#39;s *that* surprising that your \nsystem still works...it&#39;s just pumping more structure in faster. \nMost likely that&#39;s a liability and so your current performance can \nbe even further improved.  Not necessarily bad news!\n\nUnfortunately, it may explain why you found blended runs to be such \nan advantage, so it may mean further experiments are needed.  Not \nterrible news, though!  It&#39;s still interesting to note that high \nrates of structure adding combined with high rates of deletion \ntogether may come out fairly effective.  However, what we now need \nto know is whether your blending was just compensating for an overly \naggressive structure building policy, or whether your results \ngeneralize.\n\nAs for the points of ambiguity...\n\nOur EC paper stated:\n\n&quot;In smaller populations, the probability of adding a new node was \n0.03 and the probability of a new link mutation was 0.05. In the \nlarger population, the probability of adding a new link was 0.3.&quot;\n\nNote that this does not use the term &quot;mutation rate,&quot; which you and \nDerek were thinking of.  Note &quot;the probability of adding a link&quot; \nwould be a strange way to phrase something that could add more than \none link.\n\nWhen we talked about weight mutation, we said:\n\n&quot;There was an 80% chance of a genome having its connection weights \nmutated, in which case each weight had a 90% chance of being \nuniformly perturbed and a 10% chance of being assigned a new random \nvalue.&quot;\n\nNote again, no use of the ambiguous term &quot;mutation rate.&quot;  It says \nthere is an 80% chance of any genome having its links mutated.\n\nNevertheless, ambiguity is in the eye of the beholder, and if it was \nambiguous to you, then that&#39;s how it is.   But I am glad now to have \ngotten to the bottom of this.\n\nAs for the final question of whether you can add a link and a node \nat the same time, in my system you can&#39;t.  However, it would hardly \nmake a difference.  What makes a difference is adding big globs of \nstructure all at once vs. adding just one or on a rare occasion two \npieces.\n\nken\n\n--- In neat@yahoogroups.com, &quot;Philip Tucker&quot; &lt;ptucker@g...&gt; wrote:\n&gt; &gt; Ah, we may have hit on a reason for some of our disagreements!  \nThe \n&gt; &gt; add_connection mutation rate is the probability that an \n*individual \n&gt; &gt; genome* might have a single connection added.  In other words, \nin a \n&gt; &gt; population of 100 individuals and a 0.02 rate, you would expect \nto \n&gt; &gt; get on average 2 new connections over the entire population in a \n&gt; &gt; single generation.\n&gt; \n&gt; Wow.  Yeah, that&#39;s a pretty friggin&#39; big difference!  Weird that \nour \n&gt; results were as similar as they were give such a significant \n&gt; discrpency in implementation.  Of course, doing it our way with \nlower \n&gt; topological mutation rates might wind up doing about the same \nthing \n&gt; anyway.\n&gt; \n&gt; So, let me make sure I have this clear: &quot;mutation rate&quot; means \n&gt; something different in the context of topological mutations from \n&gt; weigth mutations, right?  Weight mutation rate is the percentage \nof \n&gt; connection *genes* that will have their weights tweaked.  Add \n&gt; connection and add neuron rates are the percentage of \n*chromosomes* \n&gt; that will be modified.\n&gt; \n&gt; I guess we were biologically inspired in our interpretation.  \n&gt; Typically, a mutation rate is a function of the genetic material, \n&gt; right?  A given gene has a certain chance of being modified each \n&gt; generation.  And there&#39;s nothing stopping 2 mutations from \noccurring \n&gt; in the same individual.\n&gt; \n&gt; &gt; In addition, it is also true that only one add connection \nmutation \n&gt; &gt; can happen to a single individual in a generation.\n&gt; \n&gt; Can both happen; i.e., can a chromosome have 1 connection and 1 \nnode \n&gt; added in the same generation?  If so, can the node be added on the \n&gt; new connection, or a connection be added to the new node?\n&gt; \n&gt; &gt; It seems to me that your interpetation was that the mutation rate\n&gt; &gt; is on a &quot;per empty slot&quot; basis.  That&#39;s radically different than \nmy \n&gt; &gt; NEAT implementation...interesting though that that works at\n&gt; &gt; all...is that how ANJI has been working?\n&gt; \n&gt; Indeed it is.  Time for me to go change the API doc ...\n&gt; \n&gt; - Philip\n\n\n"}}