{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[{"name":"READ"}]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"userId":54567749,"authorName":"Kenneth Stanley","from":"&quot;Kenneth Stanley&quot; &lt;kstanley@...&gt;","profile":"kenstanley01","replyTo":"LIST","senderId":"4kyhdVK76io34QMfxYeTwa2RjxOlth_HCP9KLYjiZ9PT-G9X77uTUvv3PaBQB5SdU2dmOSl61ISH0KUAyZSFf_Le3P9tKQYAVgzF5MFso9gj","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: A sense of perspective (long post great read - slightly off topic)","postDate":"1088316571","msgId":1146,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGNibG9hcitxcmhvQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGNibDhkNytpNDduQGVHcm91cHMuY29tPg=="},"prevInTopic":1145,"nextInTopic":1147,"prevInTime":1145,"nextInTime":1147,"topicId":1145,"numMessagesInTopic":29,"msgSnippet":"Brendon, Thanks for the article, I appreciate the point.  Humanlike intelligence is still far far away.  Still, if any path is on the right track I think it s","rawEmail":"Return-Path: &lt;kstanley@...&gt;\r\nX-Sender: kstanley@...\r\nX-Apparently-To: neat@yahoogroups.com\r\nReceived: (qmail 46420 invoked from network); 27 Jun 2004 06:09:35 -0000\r\nReceived: from unknown (66.218.66.216)\n  by m11.grp.scd.yahoo.com with QMQP; 27 Jun 2004 06:09:35 -0000\r\nReceived: from unknown (HELO n26.grp.scd.yahoo.com) (66.218.66.82)\n  by mta1.grp.scd.yahoo.com with SMTP; 27 Jun 2004 06:09:35 -0000\r\nReceived: from [66.218.67.138] by n26.grp.scd.yahoo.com with NNFMP; 27 Jun 2004 06:09:34 -0000\r\nDate: Sun, 27 Jun 2004 06:09:31 -0000\r\nTo: neat@yahoogroups.com\r\nMessage-ID: &lt;cbloar+qrho@...&gt;\r\nIn-Reply-To: &lt;cbl8d7+i47n@...&gt;\r\nUser-Agent: eGroups-EW/0.82\r\nMIME-Version: 1.0\r\nContent-Type: text/plain; charset=ISO-8859-1\r\nContent-Length: 8348\r\nX-Mailer: Yahoo Groups Message Poster\r\nX-eGroups-Remote-IP: 66.218.66.82\r\nFrom: &quot;Kenneth Stanley&quot; &lt;kstanley@...&gt;\r\nSubject: Re: A sense of perspective (long post great read - slightly off topic)\r\nX-Yahoo-Group-Post: member; u=54567749\r\nX-Yahoo-Profile: kenstanley01\r\n\r\nBrendon,\n\nThanks for the article, I appreciate the point.  Humanlike \nintelligence is still far far away.  Still, if any path is on the \nright track I think it&#39;s this one, although we&#39;re just at the \nbeginning.\n\n(By the way, this discussion group was actually founded by Derek \nJames, which is probably not very well known.  I actually just had \ndinner with Derek here in Seattle at the GECCO Conference!)\n\nken\n\n--- In neat@yahoogroups.com, &quot;switchman34&quot; &lt;switchman34@y...&gt; wrote:\n&gt; Just a quick word of thanks to all the exceptionally \nknowledegeable \n&gt; posters on this forum, and of course to Ken for starting the group.\n&gt; \n&gt; I&#39;ve been following NEAT for a while now and have learned greatly \n&gt; from its approach ,and my programming skills have improved even \nmore \n&gt; as I tinker and play with various code constructs.\n&gt; \n&gt; I thought I would share an article, I found while browsing the \nother \n&gt; day. While I&#39;m sure we all have a sense of perspective about what \nwe \n&gt; are studying, and the outcomes we seek, this just served to give \nme a \n&gt; wake up call.  :-)\n&gt; \n&gt; &lt;wry smile&gt;\n&gt; \n&gt; I&#39;ve been guilty of thinking&quot; oh yes well thats the basics of a \n&gt; visual processing unit, now all we have to so is scale it up, \nthrow \n&gt; in a few more processing cycles and some development time and \n*voila* \n&gt; a fully fledged Visual system&quot;\n&gt; \n&gt; Anyway here&#39;s the article - it made me smile and ponder the \namazing \n&gt; biological construct that is the human being.\n&gt; \n&gt; I do hope you enjoy it! and my apologies if your feel this is too \noff \n&gt; topic\n&gt; \n&gt; Brendon!\n&gt; -----------------------------------\n&gt; IT IS A SATURDAY IN MARCH. The man wakes up slowly, reaches over \nand \n&gt; feels the windowpane, and decides it is warm enough to skip his \n&gt; thermal underwear. He yawns and dresses and goes out for his \nmorning \n&gt; jog. When he comes back, he showers, cooks himself a scrambled \negg, \n&gt; and settles down on the sofa with The Essays of E. B. White. \nAround \n&gt; noon, he rides his bike to the bookstore. He spends a couple of \nhours \n&gt; there, just poking around the books. Then he pedals back through \nthe \n&gt; little town, past his house, and to the lake. \n&gt; \n&gt; When the woman woke up this morning, she got out of bed and went \n&gt; immediately to her easel, where she picked up her pastels and set \nto \n&gt; work on her painting. After an hour, she is satisfied with the \nlight \n&gt; effect and quits to have breakfast. She dresses quickly and walks \nto \n&gt; a nearby store to buy shutters for her bathroom. At the store, she \n&gt; meets friends and has lunch with them. Afterward, she wants to be \n&gt; alone and drives to the lake. \n&gt; \n&gt; Now, the man and the woman stand on the wooden dock, gazing at the \n&gt; lake and the waves on the water. They haven&#39;t noticed each other. \n&gt; \n&gt; The man turns. And so begins the sequence of events informing him \nof \n&gt; her. Light reflected from her body instantly enters the pupils of \nhis \n&gt; eyes, at the rate of ten trillion particles of light per second. \nOnce \n&gt; through the pupil of each eye, the light travels through an oval-\n&gt; shaped lens, then through a transparent, jellylike substance \nfilling \n&gt; up the eyeball, and lands on the retina. Here it is gathered by \none \n&gt; hundred million rod and cone cells. \n&gt; \n&gt; Cells in the path of the reflected highlights receive a great deal \nof \n&gt; light; cells falling in the shadows of the reflected scene receive \n&gt; very little. The woman&#39;s lips, for example, are just now \nglistening \n&gt; in the sunlight, reflecting light of high intensity onto a tiny \npatch \n&gt; of cells slightly northeast of back center of the man&#39;s retina. \nThe \n&gt; edges around her mouth, on the other hand, are rather dark, so \nthat \n&gt; cells neighboring the northeast path receive much less light. \n&gt; \n&gt; Each particle of light ends its journey in the eye upon meeting a \n&gt; retinene molecule, consisting of 20 carbon atoms, 28 hydrogen \natoms, \n&gt; and 1 oxygen atom. In its dormant condition, each retinene \nmolecule \n&gt; is attached to a protein molecule and has a twist between the \n&gt; eleventh and fifteenth carbon atoms. But when light strikes it, as \nis \n&gt; now happening in about 30,000 trillion retinene molecules every \n&gt; second, the molecule straightens out and separates from its \nprotein. \n&gt; After several intermediate steps, it wraps into a twist again, \n&gt; awaiting arrival of a new particle of light. Far less than a \n&gt; thousandth of a second has elapsed since the man saw the woman. \n&gt; \n&gt; Triggered by the dance of the retinene molecules, the nerve cells, \nor \n&gt; neurons, respond. First in the eye and then in the brain. One \nneuron, \n&gt; for instance, has just gone into action. Protein molecules on its \n&gt; surface suddenly change their shape, blocking the flow of \npositively \n&gt; charged sodium atoms from the surrounding body fluid. This change \nin \n&gt; flow of electrically charged atoms produces a change in voltage \nthat \n&gt; shudders through the cell. After a distance of a fraction of an \ninch, \n&gt; the electrical signal reaches the end of the neuron, altering the \n&gt; release of specific molecules, which migrate a distance of a \nhundred-\n&gt; thousandth of an inch until they reach the next neuron, passing \nalong \n&gt; the news. \n&gt; \n&gt; The woman, in fact, holds her hands by her sides and tilts her \nhead \n&gt; at an angle of five and a half degrees. Her hair falls just to her \n&gt; shoulders. This information and much, much more is exactingly \nencoded \n&gt; by the electrical pulses in the various neurons of the man&#39;s eyes. \n&gt; \n&gt; In another few thousandths of a second, the electrical signals \nreach \n&gt; the ganglion neurons, which bunch together in the optic nerve at \nthe \n&gt; back of the eye and carry their data to the brain. Here, the \nimpulses \n&gt; race to the primary visual cortex, a highly folded layer of tissue \n&gt; about a tenth of an inch thick and two square inches in area, \n&gt; containing one hundred million neurons in half a dozen layers. The \n&gt; fourth layer receives the input first, does a preliminary \nanalysis, \n&gt; and transfers the information to neurons in other layers. At every \n&gt; stage, each neuron may receive signals from a thousand other \nneurons, \n&gt; combine the signals - some of which cancel each other out - and \n&gt; dispatch the computed result to a thousand-odd other neurons. \n&gt; \n&gt; After about thirty seconds - after several hundred trillion \nparticles \n&gt; of reflected light have entered the man&#39;s eyes and been processed -\n \n&gt; the woman says hello. Immediately, molecules of air are pushed \n&gt; together, then apart, then together, beginning in her vocal cords \nand \n&gt; traveling in a spring like motion to the man&#39;s ears. The sound \nmakes \n&gt; the trip from her to him (twenty feet) in a fiftieth of a second. \n&gt; \n&gt; Within each of his ears, the vibrating air quickly covers the \n&gt; distance to the eardrum. The eardrum, an oval membrane about .3 \ninch \n&gt; in diameter and tilted fifty-five degrees from the floor of the \n&gt; auditory canal, itself begins trembling and transmits its motion \nto \n&gt; three tiny bones. From there, the vibrations shake the fluid in \nthe \n&gt; cochlea, which spirals snail-like two and a half turns around. \n&gt; \n&gt; Inside the cochlea the tones are deciphered. Here, a very thin \n&gt; membrane undulates in step with the sloshing fluid, and through \nthis \n&gt; basilar membrane run tiny filaments of varying thickness, like \n&gt; strings on a harp. The woman&#39;s voice, from afar, is playing this \n&gt; harp. Her hello begins in a low registers and rises in pitch \ntoward \n&gt; the end. In precise response, the thick filaments in the basilar \n&gt; membrane vibrate first, followed by the thinner ones. Finally, \ntens \n&gt; of thousands of rod-shaped bodies perched on the basilar membrane \n&gt; convey their particular quiverings to the auditory nerve. \n&gt; \n&gt; News of the woman&#39;s hello, in electrical form, races along the \n&gt; neurons of the auditory nerve and enters the man&#39;s brain, through \nthe \n&gt; thalamus, to a specialized region of the cerebral cortex for \nfurther \n&gt; processing. Eventually, a large fraction of the trillion neurons \nin \n&gt; the man&#39;s brain become involved with computing the visual and \n&gt; auditory data just acquired. Sodium and potassium gates open and \n&gt; close. Electrical currents speed along neuron fibers. Molecules \nflow \n&gt; from one nerve ending to the next. \n&gt; \n&gt; All of this is known. What is not known is why, after about a \nminute, \n&gt; the man walks over to the woman and smiles.\n\n\n"}}