{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[{"name":"READ"}]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"userId":127853030,"authorName":"Colin Green","from":"Colin Green &lt;cgreen@...&gt;","profile":"alienseedpod","replyTo":"LIST","senderId":"iugcmo4PxUd_o8vyXhUW_4JHIsmcH6bOiSQlS7frQ_FckmjW34iuQzfvWdkp37vhj6vOobAVcmjdrPhm7_E3mwOPL-MxAiqbGA","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [neat] IEX update","postDate":"1089413881","msgId":1206,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDQwRUYyMkY5LjMwMTAwMDBAZHNsLnBpcGV4LmNvbT4=","inReplyToHeader":"PDE5YjEwZDUxMDQwNzA5MTUwMTU2NGQxM2Y3QG1haWwuZ21haWwuY29tPg==","referencesHeader":"PEJBWTItRjIxMkNUcDJoRk9XZDgwMDAzOGZmMUBob3RtYWlsLmNvbT4gPDQwRUYwOTUxLjMwNjA1QGRzbC5waXBleC5jb20+IDwxOWIxMGQ1MTA0MDcwOTE1MDE1NjRkMTNmN0BtYWlsLmdtYWlsLmNvbT4="},"prevInTopic":1205,"nextInTopic":1307,"prevInTime":1205,"nextInTime":1207,"topicId":1176,"numMessagesInTopic":38,"msgSnippet":"... Yeh it depends on how the experiments are progressing. If there is a steady increase in fitness then old species will tend to die out naturally as the new","rawEmail":"Return-Path: &lt;cgreen@...&gt;\r\nX-Sender: cgreen@...\r\nX-Apparently-To: neat@yahoogroups.com\r\nReceived: (qmail 55416 invoked from network); 9 Jul 2004 22:58:01 -0000\r\nReceived: from unknown (66.218.66.216)\n  by m20.grp.scd.yahoo.com with QMQP; 9 Jul 2004 22:58:01 -0000\r\nReceived: from unknown (HELO colossus.systems.pipex.net) (62.241.160.73)\n  by mta1.grp.scd.yahoo.com with SMTP; 9 Jul 2004 22:58:01 -0000\r\nReceived: from [10.0.0.10] (81-86-175-101.dsl.pipex.com [81.86.175.101])\n\tby colossus.systems.pipex.net (Postfix) with ESMTP id 5776E1C00104\n\tfor &lt;neat@yahoogroups.com&gt;; Fri,  9 Jul 2004 23:57:59 +0100 (BST)\r\nMessage-ID: &lt;40EF22F9.3010000@...&gt;\r\nDate: Fri, 09 Jul 2004 23:58:01 +0100\r\nUser-Agent: Mozilla Thunderbird 0.7.1 (Windows/20040626)\r\nX-Accept-Language: en-us, en\r\nMIME-Version: 1.0\r\nTo: neat@yahoogroups.com\r\nReferences: &lt;BAY2-F212CTp2hFOWd800038ff1@...&gt; &lt;40EF0951.30605@...&gt; &lt;19b10d510407091501564d13f7@...&gt;\r\nIn-Reply-To: &lt;19b10d510407091501564d13f7@...&gt;\r\nContent-Type: text/plain; charset=US-ASCII; format=flowed\r\nContent-Transfer-Encoding: 7bit\r\nX-eGroups-Remote-IP: 62.241.160.73\r\nFrom: Colin Green &lt;cgreen@...&gt;\r\nSubject: Re: [neat] IEX update\r\nX-Yahoo-Group-Post: member; u=127853030\r\nX-Yahoo-Profile: alienseedpod\r\n\r\nDerek James wrote:\n\n&gt;On Fri, 09 Jul 2004 22:08:33 +0100, Colin Green &lt;cgreen@...&gt; wrote:\n&gt;  \n&gt;\n&gt;&gt;Yeh, in my experience this is an often encountered problem. I&#39;ve\n&gt;&gt;tinkered with solutions similar to your&#39;s of averaraging past fitness\n&gt;&gt;scores, and although I&#39;ve never been entirely happy with it I think it&#39;s\n&gt;&gt;the best way of solving the problem if no appropriate deterministic\n&gt;&gt;evaluation is available.\n&gt;&gt;    \n&gt;&gt;\n&gt;\n&gt;Well, one thing to do is not even handle the stagnant species issue.\n&gt;:)  We have yet to implement this aspect of NEAT.  After reading on\n&gt;this list that it has helped with performance gains, we went back and\n&gt;looked at our evolving populations, to see what was going on with\n&gt;species.  We were afraid that perhaps stagnant species were\n&gt;overstaying their welcome and that we weren&#39;t getting good turnover in\n&gt;the population.\n&gt;\n&gt;But that turned out to not be the case.  We seem to have plenty of\n&gt;dynamism in our populations...that is, new species arising and old\n&gt;ones going extinct.  We also don&#39;t clamp the number of species, so we\n&gt;often have 20-30 species in an evolving population.\n&gt;  \n&gt;\nYeh it depends on how the experiments are progressing. If there is a \nsteady increase in fitness then old species will tend to die out \nnaturally as the new species become fitter and take up more space. If \nhowever the search gets stuck then you might be able to give it a \nkick-start by eliminating some old species and making space for some of \nthe newer ones. I guess we&#39;re covering old ground here slightly, but \npersonally I have a tendency to forget this stuff if it&#39;s not written \ndown or mentioned occasionally.\n\n&gt;&gt;Actually I&#39;ve been quietly working on Tic-Tac-Toe, following in Derek\n&gt;&gt;and Philips footsteps, \n&gt;&gt;    \n&gt;&gt;\n&gt;\n&gt;Will you be posting ongoing results somewhere...at least here? :)\n&gt;  \n&gt;\nYup, I&#39;m starting to get somewhere now so I should be able to write up \nsome results soon. Basically I am re-using the strategies from your \nexperiments, although the player code is mostly re-written/re-organised \nit still represents the same strategies, but with some extra randomness. \nSo e.g. where you had, say, a strategy that tests for an open corner and \nplays it, I basically pick randomly from the available open corners, \nrather than always testing them in order and playing the first that is \navailable. I think you did this in some places and not others, so I \nchanged the code to always play randomly if possible/appropriate.\n\nSo I have all of your strategies ported - Best, Forkable, Center, Random \nand Bad. One evaluation plays each strategy with half the games playing \nfirst go. I wasn&#39;t playing as many games as you so I&#39;ve just increased \nthis. Another idea I got from reading an article on the internet was to \npunish for a loss instead of allocating 0. So now I allocate a score of \n-10 for a loss, if the total fitness comes out negative then I just \nreturn 0. I think this might help things along a bit more - time will tell.\n\n&gt;&gt;So I thought maybe I should introduce an element of randomness, but then\n&gt;&gt;I encounter the problem of some NN&#39;s getting an unrepresenitive score\n&gt;&gt;through good or bad luck. Another ay of minimising this problem is to\n&gt;&gt;play more games per evaluation, which has the same or similar effect as\n&gt;&gt;averaging scores from previous evals.\n&gt;&gt;    \n&gt;&gt;\n&gt;\n&gt;Well, because the board is so small and games are played so quickly,\n&gt;random and semi-random opponents are a pretty good idea.  In our LBP\n&gt;for GECCO, each generations our networks were playing 100 games each\n&gt;against 5 difference hand-coded players, all of which had some degree\n&gt;of random play.  So there was a fair amount of noise in the\n&gt;evaluation, but good, solid play bore out because there were so many\n&gt;games played for each evaluation.\n&gt;\nYeh good points. So I might just see some good players with my current \nsetup then, just by increasing the number of games per evaluation.\n\n&gt;  This type of approach obviously\n&gt;isn&#39;t going to work very well with much larger board game domains,\n&gt;though.\n&gt;  \n&gt;\nIndeed. Designing good strategies to evolve against is definitely a big \npart of the battle. Even if you have a perfect strategy like your BEST, \nyou cannot assume that the resulting NNs will also exhibit the same \nability to at least force a draw and also win against poor players. In \nfact if you just evolved againt BEST then the NNs won&#39;t know anything \nabout winning, they will have evolved to always force a draw against a \ngood player.\n\n&gt;Although I think *some* degree of randomness needs to be introduced in\n&gt;opponent play, no matter what approach you&#39;re taking, or you&#39;re\n&gt;probably going to be evolving extremely brittle strategies.\n&gt;  \n&gt;\nYes. One unexpected (and potentially poor) move by an opponent could put \nyou NN into unknown territory and cause it to loose.\n\nBTW Derek, your LBP experiments were fairly short in duration, 200 gens \nas I recall. Did you do any longer runs to try and evolve a perfect \nTic-Tac-Toe player?\n\n\nColin.\n\n"}}