{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[{"name":"READ"}]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"userId":115403844,"authorName":"John Arrowwood","from":"&quot;John Arrowwood&quot; &lt;jarrowwx@...&gt;","profile":"jarrowwx","replyTo":"LIST","senderId":"N7atgKbMYpjksRyqP0ObgUDcNDFDE48YWtMcDdksknub_UhGRlo2xEj3siPFZcJ9Ewr2yUcgi6P-2rg32v5u02vOHXJBWN3R2lAcE4ic","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [neat] Stephen Thaler","postDate":"1091113186","msgId":1282,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEJBWTItRjI1dzFnZG1IRFRyaVkwMDAzOGJmN0Bob3RtYWlsLmNvbT4="},"prevInTopic":1281,"nextInTopic":1286,"prevInTime":1281,"nextInTime":1283,"topicId":1257,"numMessagesInTopic":9,"msgSnippet":"... As I mentioned in another post:  The irritation he mentions is another way of saying that he tweaks the shape of the solution space by changing the ","rawEmail":"Return-Path: &lt;jarrowwx@...&gt;\r\nX-Sender: jarrowwx@...\r\nX-Apparently-To: neat@yahoogroups.com\r\nReceived: (qmail 48487 invoked from network); 29 Jul 2004 15:00:13 -0000\r\nReceived: from unknown (66.218.66.216)\n  by m24.grp.scd.yahoo.com with QMQP; 29 Jul 2004 15:00:13 -0000\r\nReceived: from unknown (HELO hotmail.com) (65.54.247.25)\n  by mta1.grp.scd.yahoo.com with SMTP; 29 Jul 2004 15:00:13 -0000\r\nReceived: from mail pickup service by hotmail.com with Microsoft SMTPSVC;\n\t Thu, 29 Jul 2004 07:59:46 -0700\r\nReceived: from 64.122.44.102 by by2fd.bay2.hotmail.msn.com with HTTP;\n\tThu, 29 Jul 2004 14:59:46 GMT\r\nX-Originating-Email: [jarrowwx@...]\r\nX-Sender: jarrowwx@...\r\nTo: neat@yahoogroups.com\r\nBcc: \r\nDate: Thu, 29 Jul 2004 07:59:46 -0700\r\nMime-Version: 1.0\r\nContent-Type: text/plain; format=flowed\r\nMessage-ID: &lt;BAY2-F25w1gdmHDTriY00038bf7@...&gt;\r\nX-OriginalArrivalTime: 29 Jul 2004 14:59:46.0878 (UTC) FILETIME=[B06155E0:01C4757C]\r\nX-eGroups-Remote-IP: 65.54.247.25\r\nFrom: &quot;John Arrowwood&quot; &lt;jarrowwx@...&gt;\r\nReply-To: john@...\r\nSubject: Re: [neat] Stephen Thaler\r\nX-Yahoo-Group-Post: member; u=115403844\r\nX-Yahoo-Profile: jarrowwx\r\n\r\n&gt;From: Derek James &lt;djames@...&gt;\n\n&gt;&quot;Creativity Machines represent a new kind of neural network paradigm\n&gt;that is capable of generating, rather than just associating, patterns.\n&gt;They are based upon what we believe to be a significant scientific\n&gt;discovery, that a neural network exposed to any conceptual space and\n&gt;then internally irritated, in a specially prescribed way, tends to\n&gt;generate coherent ideas derived from its absorbed wisdom.&quot;\n&gt;\n&gt;It tends to generate coherent ideas derived from its absorbed wisdom?  Huh?\n\nAs I mentioned in another post:  The &#39;irritation&#39; he mentions is another way \nof saying that he tweaks the shape of the solution space by changing the \nweights.  Picture the solution space of XOR.  It&#39;s a diagonal valley, right? \n  Now picture a more complicated domain.  The solution looks more like a \nlandscape with peaks and troughs and ridges and all that stuff.  Now, if you \nonly make minor changes to a small portion of the weights, the result will \nbe largely the same shape.  But it will be slightly different, too.  Some \npeaks might be higher, some valleys wider, and so forth.  When you ask that \nnetwork the same question, it will return a slightly different answer.  In a \nreal world problem domain, that answer may also be valid.  But it is \nDIFFERENT...  Because it is relevant, it is &#39;coherent&#39; as he says.  But \nbecause it is different, it is &#39;generated&#39; as he says.  So what he said is \ncorrect.\n\n&gt;Some of the passages on the site are simply laughable:\n&gt;\n&gt;&quot; In a nutshell, this advantage derives from the close similarity of\n&gt;an all neural construction that emulates the brain (i.e., the seat of\n&gt;intelligence)..&quot;\n&gt;\n&gt;Gee, thanks for the heads up.  I thought the kidney was the seat of\n&gt;intelligence.\n\nRemember the target audience.  Investors, not geeks. :)\n\n&gt;Looking for unbiased information wasn&#39;t very fruitful.  I came across\n&gt;this Mercury News article, which contained passages like this one:\n&gt;\n&gt;&quot;In biological brains, the information-carrying cells, called neurons,\n&gt;meet at junctions, called synapses. Brain chemicals, such as\n&gt;adrenaline and dopamine, flow across the junctions to stimulate or\n&gt;soothe the cells. In the computer world, there are switches instead of\n&gt;cells. The switches are connected by numbers, or ``weights.&#39;&#39;\n&gt;\n&gt;So after work, Thaler went home and created the epitome of a killer\n&gt;application -- a computer program he called the Grim Reaper.\n&gt;\n&gt;The reaper dismantles neural networks by changing its connection\n&gt;weights. It is the biological equivalent of killing neurons. Pick off\n&gt;enough neurons, and the result is death.\n&gt;\n&gt;On Christmas Eve 1989, Thaler typed the lyrics to some of his favorite\n&gt;Christmas carols into a neural network.&quot;\n&gt;\n&gt;How do you &quot;type&quot; the lyrics of a song into a neural network?\n\nHow do you teach a neural network to process text in the first place?  By \nwhatever means you would do that, that&#39;s probably what he did here...\n\n&gt;\n&gt;&quot;Once he&#39;d taught the network the songs, he unleashed the Grim Reaper.\n&gt;As the reaper slashed away connections, the network&#39;s digital life\n&gt;began to flash before its eyes. The program randomly spit out\n&gt;perfectly remembered carols as the killer application severed the\n&gt;first connections. But as its wounds grew deeper, and the network\n&gt;faded toward black, it began to hallucinate.\n&gt;\n&gt;The network wove its remaining strands of memory together, producing\n&gt;what someone else might interpret as damaged memories, but what Thaler\n&gt;recognized as new ideas. In its death spiral, the program dreamed up\n&gt;new carols, each created from shards of its shattered memories.&quot;\n&gt;\n&gt;Um...okay.  I&#39;d be a lot more willing to approach Thaler&#39;s ideas if it\n&gt;were presented in a fairly straightforward manner, without all the\n&gt;hyperbolic window dressing.\n\nProblem is, if he were to write scientifically oriented papers for the likes \nof us, he&#39;d be giving away his secret.  Can&#39;t get funding doing something \nlike that... :)\n\nBut while I haven&#39;t (yet) duplicated his work, I think I have a pretty good \ngrasp of why it does what it does.  The example I gave above of the graph of \nthe output does a decent job of explaining the creativity machine.\n\n-- John\n\n&gt;\n&gt;Derek\n&gt;\n&gt;\n&gt;\n&gt;\n&gt;Yahoo! Groups Links\n&gt;\n&gt;\n&gt;\n&gt;\n&gt;\n\n\n\n"}}