{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[{"name":"READ"}]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"userId":127853030,"authorName":"Colin Green","from":"Colin Green &lt;cgreen@...&gt;","profile":"alienseedpod","replyTo":"LIST","senderId":"Td_HeHcavM6ocoILj4jxqFEDEAJaQYq5hAMdQPE0kKZyfVRrPRv-7-KKGWifvVoUtAvmdB21IF6kbbAr7alr59A9xwtGw634Mg","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [neat] Re: ANN: SharpNEAT Release (15-August-2004) + Phased searching experiment write-","postDate":"1092949544","msgId":1427,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDQxMjUxNjI4LjQwNzA1MDhAZHNsLnBpcGV4LmNvbT4=","inReplyToHeader":"PGNnMnM3Zis2cjczQGVHcm91cHMuY29tPg==","referencesHeader":"PGNnMnM3Zis2cjczQGVHcm91cHMuY29tPg=="},"prevInTopic":1420,"nextInTopic":1429,"prevInTime":1426,"nextInTime":1428,"topicId":1151,"numMessagesInTopic":34,"msgSnippet":"... Yes the parameters are all correct and I agree that it seems counter intuitive. Actually I think you answered this question yourself in your response to","rawEmail":"Return-Path: &lt;cgreen@...&gt;\r\nX-Sender: cgreen@...\r\nX-Apparently-To: neat@yahoogroups.com\r\nReceived: (qmail 30220 invoked from network); 19 Aug 2004 21:05:47 -0000\r\nReceived: from unknown (66.218.66.216)\n  by m21.grp.scd.yahoo.com with QMQP; 19 Aug 2004 21:05:47 -0000\r\nReceived: from unknown (HELO pengo.systems.pipex.net) (62.241.160.193)\n  by mta1.grp.scd.yahoo.com with SMTP; 19 Aug 2004 21:05:47 -0000\r\nReceived: from [10.0.0.10] (81-86-175-101.dsl.pipex.com [81.86.175.101])\n\tby pengo.systems.pipex.net (Postfix) with ESMTP id 08DF34C001BB\n\tfor &lt;neat@yahoogroups.com&gt;; Thu, 19 Aug 2004 22:05:43 +0100 (BST)\r\nMessage-ID: &lt;41251628.4070508@...&gt;\r\nDate: Thu, 19 Aug 2004 22:05:44 +0100\r\nUser-Agent: Mozilla Thunderbird 0.7.1 (Windows/20040626)\r\nX-Accept-Language: en-us, en\r\nMIME-Version: 1.0\r\nTo: neat@yahoogroups.com\r\nReferences: &lt;cg2s7f+6r73@...&gt;\r\nIn-Reply-To: &lt;cg2s7f+6r73@...&gt;\r\nContent-Type: text/plain; charset=ISO-8859-1; format=flowed\r\nContent-Transfer-Encoding: 7bit\r\nX-eGroups-Remote-IP: 62.241.160.193\r\nFrom: Colin Green &lt;cgreen@...&gt;\r\nSubject: Re: [neat] Re: ANN: SharpNEAT Release (15-August-2004) + Phased searching\n experiment write-\r\nX-Yahoo-Group-Post: member; u=127853030\r\nX-Yahoo-Profile: alienseedpod\r\n\r\nDerek James wrote:\n\n&gt;--- In neat@yahoogroups.com, Colin Green &lt;cgreen@d...&gt; wrote:\n&gt;  \n&gt;\n&gt;&gt;The write-up for my phased searching experiments (including some nice \n&gt;&gt;graphs) can be found at:\n&gt;&gt;\n&gt;&gt;http://www.cgreen.dsl.pipex.com/phasedsearch.htm\n&gt;&gt;    \n&gt;&gt;\n&gt;\n&gt;Hey Colin,\n&gt;\n&gt;I&#39;ve just now gotten around to reading this write-up thoroughly, and I\n&gt;thought I&#39;d comment.\n&gt;\n&gt;In the section describing Blended Searching you say:\n&gt;\n&gt;&quot;Subtractive mutations help keep the complexity of a population down,\n&gt;however, in a blended search experiment described later the downward\n&gt;pressure on complexity exerted by subtractive mutations was found to\n&gt;be very light.&quot;\n&gt;\n&gt;This is strange.  Your mutation rates were:\n&gt;\n&gt;add neuron: 0.001\n&gt;add connection: 0.01\n&gt;remove neuron: 0.003\n&gt;remove connection: 0.03\n&gt;\n&gt;Is this correct?  Your remove topology mutation rates were triple your\n&gt;additive ones?  Are you sure everything is working correctly?  If so,\n&gt;how do you account for the fact that your blended run complexity\n&gt;increased at nearly the same rate as the complexifying runs?  This\n&gt;doesn&#39;t seem right.\n&gt;  \n&gt;\nYes the parameters are all correct and I agree that it seems counter \nintuitive. Actually I think you answered this question yourself in your \nresponse to John -  crossover. The crossover rate was set to 0.5, so \nstructures are continuously propagating through the population. \nSubtractive mutations are only on individual [offspring] genomes, so \nthere is a very high probability that the deleted gene will exist in \nnumerous other genomes in the population and will persist despite \nsubtractive mutations occuring. In fact the propagation of genes through \ncrossover is so numerous that the subtractive mutations have hardly any \neffect at all - as demonstrated in the graphs.\n\nAs a side note I was just reading a short article in this month&#39;s \nScientific American that briefly discusses the possibility that \ncrossover, despite being being good at trying out combinations of genes, \nactually acts as an error correcting technique - that is, if one of the \nparents has a mutated gene that is poor, the other parent is likely to \nhave a good copy, and therefore some of the offspring will have a \ncomplete set of good genes despite having a parent with a mutation. \nWell, it&#39;s sort of relevant :)\n\n&gt;Also, it seems very strange to me that the fitness of the evolving\n&gt;populations in both complexifying and blended NEAT *decrease* over the\n&gt;run.  You speculate that this has to do with speciation culling, I\n&gt;believe, but there is either something very wrong with the algorithm\n&gt;as implemented or something extremely peculiar about your domain if\n&gt;NEAT is evolving progressively *worse* individuals.\n&gt;  \n&gt;\nI truly beleive that this is down to species culling, and the phased \nsearch graph backs up the idea. SharpNEAT employs elitism at the species \nlevel, that is, each species&#39; keeps at least it&#39;s 1 best genome and in \nthe experiments actually kept the best 20%,. Note that if 20% works out \nat less than one then at least one is kept. This means that the only way \nthat the best genome&#39;s fitness can fall is either by killing off a \nspecies or because of a bug in the code. Having done a lot of testing \nand experimentation recently I&#39;m fairly confident that this isn&#39;t down \nto a bug.\n\nI think it makes sense. If a species is good but has not improved for a \nnumber of generations (200 in the experiments) then it is culled. Now, \nwhen an experiment reaches a fitness plateau this is precisely what \nhappens with each good species in turn. They are then replaced with less \nfit species and how fit those species are can vary. e.g. in the OCR \nexperiment the populaiton size was quite small (150), so that as the \ngeomes become more complex, the dynamic speciation threshold must \nincrease in order to keep the number of species at a given level. This \nmeans that genome that were previously in different species will now be \nin the same species. Now consider that all of the fit species where \nprobably spawned from each other and are therefore probably quite \nsimilar, as we now increase the speciation threshold, they slowly merge \nback into a single species, leaving the rest of the populatin to be made \nup of poor species... these are what gets left behind when species are \nculled.\n\nProbably all of that needs explaining in more detail and needs more \nexperimentation to back it up, but I do feel that this is what&#39;s really \nhappening. And the theory is partly backed up by the fact that the \nphased search had a population of far less complex genomes and didn&#39;t \nsuffer from a drop in fitness.\n\nHave a look back in the archives, I think species culling was discussed \nsome time ago when I poitned out that quite often a jump in fitness can \nbe seen shortly after culling the fittest species. This is because the \nspecies, although good, is actually stuck in a local optimum, by killing \nit we give the other species a better chance at finding a solution.\n\nColin.\n\n\n\n\n"}}