{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[{"name":"READ"}]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"userId":7192225,"authorName":"Ian Badcoe","from":"Ian Badcoe &lt;ian_badcoe@...&gt;","profile":"ian_badcoe","replyTo":"LIST","senderId":"LYlNyyT6deKyTCPk9Q1ZRcoiZ646hkHBbtxGOkfQzRdubZPxJHMs8-OIe_KORX6s94yKkHqrIRsf46nY-wTbWPwZTV7lWdZgE4g","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [neat] Re: &quot;failed&quot; digital output experiment","postDate":"1093520120","msgId":1469,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDYuMS4yLjAuMC4yMDA0MDgyNDE3MzUyOS4wMjU3NjdjOEBwb3AubWFpbC55YWhvby5jby51az4=","inReplyToHeader":"PGNnNW0wZCtwN2I4QGVHcm91cHMuY29tPg==","referencesHeader":"PGNnMzhjdStrYmE2QGVHcm91cHMuY29tPiA8Y2c1bTBkK3A3YjhAZUdyb3Vwcy5jb20+"},"prevInTopic":1459,"nextInTopic":1472,"prevInTime":1468,"nextInTime":1470,"topicId":1418,"numMessagesInTopic":15,"msgSnippet":"... I d think that it was just as likely (a local optimum, that is) in any problem.  But that only for relatively simple problems do we have any chance of","rawEmail":"Return-Path: &lt;ian_badcoe@...&gt;\r\nX-Sender: ian_badcoe@...\r\nX-Apparently-To: neat@yahoogroups.com\r\nReceived: (qmail 14959 invoked from network); 26 Aug 2004 11:35:31 -0000\r\nReceived: from unknown (66.218.66.172)\n  by m4.grp.scd.yahoo.com with QMQP; 26 Aug 2004 11:35:31 -0000\r\nReceived: from unknown (HELO smtp003.mail.ukl.yahoo.com) (217.12.11.34)\n  by mta4.grp.scd.yahoo.com with SMTP; 26 Aug 2004 11:35:31 -0000\r\nReceived: from unknown (HELO ian2k.yahoo.co.uk) (ian?badcoe@212.159.73.108 with login)\n  by smtp003.mail.ukl.yahoo.com with SMTP; 26 Aug 2004 11:35:30 -0000\r\nMessage-Id: &lt;6.1.2.0.0.20040824173529.025767c8@...&gt;\r\nX-Sender: ian_badcoe@...\r\nX-Mailer: QUALCOMM Windows Eudora Version 6.1.2.0\r\nDate: Thu, 26 Aug 2004 12:35:20 +0100\r\nTo: neat@yahoogroups.com\r\nIn-Reply-To: &lt;cg5m0d+p7b8@...&gt;\r\nReferences: &lt;cg38cu+kba6@...&gt;\n &lt;cg5m0d+p7b8@...&gt;\r\nMime-Version: 1.0\r\nContent-Type: text/plain; charset=&quot;us-ascii&quot;; format=flowed\r\nX-eGroups-Remote-IP: 217.12.11.34\r\nFrom: Ian Badcoe &lt;ian_badcoe@...&gt;\r\nSubject: Re: [neat] Re: &quot;failed&quot; digital output experiment\r\nX-Yahoo-Group-Post: member; u=7192225\r\nX-Yahoo-Profile: ian_badcoe\r\n\r\nAt 21:13 20/08/2004, you wrote:\n&gt;Karl,\n&gt;\n&gt;I wanted to follow on a bit on what Colin said.  I agree Colin&#39;s\n&gt;method might help but I want to just point out what might be going\n&gt;on.  You seem to have run into a classic local optimum.  It&#39;s\n&gt;probably a situation where it&#39;s very easy to get some of the\n&gt;classifications right using some rough heuristic which is found\n&gt;early on, but then to get any of the other classifications right\n&gt;requires *sacrificing* the naive function that was found first,\n&gt;which is almost never going to happen since it means dropping in\n&gt;fitness for a while.  The presence of species should help with this\n&gt;problem but the basin around the initial poor solution may be so\n&gt;large that it&#39;s virtually inevitable to get pulled in.\n&gt;\n&gt;This kind of thing seems to happen more in classification problems\n&gt;than control problems (just based on my observations, not\n&gt;experimental backup).\n\nI&#39;d think that it was just as likely (a local optimum, that is) in any \nproblem.  But that only for relatively simple problems do we have any \nchance of visualizing it well-enough to be able to confirm what&#39;s going on.\n\nFor example, suppose you were evolving networks which play a game.  Then \nyou might well see similar progress, improving so far, stalling for a \nwhile, improving some more, stalling again...  Which I would interpret as \npassage through a series of local minima.  However, when the system comes \nto rest, you might find you have a population of controllers which all \nemploy the same large-scale strategy.  E.g. maybe they are all \ndefensive.  From an ESS (Evolutionary Stable Strategy) point of view this \npopulation is unstable w.r.t invasion by other strategies (e.g. ones which \nexploit the weaknesses in defensive play) but because the population has \ngot stuck in the &quot;defensive&quot; local optimum it cannot readily progress.\n\nThe &quot;defensive&quot; local minimum might, however, be a very wide optimum.  e.g. \nall the landscape for miles may slope upwards towards this mountain, and \nthere may be a large grouping of sub-peaks within the &quot;defensive&quot; mountain \nrange (representing different but related strategies).  Other (possibly \nhigher) peaks do exist on the landscape, but they are a long way away.  You \ncan&#39;t get there from here.\n\nSo, to get to the point, in this case calling the defensive optimum &quot;local&quot; \ndoes not really do it justice.  It&#39;s more a &quot;regional&quot; optimum because \nanything better is a very (very, _very_) long way away.  And, if \n&quot;defensive&quot; were some less intuitive strategy, then user might well fail to \nrealize that there could be alternatives out there.  Thus he might deduce \nthat the run had arrived at the &quot;global&quot; optimum (dwelling temporarily in a \nfew &quot;local&quot; optima along the way).\n\n--\n\nThis question of the shape and size of fitness landscapes is one that has \nintrigued me for years.  I have a few intuitions about them which you might \nlike to argue with:\n\n1) They&#39;re big.  And for any really interesting question (like how to play \nchess) they&#39;re not big like the universe is big, they&#39;re _much_ larger than \nthat.\n\n2) Their shape is determined by the fitness function (obviously) but also, \n(less obvious) by the set of mutations used.  The set of mutations affects \nthe connectivity of the landscape.  Addition of a new mutation can pull \ndistant points into adjacency.\n\n3) Increased connectivity pulls points closer together and speeds evolution.\n\n4) Increased connectivity increases the size of &quot;neighborhood&quot; around each \npoint, and slows evolution.\n\n5) So there&#39;s a trade-off between 3 and 4, which is problem dependent and \nnobody knows how to estimate the best compromise.\n\n6) In any problem where the axes of the fitness landscape are not totally \ninterdependent (almost any problem) there will be local optima.\n\n7) for most complex problems, optima cluster together in groups.  I like to \ncall these meta-optima.  The reason for this is, if the problem is \nsubdividable (modularisable) then each sub-set of the problem can be solved \nin a variety of ways, each with a different (partial) fitness.  The \npresence of multiple solutions for each module has the effect of putting \nsub-peaks on the side of each principle optimum.\n\n         Anyway, enough back-of-napkin rambling.  Point 7, in particular, \nshows how simulated-annealing type approaches work...  Point 5, I feel has \na lot to say about the efficiency of various TWEANN and GP approaches, but \nnot enough to prompt concrete conclusions yet :-(.\n\n         Again this brings home to me that any evolving software technique \nreally needs functional, automatic modularity before it has any hope of \nbreaking into the BIG problems.  Modularity entails a trade off very like \n(5) in that the presence of modularity increases the size of the overall \nsearch space (adding choices about how to define modules) but hugely \ndecreases the size of the parts that are considered at one time (e.g. each \nmodules fitness landscape is much, much smaller than the overall fitness \nlandscape.).\n\n         Ian Badcoe\n\n\n\nLiving@Home - Open Source Evolving Organisms - \nhttp://livingathome.sourceforge.net/\n\n\n\n"}}