{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[{"name":"READ"}]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"userId":127853030,"authorName":"Colin Green","from":"Colin Green &lt;cgreen@...&gt;","profile":"alienseedpod","replyTo":"LIST","senderId":"SfHLeTDp4AgSMvJ_FD_zDALdcULtLpBjMsq2RK7snIGT3HW20ywCcuJMyTXwbHhkFM4BXDreinWwiASyJ-IbjCDarIsshvM-kg","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [neat] Re: Stock Market","postDate":"1095464497","msgId":1549,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDQxNEI3NjMxLjIwNjA3QGRzbC5waXBleC5jb20+","inReplyToHeader":"PDQxNEI2OTVFLjUwMDAxMDJAdmlyZ2luLm5ldD4=","referencesHeader":"PGNpZmd1aitwZ2RxQGVHcm91cHMuY29tPiA8NDE0QjYzM0EuODAzMDkwMkBkc2wucGlwZXguY29tPiA8NDE0QjY5NUUuNTAwMDEwMkB2aXJnaW4ubmV0Pg=="},"prevInTopic":1547,"nextInTopic":1595,"prevInTime":1548,"nextInTime":1550,"topicId":1541,"numMessagesInTopic":7,"msgSnippet":"... Yeh, en masse group dynamics take over and the stock movements [theoretically] take over. Emyr, I understand you re in the UK - I think there is a going to","rawEmail":"Return-Path: &lt;cgreen@...&gt;\r\nX-Sender: cgreen@...\r\nX-Apparently-To: neat@yahoogroups.com\r\nReceived: (qmail 23433 invoked from network); 17 Sep 2004 23:41:43 -0000\r\nReceived: from unknown (66.218.66.167)\n  by m19.grp.scd.yahoo.com with QMQP; 17 Sep 2004 23:41:43 -0000\r\nReceived: from unknown (HELO shockwave.systems.pipex.net) (62.241.160.9)\n  by mta6.grp.scd.yahoo.com with SMTP; 17 Sep 2004 23:41:43 -0000\r\nReceived: from [10.0.0.10] (81-86-175-101.dsl.pipex.com [81.86.175.101])\n\tby shockwave.systems.pipex.net (Postfix) with ESMTP id 6B14C1C000DF\n\tfor &lt;neat@yahoogroups.com&gt;; Sat, 18 Sep 2004 00:41:42 +0100 (BST)\r\nMessage-ID: &lt;414B7631.20607@...&gt;\r\nDate: Sat, 18 Sep 2004 00:41:37 +0100\r\nUser-Agent: Mozilla Thunderbird 0.7.1 (Windows/20040626)\r\nX-Accept-Language: en-us, en\r\nMIME-Version: 1.0\r\nTo: neat@yahoogroups.com\r\nReferences: &lt;cifguj+pgdq@...&gt; &lt;414B633A.8030902@...&gt; &lt;414B695E.5000102@...&gt;\r\nIn-Reply-To: &lt;414B695E.5000102@...&gt;\r\nContent-Type: text/plain; charset=ISO-8859-1; format=flowed\r\nContent-Transfer-Encoding: 7bit\r\nX-eGroups-Remote-IP: 62.241.160.9\r\nFrom: Colin Green &lt;cgreen@...&gt;\r\nSubject: Re: [neat] Re: Stock Market\r\nX-Yahoo-Group-Post: member; u=127853030\r\nX-Yahoo-Profile: alienseedpod\r\n\r\nej wrote:\n\n&gt;Colin Green wrote:\n&gt;  \n&gt;\n&gt;&gt;{Idea] Many stock price movements are unpredictable, but some of the\n&gt;&gt;movements may be predictable after effects of the unpredictable moves.\n&gt;&gt;Therefore the key in making money would be to be ability to determine\n&gt;&gt;when the predictable movements are occuring (or are about to occur) and\n&gt;&gt;to trade based on the prediction, and to ignore all other\n&gt;&gt;non-predictable movements. Therefore something akin to a confidence\n&gt;&gt;output would probably be a good thing, so instead of always trying to\n&gt;&gt;predict tomorrows price the network has the ability to admit that it\n&gt;&gt;doesn&#39;t &#39;understand&#39; the current conditions and therefore won&#39;t be\n&gt;&gt;making a prediction today.\n&gt;&gt;\n&gt;&gt;Colin.\n&gt;&gt;    \n&gt;&gt;\n&gt;\n&gt;\n&gt;This is EXACTLY what I&#39;m trying to do. Events which happen out of the \n&gt;blue like Septembet the 11th happen very infrequently.\n&gt;What&#39;s more likely to happen is an event will develop over a period of \n&gt;weeks, and the thing driving the price will be the sum total\n&gt;psychology of all the traders.\n&gt;  \n&gt;\nYeh, en masse group dynamics take over and the stock movements \n[theoretically] take over. Emyr, I understand you&#39;re in the UK - I think \nthere is a going to be an episode of Horizon about stock market \nprediction sometime this season, dunno when though, I spotted it in the \nBBC&#39;s current advert for the new season. New Scientist did an article a \nfew months back also, along the lines of  - the world economies could be \nstabilised if accurate prediction models could be built.\n\n&gt;I plan to &#39;show&#39; the last N days worth of stock data to the network and \n&gt;get it to return a number from\n&gt; -1 to +1 based on sell through to buy.\n&gt;\nI would say you need some leeway either way of the historical min/max to \nallow for new highs and lows. I also am a great believer in doing as \nmuch work with traditional techniques as possible, don&#39;t try to evolve \nbehaviour to do things you can do in other ways. e.g. I wouldn&#39;t try and \nobtaining a buy/sell signal, instead I might ask it to predict a price \nand a confidence value, I can then run this data through a simple bit of \nlogic to determine if I should buy or sell. I have therefore removed the \nnecessity to for the network to perform that last bit of functionality. \nThe less a network has to do, the more chance there is of finding a \nnetwork that actually works.\n\nSide node. An alternative to a confidence value would be a predicted \nvalue min and max. If the net is unsure it can return a wide range - I \nwonder, does this run counter to my above argument?\n\n&gt; Most of the time I would expect \n&gt;the network to return zero values, but once in a while where\n&gt;it thinks a stock has suddenly entered a predictable domain I would hope \n&gt;it would put it&#39;s hand up with a strong buy or sell signal. For\n&gt;1 stock this may happen once every few months, but by applying it to \n&gt;every stock in the FTSE 350 and S&P 1000 every night, I\n&gt;would hope to get a few good candidates a week which would definitely be \n&gt;enough to make a lot of money IF (and obviously it&#39;s a\n&gt;big IF) the network has learned to &#39;fill it&#39;s boots&#39; only when it thinks \n&gt;there&#39;s a very good opportunity available.\n&gt;  \n&gt;\nYes, I agree with the concept and I expect this is similar to the setup \ncurrently used by automated trading agents at large banks. No reason why \nwe shouldn&#39;t try it ourselves though eh.\n\n&gt;Choosing the fitness function to try to drive this sort of behaviour is \n&gt;obviously critical - I have a few ideas, I guess I will just have to try\n&gt;different things out and see what works well on historical time series. \n&gt;  \n&gt;\nMy guess is that the shape of price curves is going to be important. \nNow, if we apply each historical price in turn (serial) then the network \nmust build up an ongoing memory that it can then analyse at each time \nstep. This has the benefit of allowing longer and longer lengths of \nhistory to be applied easily. The downside is that a network must evolve \nstructures to store data before it can be analysed - which to my mind is \nmakign a difficult problem a lot harder.\n\nNow, you could just apply the past, say, 14 days prices to the input \nlayer. Bu twhat if some of the patterns in the price are over long \nperiods? we want to pick up on those as well right? And my intuition \ntells me that the serial approach won&#39;t be able to develop memories to \npick up on these long term patterns, at least not easily.\n\nI&#39;ll leave you with those thoughts for now :)\n\n&gt;I have no idea wether any of this will actually work. If it does, then \n&gt;I&#39;m in the money. If not, I will have learned a hell of a lot trying.\n&gt;  \n&gt;\nI think it would be healthy to not expect riches from this sort of \nthing, just be happy with having an engaging problem that you can learn \na lot from - and that /might/ throw something up just to keep your \ninterest level up :)\n\n&gt;I&#39;m currently impelementing my own C++ version of NEAT which is heavily \n&gt;based on Ken&#39;s C++ code, but removing all the redundant stuff like\n&gt;traits and recurrence which won&#39;t be needed for what I&#39;m trying to do.\n&gt;  \n&gt;\nWell I&#39;m a C# evangelist these days. I&#39;ve done a lot of work putting \nSharpNEAT together - this weekend I&#39;m going to be doing some fine tuning \nto eek out a bit more performance, although right now it&#39;s pretty tight \ncode anyway. If you haven&#39;t already checked it out and want to have a \nlook just type sharpneat into google.\n\n\nColin\n\n\n\n\n"}}