{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[{"name":"READ"}]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"userId":54567749,"authorName":"Kenneth Stanley","from":"&quot;Kenneth Stanley&quot; &lt;kstanley@...&gt;","profile":"kenstanley01","replyTo":"LIST","senderId":"qlSNuQ9JF_Tc4pohF0L2z9JgJZCk9rM_db-G1BbZcNYYmHhmhU3aw3VyIvnGVY0RYbEE0_Y7xqszojDlyR-gEi43vmN2W8dhQYwUAZ9I9_Ev","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: Phased Searching Writeup","postDate":"1095635079","msgId":1557,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGNpbDNhNyttaDJvQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDQxNEI2RDlELjgwNDA1MDdAZHNsLnBpcGV4LmNvbT4="},"prevInTopic":1548,"nextInTopic":0,"prevInTime":1556,"nextInTime":1558,"topicId":1507,"numMessagesInTopic":3,"msgSnippet":"... below... ... and ... are ... publication ... published? ... peer ... point for ... CV :) ... I agree with you here.  Especially if your work forms a useful","rawEmail":"Return-Path: &lt;kstanley@...&gt;\r\nX-Sender: kstanley@...\r\nX-Apparently-To: neat@yahoogroups.com\r\nReceived: (qmail 99256 invoked from network); 19 Sep 2004 23:04:51 -0000\r\nReceived: from unknown (66.218.66.218)\n  by m18.grp.scd.yahoo.com with QMQP; 19 Sep 2004 23:04:50 -0000\r\nReceived: from unknown (HELO n20.grp.scd.yahoo.com) (66.218.66.76)\n  by mta3.grp.scd.yahoo.com with SMTP; 19 Sep 2004 23:04:50 -0000\r\nReceived: from [66.218.67.146] by n20.grp.scd.yahoo.com with NNFMP; 19 Sep 2004 23:04:44 -0000\r\nDate: Sun, 19 Sep 2004 23:04:39 -0000\r\nTo: neat@yahoogroups.com\r\nMessage-ID: &lt;cil3a7+mh2o@...&gt;\r\nIn-Reply-To: &lt;414B6D9D.8040507@...&gt;\r\nUser-Agent: eGroups-EW/0.82\r\nMIME-Version: 1.0\r\nContent-Type: text/plain; charset=ISO-8859-1\r\nContent-Length: 6763\r\nX-Mailer: Yahoo Groups Message Poster\r\nX-Yahoo-Newman-Property: groups-compose\r\nX-eGroups-Remote-IP: 66.218.66.76\r\nFrom: &quot;Kenneth Stanley&quot; &lt;kstanley@...&gt;\r\nSubject: Re: Phased Searching Writeup\r\nX-Yahoo-Group-Post: member; u=54567749\r\nX-Yahoo-Profile: kenstanley01\r\n\r\n--- In neat@yahoogroups.com, Colin Green &lt;cgreen@d...&gt; wrote:\n&gt; Hi Ken,\n&gt; \n&gt; Thanks for  response on the phased search write-up. Responses \nbelow...\n&gt; \n&gt; Kenneth Stanley wrote:\n&gt; \n&gt; &gt;Here are some comments on your writeup.  I think it&#39;s great work \nand \n&gt; &gt;very helpful.  It seems from your preliminary results that phased \n&gt; &gt;search can significantly outperform complexification alone, so we \n&gt; &gt;might now be able to solve even harder problems.  For that reason \n&gt; &gt;alone, this is probably publication-worthy work, although there \nare \n&gt; &gt;a few things that should be addressed, or at least I&#39;m curious \nabout:\n&gt; &gt;  \n&gt; &gt;\n&gt; The first question here is,  if I were to make the write-up \npublication \n&gt; worthy what avenues are open with regards to getting work \npublished? \n&gt; Placing the work on the internet works well up to a point, but a \npeer \n&gt; reviewed paper has more credability and can be used as a base \npoint for \n&gt; further research by others, plus it is something to put in the ole \nCV :)\n&gt; \n\nI agree with you here.  Especially if your work forms a useful basis \nfor further research, which seems possible, it would be helpful to \nhave a publication to refer to when using phased searching.  \n\nI think the best option for something like this is a conference \npaper.  Probably GECCO-2005 would be the best, which has a \nsubmission deadline in January, I believe.  Usually brand new \nresearch shows up at a conference before it goes to a journal in \nexpanded form.  I think your work could get into GECCO, but you&#39;d \nhave to address the points below.\n\n&gt; &gt;-Why is the phased search so much faster?  It seems to be 5 or 10 \n&gt; &gt;times faster based on what you say, but that seems more dramatic \n&gt; &gt;than I would expect.  I guess it&#39;s because this task is all about \n&gt; &gt;network activation and has no &quot;domain simulation&quot; involved.  \n&gt; &gt;\n&gt; Yeh, because the evaluation code is so simple and fast, something \nlike \n&gt; 90% (at a guess) of the execution time is spent in the actual NEAT \n&gt; process of generating offspring, comparing genomes and decoding \ngenomes \n&gt; into working networks. Therefore if you reduce the size of the \ngenomes \n&gt; within the population then you can expect a dramatic speed up. \nThere is \n&gt; also a scaling issue in SharpNEAT right now that means that it \nslows \n&gt; down a lot more than it should as the genome size increases. \nThere&#39;s a \n&gt; simple fix but I&#39;ve not had time to work on SharpNEAT lately.\n&gt; \n&gt; &gt;That \n&gt; &gt;won&#39;t be the case in other domains, and therefore the speedup \naspect \n&gt; &gt;of this might be misleading.  Therefore, it would be helpful to \nsee \n&gt; &gt;comparison graphs with generations on the x axis instead of \ntime.  \n&gt; &gt;Usually people in machine learning are interested in # \nevaluations \n&gt; &gt;to get a soltuion rather than CPU time since ultimately that&#39;s \nthe \n&gt; &gt;main factor in computational complexity.  Time alone doesn&#39;t give \n&gt; &gt;that information but generations does.\n&gt; &gt;  \n&gt; &gt;\n&gt; yes I can see the value in showing generation based graphs, with \nthe \n&gt; time based graphs the percieved benefit may just be from \nperforming more \n&gt; generations in a given amount of time - the none phased search \nruns may \n&gt; have achieved the same result if allowed to run to the same # of \n&gt; generations. I still like the time based graphs though because \n&gt; ultimately we need to know if we can find solutions within \nrealistic \n&gt; time frames. It&#39;s not much use devising a technqiue that can solve \n&gt; problem X within 1,000 years :)\n&gt; \n\nSure that&#39;s true, but in the machine learning community it&#39;s very \nunusual to ignore # evaluations, so I don&#39;t think you could publish \nresults with time-based graphs.  The best thing to do is show \nresults in terms of # evals or # generations on the x axis, and \nseparately mention the time differences.  \n\nThe main problem with using time in this case is it is so \napplication dependent....it seems that in most applications the \nadvantage would even out since most time is spent in domain \nsimulation and not network activation.\n\n&gt; &gt;-If you ran the complexifying or blended runs for the same number \nof \n&gt; &gt;generations as the phased runs would they catch up?  That&#39;s \nanother \n&gt; &gt;reason it would be good to see a comparison by generations rather \n&gt; &gt;than time.  If they can&#39;t catch up in the same # of generations, \n&gt; &gt;that is a very strong result!\n&gt; &gt;  \n&gt; &gt;\n&gt; Yes I agree that this would be an interesting experiment to run.\n&gt; \n&gt; &gt;-To really validate this approach, we need a task that cannot be \n&gt; &gt;solved without hidden nodes.  So probably another experiment in a \n&gt; &gt;new domain would be a good idea.\n&gt; &gt;  \n&gt; &gt;\n&gt; I&#39;m intending to do some phased search experiments with Tic-Tac-\nToe, and \n&gt; probably function regression. The later hopefully leading on to \nsome \n&gt; form of financial data prediction experiment(s).\n&gt; \n\nWell before you jump into TTT, make sure it really does require some \nhidden nodes to do well?  Derek and Philip probably can speak to the \ncomplexity necessary in TTT from their own experiments.\n\n&gt; &gt;-The # hidden nodes in a soltuion is interesting in its own \nright.  \n&gt; &gt;For example, what is actually happening to keep complexity \nsteady: \n&gt; &gt;Are connections being added then taken away back and forth over \nand \n&gt; &gt;over, or are several hidden layers being built at the same time \nas \n&gt; &gt;some inputs are being pruned?  A graph of # nodes per solution \nwould \n&gt; &gt;give some insight.\n&gt; &gt;  \n&gt; &gt;\n&gt; The search is mainly one of finding connections. Although hidden \nnodes \n&gt; do accumulate during the complexification phase they almost always \nare \n&gt; completely removed by the end of a prune phase. Some  &#39;common \nfeature&#39; \n&gt; nodes exist by way of connections from output nodes to other \noutput nodes.\n&gt; \n\nI see, that definitely suggests another domain is necessary to know \nhow well phased searching really works since it is unlikely that \nhidden nodes can always spare to be pruned in most domains.\n\n&gt; \n&gt; &gt;-It would be interesting to see a picture of a solution network.  \nIt \n&gt; &gt;would help address the above point and also it&#39;s just fun to \nsee :)\n&gt; &gt;  \n&gt; &gt;\n&gt; Yeh the problem here is that the networks from complexifying and \nblended \n&gt; runs are really complex, whereas the ones that have been pruned \nhave no \n&gt; hidden node and frankly look a bit boring :)  One idea is to runt \neh \n&gt; networks from a complexifying run through a prune phase to prune \naway \n&gt; redundant structure. My guess is that they will be utilising some \nhidden \n&gt; nodes, possibly a lot, whereas the pruning phase nets normally \ndon&#39;t \n&gt; have any.\n&gt; \n\nYes, that&#39;s interesting.  I think we&#39;ll know a lot if phased \nsearching is applied to another domain.\n\nAnyway, it&#39;s a great start and if you are seriously interested in \npublication, you may want to email me to discuss what you need to do \nin more detail.  \n\nken\n\n\n"}}