{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[{"name":"READ"}]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"userId":199382914,"authorName":"Mike Woodhouse","from":"&quot;Mike Woodhouse&quot; &lt;mikewoodhouse@...&gt;","profile":"mikewoodhouse","replyTo":"LIST","senderId":"XxCOX3oBjHXCBJiTWYQVS7PfcyDCpcdVVEed-pRZLOfw41QTIMfMI8QZDyggIXkT__-RqUNegpD3hyPtUtAIbpubBC5Dd462JHAznA5dc5fi","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Introducing Me","postDate":"1096033236","msgId":1593,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGNqMTg0aythMWNnQGVHcm91cHMuY29tPg=="},"prevInTopic":0,"nextInTopic":1601,"prevInTime":1592,"nextInTime":1594,"topicId":1593,"numMessagesInTopic":4,"msgSnippet":"I ve been playing with NNs and GAs for, golly (counts on fingers), well over a decade now. I started with Backprop, experimented with evolving weights rather","rawEmail":"Return-Path: &lt;mikewoodhouse@...&gt;\r\nX-Sender: mikewoodhouse@...\r\nX-Apparently-To: neat@yahoogroups.com\r\nReceived: (qmail 18025 invoked from network); 24 Sep 2004 13:40:47 -0000\r\nReceived: from unknown (66.218.66.218)\n  by m4.grp.scd.yahoo.com with QMQP; 24 Sep 2004 13:40:47 -0000\r\nReceived: from unknown (HELO n23.grp.scd.yahoo.com) (66.218.66.79)\n  by mta3.grp.scd.yahoo.com with SMTP; 24 Sep 2004 13:40:47 -0000\r\nReceived: from [66.218.67.191] by n23.grp.scd.yahoo.com with NNFMP; 24 Sep 2004 13:40:38 -0000\r\nDate: Fri, 24 Sep 2004 13:40:36 -0000\r\nTo: neat@yahoogroups.com\r\nMessage-ID: &lt;cj184k+a1cg@...&gt;\r\nUser-Agent: eGroups-EW/0.82\r\nMIME-Version: 1.0\r\nContent-Type: text/plain; charset=ISO-8859-1\r\nContent-Length: 4291\r\nX-Mailer: Yahoo Groups Message Poster\r\nX-Yahoo-Newman-Property: groups-compose\r\nX-eGroups-Remote-IP: 66.218.66.79\r\nFrom: &quot;Mike Woodhouse&quot; &lt;mikewoodhouse@...&gt;\r\nSubject: Introducing Me\r\nX-Yahoo-Group-Post: member; u=199382914\r\nX-Yahoo-Profile: mikewoodhouse\r\n\r\nI&#39;ve been &quot;playing&quot; with NNs and GAs for, golly (counts on fingers),\nwell over a decade now. I started with Backprop, experimented with\nevolving weights rather than training, discovered SANE, branched\nacross to GP with GEP (Gene Expression Programming), moved back to\nbackprop and evolved weights. I&#39;ve implemented (with varying degrees\nof success) in C, VB (3/4/5/6), Delphi, Ruby and now I&#39;m heading into\nC# country. One of the reasons for the variety being that I often\nbuild at least a feed-forward network as an early exercise in a\nlearning new language, not least because it always seems to be a fun\nthing to build.\n\nI&#39;ve been frustrated by several deficiencies of the models I&#39;ve built:\npopulation stagnation/local minima problems, uncertainty as to network\ntopology, inability adequately to define an appropriate fitness\nfunction amongst them. So having stumbled upon NEAT, I was thoroughly\nimpressed to discover the first two &quot;issues&quot; being handled - the third\nis sadly much more specific to my own failings than those of my code ;-)\n\nI joined the list a few weeks back and, in good newsgroup style have\nbeen reading through the correspondence to date. I don&#39;t think I&#39;ve\never read through a newsgroup or mailing list that has such a high\nsignal-to-noise ratio: I&#39;ve learned a tremendous amount just looking\nover peoples&#39; shoulders. Extracted from Yahoo!, tidied, formatted\n(8pt, 2 columns) in Word, I still had over 300 pages to work through,\nhence the delay between joining and introduction - I&#39;ve not been idle!\nThere&#39;s probably a book in there somewhere if someone had the energy\nto write it...\n\nI&#39;ve played around with various domains over time (XOR, OCR and some\nsimple games) but my most recent area of &quot;research&quot; has taken me back\nto an old love betting on football matches (that&#39;s soccer to our\nnon-UK colleagues). My interest has largely been rekindled by the rise\nand rise of the betting exchanges, where the margin to be overcome is\nsignificantly lower than was the case through the traditional routes\nof the bookmakers and, not inconsequentially, the opportunity to\nactually keep making money is not curtailed by the bookies&#39; tendency\nto close winning accounts... I&#39;ve been producing odds estimation\nmodels for a few years based on my own variant of the ELO chess rating\nsystem. I&#39;ve used GAs to &quot;tune&quot; the rating system parameters but I&#39;ve\nalways felt that the approach, and the (often extensive) structure\nI&#39;ve built upon it, was sub-optimal if not essentially flawed, but I\nlacked the tools to take the domain back to a NN-based approach. Come\nto think of it, I lacked the CPU power as well.\n\nThat said, the exercise hasn&#39;t been a complete disaster! I&#39;ve had an\nunquantifiably large amount of fun and while I can&#39;t claim to have\nmade an overall profit, my efforts to date have been better than\nrandom (i.e. I haven&#39;t lost *too* much...)\n\nWhy sports betting, and match betting at that, rather than the\nmarkets? Immediacy, I guess, which apart from the adrenaline rush\n(:-)) offers far greater profit potential: a 1% &quot;edge&quot; per event (I\nwish) is enormous when you consider that each season their are 1856\nmatches just in the English professional leagues. 1.01 ^ 1856 is about\n104 million. Of course, that&#39;s unachievable in real life: firstly, the\nodds aren&#39;t perfectly fair, if they were, random bets would break\neven), secondly many of the events occur simultaneously and thirdly\nthe entire amount can&#39;t be staked on each event (the first loss would\nrather tend to terminate the exercise). But capital can be reinvested\nmuch more frequently and thus made to work far harder. And frankly,\nI&#39;ve had more success estimating the probabilities of sports match\noutcomes than short-term stock price moves (my equity investing\n&quot;strategy&quot; is mostly buy-and-hold...)\n\nI&#39;m currently engaged (in between tasks associated with settling in to\na new house) in amusing myself with the consideration of various ways\nof approaching my problem domain and familiarising myself with\nexisting NEAT implementations, Ken&#39;s &quot;canonical&quot; C++ and Colin&#39;s C# in\nparticular. I expect to &quot;roll my own&quot; code because as a professional\ndeveloper that&#39;s where much of the fun lies, and it&#39;s not like I&#39;m in\nany hurry.\n\nIf you&#39;ve reached this far, thanks for your forbearance.\n\nRegards,\n\nMike Woodhouse\n\n\n"}}