{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[{"name":"READ"}]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"userId":29390171,"authorName":"Mattias Fagerlund","from":"&quot;Mattias Fagerlund&quot; &lt;mattias@...&gt;","profile":"mattias_fagerlund","replyTo":"LIST","senderId":"sSLAkClceapZjvZcA2-xxSgyUS2Zh2KLbtiA1AD9lBq8xcvdZil3hyp-ClkDuEWlBZHdNcyfS_dp-HI75i7g-synPxy8rKNYU-OmlyQCy6UEbeF9kQ","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [neat] Stock Market Revisited","postDate":"1105482054","msgId":1783,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PFdvcmxkQ2xpZW50LUYyMDA1MDExMTIzMjAuQUEyMDU0MDEwOUBvY3RhZ2F0ZS5jb20+","inReplyToHeader":"PGI1NDQ3MzBlMDUwMTExMDUxMTY5YmI2OTZmQG1haWwuZ21haWwuY29tPg==","referencesHeader":"PFdvcmxkQ2xpZW50LUYyMDA1MDExMTExMDcuQUEwNzIzMDA5NEBvY3RhZ2F0ZS5jb20+IDxiNTQ0NzMwZTA1MDExMTA1MTE2OWJiNjk2ZkBtYWlsLmdtYWlsLmNvbT4="},"prevInTopic":1780,"nextInTopic":1786,"prevInTime":1782,"nextInTime":1784,"topicId":1779,"numMessagesInTopic":14,"msgSnippet":"Hi! If this is out of scope for this mailinglist, I d be happy to take it to private email, though I am using NEAT to evolve my strategies. ... That s","rawEmail":"Return-Path: &lt;mattias@...&gt;\r\nX-Sender: mattias@...\r\nX-Apparently-To: neat@yahoogroups.com\r\nReceived: (qmail 88671 invoked from network); 11 Jan 2005 22:17:43 -0000\r\nReceived: from unknown (66.218.66.167)\n  by m25.grp.scd.yahoo.com with QMQP; 11 Jan 2005 22:17:43 -0000\r\nReceived: from unknown (HELO mxfep02.bredband.com) (195.54.107.73)\n  by mta6.grp.scd.yahoo.com with SMTP; 11 Jan 2005 22:17:42 -0000\r\nReceived: from bredin.nu ([85.224.125.148] [85.224.125.148])\n          by mxfep02.bredband.com with ESMTP\n          id &lt;20050111221741.SLJD24538.mxfep02.bredband.com@...&gt;\n          for &lt;neat@yahoogroups.com&gt;; Tue, 11 Jan 2005 23:17:41 +0100\r\nReceived: from WorldClient by bredin.nu\n\t(MDaemon.PRO.v7.2.0.R)\n\twith ESMTP id md50000036071.msg\n\tfor &lt;neat@yahoogroups.com&gt;; Tue, 11 Jan 2005 23:20:55 +0100\r\nReceived: from [127.0.0.1] via WorldClient with HTTP;\n\tTue, 11 Jan 2005 23:20:54 +0100\r\nDate: Tue, 11 Jan 2005 23:20:54 +0100\r\nTo: neat@yahoogroups.com\r\nMIME-Version: 1.0\r\nContent-Type: text/plain\r\nMessage-ID: &lt;WorldClient-F200501112320.AA20540109@...&gt;\r\nX-Mailer: WorldClient 7.2.0\r\nIn-Reply-To: &lt;b544730e050111051169bb696f@...&gt;\r\nReferences: &lt;WorldClient-F200501111107.AA07230094@...&gt; &lt;b544730e050111051169bb696f@...&gt;\r\nX-Authenticated-Sender: mattias@...\r\nX-Spam-Processed: bredin.nu, Tue, 11 Jan 2005 23:20:55 +0100\n\t(not processed: message from valid local sender)\r\nX-MDRemoteIP: 127.0.0.1\r\nX-Return-Path: mattias@...\r\nX-MDaemon-Deliver-To: neat@yahoogroups.com\r\nX-MDAV-Processed: bredin.nu, Tue, 11 Jan 2005 23:20:58 +0100\r\nX-eGroups-Remote-IP: 195.54.107.73\r\nFrom: &quot;Mattias Fagerlund&quot; &lt;mattias@...&gt;\r\nSubject: Re: [neat] Stock Market Revisited\r\nX-Yahoo-Group-Post: member; u=29390171\r\nX-Yahoo-Profile: mattias_fagerlund\r\n\r\nHi!\n\nIf this is out of scope for this mailinglist, I&#39;d be happy to take it to\nprivate email, though I am using NEAT to evolve my strategies.\n\n&gt; There may be some value in using returns over the various periods,\n&gt; rather than average prices.\n\nThat&#39;s interesting, I&#39;ll consider that. Hm... how do you calculate the\nreturn over a 14 day period, the price of day 1 - the price of price 14?\n\n&gt; I&#39;d also consider some form of volatility\n&gt; measure - the standard deviation of the logs of the returns would be a\n&gt; pretty typical value.\n\nI did some volatility calculations in my previous attempts, I&#39;ll get back\nto why I gave it up below\n \n&gt; What is/are your output(s)? Buy/Sell? Predicted future price? \n\nBuy/Sell indications. &gt;0.5 means wants to own &lt;0.5 doesn&#39;t want to own. So\nif it&#39;s owning and decides it doesn&#39;t want to own any more, it sells.\n\nI tried many methods, but this one worked best for me. I tried different\nstrategies for buying / selling. I tried short positions, I tried mixing\nshort and long, I tried numerous others.\n\nAbout short positions; \n\n* Short positions have an upside that is limited to 100% but their\ndownside is unlimited (as in you can lose an unlimited amount of money,\nthough the brokerage will forcibly sell your shares if it starts looking bad)\n\n* Long positions have a downside limited to 100% but an upside that&#39;s\nunlimited. I prefer long positions.\n\nOne input is &quot;is owning stock now&quot; which encourages longterm investments\nbecause my fitness is somewhat profitability based. \n\nMy fitness function including transaction costs _and_ it buys above open\nand sells below open which further punishes trades but has the benefit of\nbeing conservative. Something like \n\nBuy := Open + (High-Low)/x\nSell := Open - (High-Low)/x\n\nYou can&#39;t expect to buy on Open.\n\n&gt; Bear in\n&gt; mind that a short-term prediction may lead to frequent trading, which,\n&gt; unless you can deliver substantial returns will lead to commissions\n&gt; and bid-offer spreads eating up your profits.\n\nI find that infrequent trading is more of a problem in my current\nsimulations than frequent trading. And it&#39;s a big problem, because on a\nlong time series (10 years), it&#39;s easy to pick 10 good buy spots and 10\ngood sell spots and earn fantastic profits, but it&#39;s harder to pick 100\nsuch spots. \n\nAnd if you evolve something that trades well once in 10 years, that&#39;s less\nlikely to perform well out of bounds than something that trades well 1000\ntimes in 10 years.\n\nCurrently, I severely punish infrequent trading because I view it as a\nform of overfitting.\n\n&gt; This is a valuable (and profitable) system in a trending market,\n&gt; although it typically boils down to &quot;it&#39;s going up - buy, then sell\n&gt; when it stops going up&quot;. It tends to be awful in a sideways market.\n\nYes, and the definition of long term vs short term will control how\nprofitable it is - values that will differ from period to period. Thus,\nit&#39;s easy to create a long term/short term system that performs well in\nbounds, but performs poorly out of bounds (even in a trending market)\nbecause the cycles are faster or slower than the training period.\n\nSideways markets are a bitch, there&#39;s no two ways about it.\n \n&gt; Momentum and Relative strength are often useful in such markets. I\n&gt; never had much luck with more &quot;exotic&quot; indicators (stochastic\n&gt; thingies, oscillators and the like) although maybe I didn&#39;t calculate\n&gt; them correctly.\n&gt;\n&gt; Are you providing less correlated market information?Stock/sector\n&gt; indices? Interest/currency rates? Economic indicators? What about less\n&gt; obvious stuff: the price of oil/gold, say? The current FIFA ranking of\n&gt; the national football team? The Big Mac index?\n\nHere I&#39;m returning to why I gave up volatility;\n\nmy initial attempts (years back) presented each strategy with dozens of\nindicators, including: Forecast using linear regression, Momentum,\nRelative Strength Index, Money Flow Index, Accumulation / Distribution...\n(there were a lot more). My thinking was that more data is better.\n\nMy conclusion after extensive testing is that more data tends to lead to\noverfitting. I was using Genetic Programming at the time, but I think the\nargument holds for NEAT also; \n\n* More data makes each situation unique in one way or another. that means\nthat the combination of data can be used to indentify a particular day\nthat&#39;s good for buying or selling.  This makes strategies very specific.\n\n* Less data makes each situation less-unique (ooh, an oxymoron!), which\nmakes strategies more generic.\n\n* Generic strategies are good, because they can be applied to unknown\ndata, specific strategies are bad, because they can only be applied to the\ndata that they&#39;re specific to.\n\nReducing the number of indicators improved performance in my recollection.\n\nThe question is - which indicators to use and what fitness function to\nuse. I tried a dozen different fitness functions also. Max drawdown, max\nprofit, max profit / max drawdown etc.\n\n&gt; &gt; I&#39;m hoping to open up the discussion again and see if there are any\n&gt; new\n&gt; &gt; cool ideas floating around. The two indicators CloseRateAvg7,\n&gt; &gt; CloseRateAvg14 open up for this type of strategy.\n&gt; \n&gt; I&#39;m curious about seeing the effects of having the model output a\n&gt; &quot;confidence&quot; value.  I like the idea a lot, but haven&#39;t any concrete\n&gt; results to show usefulness or otherwise.\n\nWell, if it&#39;s not confident that owning the stock is a good idea, it gives\nit a &lt;0.5 value. My original system was far more complex than this, but\nthat&#39;s the gist of it.\n\n&gt; I can go on about this stuff until you&#39;re asleep - I spent  a lot of\n&gt; time (and CPU days) some years back trying to evolve fixed-topology\n&gt; networks for stock trading. I suspended operations due to (a) lack of\n&gt; easily-available/cheap data (b) inadequacy of approach - NEAT wasn&#39;t\n&gt; around (c) lack of time (d) something else I&#39;ve forgotten just now.\n\nI spent months working on my system, and I traded it for a couple of weeks\nusing about $10k. It actually performed as simulated, though it lost money\nfor the period I was testing it (both in simulation and in the real world).\n\nEach day at three I&#39;d perform trades as the system instructed me (that was\n9 NY time). One day, just before I was about to place my orders, DATEK\nwent off the air for no apparant reason, it was very weird. That was\nseptember 11:th 2001, you all know what happened next. The next day that\nthe marked was open I took the money of the market and the general marked\ndownturn meant that I had to use the money for other things. Haven&#39;t\ntraded the system since. But I&#39;d like to get into it again.\n\n&gt; There are definitely companies out there that have invested heavily in\n&gt; AI-inspired trading strategies. DE Shaw is one, part of what is now\n&gt; UBS is another.\n\nMy experience is this; it&#39;s near impossible to come up with a single\nstrategy that can trade a single stock profitable, out of bounds. \n\nI&#39;m not saying that AI trading isn&#39;t possible though...\n\ncheers,\nmattias\n\n\n\n"}}