{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[{"name":"READ"}]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"userId":7192225,"authorName":"Ian Badcoe","from":"Ian Badcoe &lt;ian_badcoe@...&gt;","profile":"ian_badcoe","replyTo":"LIST","senderId":"5KTrEyE9qJBV0HqJpstwJCkpmfjdHhWLHN3F0ykgJUpkHAJZ_q2NkM71liwDFLBI0v-u5yjTNNze-ZE8P00OmexjrM3MW9dmd50","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [neat] Symmetry, concepts and data buses in the brain","postDate":"1105982101","msgId":1826,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDYuMi4wLjE0LjAuMjAwNTAxMTQxNzE4MDIuMDI3ZDE5MzBAcG9wLm1haWwueWFob28uY28udWs+","inReplyToHeader":"PDIwMDUwMTE0MTcwMjIyLjI5NjQ4LnFtYWlsQHdlYjYwODAxLm1haWwueWFob28uY29tPg==","referencesHeader":"PDYuMi4wLjE0LjAuMjAwNDEyMjExNzIxNTYuMDNiYTYyZThAcG9wLm1haWwueWFob28uY28udWs+IDwyMDA1MDExNDE3MDIyMi4yOTY0OC5xbWFpbEB3ZWI2MDgwMS5tYWlsLnlhaG9vLmNvbT4="},"prevInTopic":1820,"nextInTopic":1828,"prevInTime":1825,"nextInTime":1827,"topicId":1698,"numMessagesInTopic":40,"msgSnippet":"... Hi, Let s call it admirably succinct rather than laconic.  I get exactly what you mean.  I have considered this approach in the past, in fact that may","rawEmail":"Return-Path: &lt;ian_badcoe@...&gt;\r\nX-Sender: ian_badcoe@...\r\nX-Apparently-To: neat@yahoogroups.com\r\nReceived: (qmail 8542 invoked from network); 17 Jan 2005 17:14:54 -0000\r\nReceived: from unknown (66.218.66.166)\n  by m20.grp.scd.yahoo.com with QMQP; 17 Jan 2005 17:14:54 -0000\r\nReceived: from unknown (HELO smtp001.mail.ukl.yahoo.com) (217.12.11.32)\n  by mta5.grp.scd.yahoo.com with SMTP; 17 Jan 2005 17:14:54 -0000\r\nReceived: from unknown (HELO ian2k.yahoo.co.uk) (ian?badcoe@212.159.73.108 with login)\n  by smtp001.mail.ukl.yahoo.com with SMTP; 17 Jan 2005 17:14:53 -0000\r\nMessage-Id: &lt;6.2.0.14.0.20050114171802.027d1930@...&gt;\r\nX-Mailer: QUALCOMM Windows Eudora Version 6.2.0.14\r\nDate: Mon, 17 Jan 2005 17:15:01 +0000\r\nTo: neat@yahoogroups.com\r\nIn-Reply-To: &lt;20050114170222.29648.qmail@...&gt;\r\nReferences: &lt;6.2.0.14.0.20041221172156.03ba62e8@...&gt;\n &lt;20050114170222.29648.qmail@...&gt;\r\nMime-Version: 1.0\r\nContent-Type: text/plain; charset=&quot;us-ascii&quot;; format=flowed\r\nX-eGroups-Remote-IP: 217.12.11.32\r\nFrom: Ian Badcoe &lt;ian_badcoe@...&gt;\r\nSubject: Re: [neat] Symmetry, concepts and data buses in the brain\r\nX-Yahoo-Group-Post: member; u=7192225\r\nX-Yahoo-Profile: ian_badcoe\r\n\r\nAt 17:02 14/01/2005, you wrote:\n\n\n&gt;--- Ian Badcoe &lt;ian_badcoe@...&gt; wrote:\n&gt;(about symettry)\n&gt;&lt;snip&gt;\n&gt;\n&gt;My suggestion is that a symettry detecting network\n&gt;might be evolved whose only function is to reduce many\n&gt;inputs to few inputs by detecting symettry.  The\n&gt;outputs of this ANN would be the inputs to the main\n&gt;ANN that is being evolved.\n&gt;\n&gt;For example, consider a board game played on a\n&gt;rectangular board of NxN squares.  The initial ANN\n&gt;receives all the inputs but maps them into a set of\n&gt;outputs that is equivalent to a rotation of the board\n&gt;so that most of the pieces are in the lower left\n&gt;corner.  This pre-processing does not have to be done\n&gt;by an ANN, but it could be.  The net effect would be\n&gt;as if the player viewed the board from various\n&gt;positions until he found the one with the pieces\n&gt;arranged most toward the lower left.  This greatly\n&gt;reduces the variety of configurations that must be\n&gt;considered, although they are still considerable.\n&gt;This might allow tic-tac-toe to be solved by\n&gt;neuroevolution.\n&gt;\n&gt;I hope I have not been too laconic; I will expand if\n&gt;asked.\n\nHi,\n         Let&#39;s call it &quot;admirably succinct&quot; rather than laconic.  I get \nexactly what you mean.  I have considered this approach in the past, in \nfact that may even have been when we discussed it before.\n\n         This is what I think of as the Mapping -&gt; Processing -&gt; Demapping \napproach, e.g. an outer subsystem (ANN or other) examines the data, decides \non an orientation, rotates the data to use that orientation and passes the \nresult to the inner subsystem.  The inner does its magic and then passes \nthe results back to the outer.  The outer then has to remove the mapping to \nrestore &quot;world coordinates&quot;, before the answer will make sense to the \noutput layer.\n\n         There are two problems with this approach:\n\nA) Demapping.  Obviously if we simply provide the outer subsystem then we \ncan guarantee that mapping is the inverse of demapping.  However, if we \nwish to evolve them then selecting them to do that (without applying a \nseparate and very specific selection pressure just to this subsystem) is \nvery improbable in the face of mutation (remember that the inner system \ncannot operate at all unless the outer is working).  Similarly, we would \nlike it to be free to evolve different mappings whilst retaining the \ninverse relationship but that is equally unlikely.\n\nB) Multipliciy of viewpoint.  Given a chess board, exploitation of the \nsymmetry doesn&#39;t just mean picking a single location and transforming the \nview into it.  Rather, the need is to consider the board under multiple \ntransforms and find the one that enables the inner subsystem to return the \nmost positive result.  You can view this in two ways (both of which \nprobably happen in nature), first, that the inner system feeds back to the \nouter saying &quot;now change the transform to&quot; -- this is essentially the \nroving eye approach.  Second, we can imagine the outer system providing \nmultiple transformations of the board and multiple copies of the inner \nsystem being used to analyze them in parallel.  This is what I call an \n&quot;omnipresent eye&quot; approach.  The advantages of an omnipresent eye are that \n(i) it looks further afield than a roving eye and does not rely on there \nbeing a path across the board to the region of interest, and (ii) that \nsince multiple views of the board are processed simultaneously, data from \ndifferent views can be used in the same calculation (either passing it to \nother views &quot;how dangerous is my neighbour&#39;s view?&quot;; or analyzing it in an \noverview subsystem &quot;which view is most confident?&quot;)\n\n         Both these limitations illustrate what I am wondering \nabout.  Because, although we can fairly easily see some situations under \nwhich they can be overcome.  We can also see how difficult they would be \nunder other conditions.  e.g.\n\n1) In a &quot;custom&quot; system where we have some evolving components, but \nhand-coded systems for other parts, then we could easily set up the \nhand-coded portion so that multiple viewpoints were processed and/or data \nmapped on input is correspondingly demapped on output.\n\n2) In a system where everything evolved, if we were processing only a \nsingle problem, then it would be very difficult for the system to evolve a \n[network] where mapping and demapping were kept compatible \n_by_the_process_of_evolution_ (e.g. relying on, when mapping mutates, that \ndemapping should mutate in the complementary manner).\n\n3) BUT, a system which had evolved (over a far longer period) to handle a \nvariety of &quot;symmetric&quot; problems, would/could have developed a general \npurpose map/demap system (a MaDem -- like a MoDem).  Such a system is \nrelated to the idea of a routing system (e.g. because remapping a \nchess-board is equavalent to rerouting the contents of one square to \nanother square).  And a routing system would also be required in order to \napply the madem system to more than one other system.  Such a system would \nautomatically keep mapping and demapping in synchrony, because it would be \nbuilt to *understand* them as two sides of the same coin.  It would be \nsoft-configurable with a mapping and loading the mapping would also define \nthe corresponding demapping.\n\n--\n\n         So what I am getting at is an interest in 3 which is deeply linked \nto ideas of modularity (and thus probably requiring indirect representation).\n\n         I&#39;m interested in (1) and part of the document I&#39;m currently \nworking on is a specification for a system which can do some aspects of it.\n\n         I&#39;m interested in any confirmation/commentary that my analysis \nthat (2) forms a &quot;hard&quot; problem for (short term) evolution and hence \nimplies the existence of (3) in natural thinkers.\n\n         And I&#39;m especially interested in any information or ideas about \nwhether you agree there&#39;s an implication that natural thinkers implement \nsome sort of systems akin to (3), what sort of level they might be \nimplemented at (e.g. is a &quot;router&quot; a 10, 10,000 or 10,000,000 neurone \nstructure), what sort of neural structures might be able to do it, and \nwhether it can be done with the sort of artificial neurones that we use at \nthe moment, or whether some new properties are required.\n\n         Ian Badcoe\n\n\n\nLiving@Home - Open Source Evolving Organisms - \nhttp://livingathome.sourceforge.net/\n\n\n\n\n"}}