{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[{"name":"READ"}]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"userId":177632070,"authorName":"Michael Gillam","from":"&quot;Michael Gillam&quot; &lt;gillam@...&gt;","replyTo":"LIST","senderId":"vilHCtrTYyT1KPi0mCkSCxgXuekhz6wqmJv7JeNEukk5k_ycUw5p5FjMy6hPSuvn8jb919RhzsedXFRRST4D7qr7J67OxvxhC1J3bN9UdQ","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [neat] Symmetry, concepts and data buses in the brain","postDate":"1106446023","msgId":1836,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGdpbGxhbS0wUzUvT0FpL3EyQWs0UUdlVnFxM2xONHkway9UZmNpQG1haWxibG9ja3MuY29tPg==","referencesHeader":"PDQxQzc0NDBCLjUwMTAzMDVAZHNsLnBpcGV4LmNvbT4gPGNxN3NmdCtoc29nQGVHcm91cHMuY29tPiA8Ni4yLjAuMTQuMC4yMDA0MTIyMTE3MjE1Ni4wM2JhNjJlOEBwb3AubWFpbC55YWhvby5jby51az4gPDQxRjJBRjYzLjcwNzA4MDJAZHNsLnBpcGV4LmNvbT4gPDAxYTUwMWM1MDBmMCQzYzJlZDNhMCQwZTE4YThjMEBKb3VybmV5Pg=="},"prevInTopic":1835,"nextInTopic":1837,"prevInTime":1835,"nextInTime":1837,"topicId":1698,"numMessagesInTopic":40,"msgSnippet":"Hi Colin, Interesting post! Just to add a thought to the mix... One other possibility regarding consciousness is that it is an *emergent* property of the","rawEmail":"Return-Path: &lt;gillam-0S5/OAjDq2Akb6aXGbyZtvbn5EHNfDP@...&gt;\r\nX-Sender: gillam-0S5/OAjDq2Akb6aXGbyZtvbn5EHNfDP@...\r\nX-Apparently-To: neat@yahoogroups.com\r\nReceived: (qmail 88459 invoked from network); 23 Jan 2005 02:07:38 -0000\r\nReceived: from unknown (66.218.66.166)\n  by m19.grp.scd.yahoo.com with QMQP; 23 Jan 2005 02:07:38 -0000\r\nReceived: from unknown (HELO smtp3.mailblocks.com) (140.174.9.93)\n  by mta5.grp.scd.yahoo.com with SMTP; 23 Jan 2005 02:07:38 -0000\r\nReceived: (qmail 5305 invoked from network); 23 Jan 2005 02:07:08 -0000\r\nReceived: from 10.10.0.71 (HELO mailblocks.com) (10.10.0.71)\n  by 10.10.0.93 with SMTP; 23 Jan 2005 02:07:08 -0000\r\nMIME-Version: 1.0\r\nTo: &lt;neat@yahoogroups.com&gt;\r\nContent-Type: text/plain;\tcharset=&quot;iso-8859-1&quot;\r\nContent-Transfer-Encoding: 7bit\r\nReferences: &lt;41C7440B.5010305@...&gt; &lt;cq7sft+hsog@...&gt; &lt;6.2.0.14.0.20041221172156.03ba62e8@...&gt; &lt;41F2AF63.7070802@...&gt; &lt;01a501c500f0$3c2ed3a0$0e18a8c0@Journey&gt;\r\nX-Mailer: Microsoft Outlook Express 6.00.2800.1437\r\nX-MSMail-Priority: Normal\r\nX-MB-Message-Source: ClientSMTP\r\nReceived: from 69.138.168.52 by app22.mailblocks.com (10.10.0.71) with SMTP (authenticated); Sat, 22 Jan 2005 18:07:07 -0800\r\nX-MB-Message-Type: User\r\nMessage-Id: &lt;gillam-0S5/OAi/q2Ak4QGeVqq3lN4y0k/Tfci@...&gt;\r\nX-MimeOLE: Produced By Microsoft MimeOLE V6.00.2800.1441\r\nDate: Sat, 22 Jan 2005 21:07:03 -0500\r\nX-Priority: 3\r\nX-eGroups-Remote-IP: 140.174.9.93\r\nFrom: &quot;Michael Gillam&quot; &lt;gillam@...&gt;\r\nSubject: Re: [neat] Symmetry, concepts and data buses in the brain\r\nX-Yahoo-Group-Post: member; u=177632070\r\n\r\nHi Colin,\n\nInteresting post!\n\nJust to add a thought to the mix...\n\nOne other possibility regarding consciousness is that it is an *emergent*\nproperty of the network (i.e. not a necessary pursuit and not necessarily\nreal.)\n\nWe know that almost all known chemical and physicial processes proceed in a\npredetermined direction.  (i.e.  If you were to rewind time and start it\nplaying again - the chemical/physical processes would proceed almost\n*exactly* the same.  I say almost - because new quantum theory suggests\nthere is a level of inherent unpredictability which might suggest different\noutcomes.)\n\nWe also know that we can detect thoughts *before* they become conscious.\n(i.e. a portion of neurons in your brain will simulate scratching your nose\nbefore you consciously decide - &quot;my nose itches&quot; and scratch it.)\n\nTaken together, these suggest that consciousness is a *secondary*\nphenomenon, and perhaps an *emergent* property of the network.\n\nThis observation suggests that a large enough and complex enough network\ncould experience this emergent property.  The Internet itself could *think*\nit is sentient - despite the fact that, like us, its thoughts are\npredetermined.  This approach has interesting and dour predictions for\ncommunication between species.\n\nThis approach also suggests that programmers do not have to worry about\n*building* consciousness into a system - it is an *emergent* property of an\nadequately complex adaptive network.\n\nThank you for your interesting post!\n\n-Mike\n-- \nMichael Gillam, MD\nDirector, Medical Media Lab (www.imedi.org)\nResearch Director, National Center for Emergency Medicine Informatics\n(www.ncemi.org)\nWashington D.C.\n\nInformatics Director, Division of Emergency Medicine\nEvanston Northwestern Healthcare\n\nInstructor of Medicine, Northwestern University Medical School\n\nChair, Section on Web Education\nSociety for Academic Emergency Medicine\n\n\n----- Original Message ----- \nFrom: &quot;Colin Green&quot; &lt;cgreen@...&gt;\nTo: &lt;neat@yahoogroups.com&gt;\nSent: Saturday, January 22, 2005 2:54 PM\nSubject: Re: [neat] Symmetry, concepts and data buses in the brain\n\n\n&gt;\n&gt; Hi,\n&gt;\n&gt; I&#39;ve just been catching up on this thread, and although I haven&#39;t\n&gt; necessarily followed all of the details I get the gist of it.\n&gt;\n&gt; It seems to me Ian that you&#39;re dealing with very big questions that are\n&gt; closely related to the mechanics behind conciousness, awareness,\n&gt; understanding, etc.  I would expect there to be some clues about how\n&gt; information moves around the brain in neurology literature, which is not\n&gt; an area I personally keep abreast of. The papers I /have/ seen tended to\n&gt; be unpenetrable to my mind, often I can&#39;t even determine which branch of\n&gt; neuroology thay are meant to be covering let alone understand the details.\n&gt;\n&gt; However, I think the central question you&#39;ve put forward (how functional\n&gt; modules in the brain are arranged and how they communicate) is a simple\n&gt; one to understand (from a big picture point of view). And I agree that\n&gt; speculating on what mechanisms and structures might be in play may give\n&gt; some insight into neuro-evolution and related areas. With this in mind\n&gt; I&#39;ll try elucidate my thoughts on the subject, although I&#39;m sure these\n&gt; ideas aren&#39;t anything knew.\n&gt;\n&gt; I think considering specific problems such as playing chess, and\n&gt; analysing your own thought processes whilst playing can give some\n&gt; insight into what is going on. Actually if we are talking about\n&gt; capitalising on symmetry I prefer to consider the game of Go, since\n&gt; (personally) I tend to always consider a chess board from one side - the\n&gt; side I am playing from. Whereas Go doesn&#39;t have this inherent sidedness\n&gt; and it is therefore probably more useful to rotate and translate the\n&gt; board in your mind when playing. Having said that I&#39;m fairly useless at\n&gt; both games, so what do I know ;)\n&gt;\n&gt; The first thing to note is that I home in on small groups of pieces and\n&gt; consider them in isolation of the rest of the board. When detecting\n&gt; patterns I won&#39;t always mentally rotate the pieces, usually I need to do\n&gt; this at first but then learn to recognise the various patterns in their\n&gt; different rotations directly. Secondly, the high level process of\n&gt; identifying interesting groups, rotating them and deciding if they are\n&gt; interesting is a concious process (state the obvious alert!),\n&gt; undoubtedly there is a heck of a lot of sub-concious activity (e.g.\n&gt; visual cortex) but  I see that as mostly being much lower level\n&gt; processes such as building a mental model of the board from the visual\n&gt; input - which is not what we&#39;re discussing.\n&gt;\n&gt; So I can percieve a group of pieces, the lines they form and their\n&gt; overall shape. I may then have a memory of the shape with and an\n&gt; associated memory of a good move (or moves) to play, or I may recall\n&gt; that this is a shape that is no use to me (no good moves) and will then\n&gt; move on to analysing other groups. Or I may have no memory at all of\n&gt; this pattern, in which case I have to analyse it keeping in mind the\n&gt; rules of the game and perhaps memories of similar patterns that may\n&gt; apply, considering each in turn and discounting them or flagging them as\n&gt; possible options.\n&gt;\n&gt; Some perhaps obvious notes to make at this point:\n&gt;\n&gt; 1) My concious thought can generally only focus on one thing at a time.\n&gt; I can quickly switch back to very recent thoughts (short term memory),\n&gt; allowing me to consider, say,  a number of different moves and how well\n&gt; they relate to each other. But I cannot consider them concurrently. As I\n&gt; consider each one I am assigning a sort of rating to it, while also\n&gt; trying to keep in mind the best rated move so far.\n&gt;\n&gt; 2) My capacity to keep each of these seperate thoughts in mind is\n&gt; limited. This becomes particularly obvious (for me) when performing\n&gt; mental arithmetic, forgetting earlier calculated values, or forgetting\n&gt; which part of the calculation they relate to. Some people seem better at\n&gt; maintaining short term memory than others, although in the case of\n&gt; arithmetic there is also the factor of some people memorising far more\n&gt; answers than others(e.g. multiplication tables), thus reducing the need\n&gt; to keep loads of figures in short term memory (sub-calculations).\n&gt;\n&gt; So it seems to me that the concious part of the brain is loading in\n&gt; single thoughts from the short and long term memory and acting a little\n&gt; like a CPU loading and executing single instructions at a time. Only\n&gt; instead of a simple instruction, the conciousness loads a chunck or unit\n&gt; of thought. These units I would expect to have a consistent structure to\n&gt; them so that they can be read/written to memory and passed around the\n&gt; brain using the same communication channels. This includes all thoughts,\n&gt; from simple sensory based information such as images, sounds, taste and\n&gt; sensation, but also including all other types of thoughts such as facts,\n&gt; language elements, concepts such as magnitude, orientation, momentum,\n&gt; hardness, the list goes on.\n&gt;\n&gt; Actually language is quite an interesting thing to consider. If I hear\n&gt; some phrase and remember it I would assume that I don&#39;t remember it as a\n&gt; chunk of audio like some mental equivalent of a WAV file, instead I am\n&gt; remembering the sequence of (recognised) words. Which leads to the\n&gt; question - am I remebering a copy of each word&#39;s unit representation as\n&gt; recalled from the language part of the brain, or am I remembering a sort\n&gt; of pointer to each word?\n&gt;\n&gt; Also consider how different facts, ideas and concepts (thought units)\n&gt; become related in the brain. Most of the time these thought units are\n&gt; just sitting in long term memory and not taking part in concious\n&gt; thought. e.g. If I say to you &quot;think of a yellow submarine&quot; you&#39;ve just\n&gt; recalled what a submarine is, and probably some related thoughts about\n&gt; The Beatles. Previously those thoughts were sitting dormant in your\n&gt; memory. So is there a direct physical connection between the phrase\n&gt; yellow-submarine, the concept of a submarine that is yellow and the\n&gt; beatles memory? or do these memories respond to the same stimulus, e.g.\n&gt; they had all been &#39;indexed&#39; under yellow-sub but not physically\n&gt; connected.  I suppose something like the later approach makes sense,\n&gt; otherwise you might have two unrelated memories in physically seperate\n&gt; parts of the hippocampus (or wherever memory is), which would make\n&gt; physically connecting at some later time difficult if say some new fact\n&gt; was introduced that linked the two.\n&gt;\n&gt; So I would hazard a guess that thoughts are packaged up and passed\n&gt; around the brain via something analogous to a data bus. As for modules\n&gt; that perform different functions - well perhaps these are analogous to\n&gt; the various execution circuits in a CPU and as such they would be fixed\n&gt; structures that operate on whatever data that is passed to them. This\n&gt; might explain how we can apply these funtions in different contexts.\n&gt; Although I strongly suspect that the &#39;execution units&#39; are highly\n&gt; abstract and that new skills that are learned are actually just new\n&gt; memories that cause a given chain of thought units to get recalled,\n&gt; perhaps some thought units specify how to combine other thoughts with\n&gt; the execution units to achieve a result.\n&gt;\n&gt; The area of the brain where thought units are retrieved to and processed\n&gt; could then be said to be where conciousness lies, but that would\n&gt; probably be a gross oversimplification.\n&gt;\n&gt; Colin\n&gt;\n&gt;\n&gt;\n&gt;\n&gt;\n&gt;\n&gt;\n&gt;\n&gt; Yahoo! Groups Links\n&gt;\n&gt;\n&gt;\n&gt;\n&gt;\n&gt;\n&gt;\n&gt;\n\n\n\n"}}