{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[{"name":"READ"}]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"userId":216215274,"authorName":"gerbopel","from":"&quot;gerbopel&quot; &lt;redcrocodile@...&gt;","profile":"gerbopel","replyTo":"LIST","senderId":"H5GeroosNlODCwsmSgqgaW3Wl5JsHr_GDnXaWHGweYkA9i0hEbSH4VCpYDBwoforw4ozmKfwgbAewTpRRoPaJbMyLqmq3JEXWOjHoQ","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: Species stagnation","postDate":"1112228225","msgId":1909,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGQyZmZpMStwZXAxQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDE5YjEwZDUxMDUwMzMwMTIzODNkZjMzYWJAbWFpbC5nbWFpbC5jb20+"},"prevInTopic":1908,"nextInTopic":1910,"prevInTime":1908,"nextInTime":1910,"topicId":1899,"numMessagesInTopic":26,"msgSnippet":"Derek, Thank you very much for your interest in my domain, let me explain more specifically what I am doing and what I have done already. Firstly, this is for","rawEmail":"Return-Path: &lt;redcrocodile@...&gt;\r\nX-Sender: redcrocodile@...\r\nX-Apparently-To: neat@yahoogroups.com\r\nReceived: (qmail 69766 invoked from network); 31 Mar 2005 00:17:11 -0000\r\nReceived: from unknown (66.218.66.216)\n  by m13.grp.scd.yahoo.com with QMQP; 31 Mar 2005 00:17:11 -0000\r\nReceived: from unknown (HELO n21a.bulk.scd.yahoo.com) (66.94.237.50)\n  by mta1.grp.scd.yahoo.com with SMTP; 31 Mar 2005 00:17:11 -0000\r\nDomainKey-Signature: \r\nReceived: from [66.218.69.1] by n21.bulk.scd.yahoo.com with NNFMP; 31 Mar 2005 00:17:06 -0000\r\nReceived: from [66.218.66.69] by mailer1.bulk.scd.yahoo.com with NNFMP; 31 Mar 2005 00:17:06 -0000\r\nDate: Thu, 31 Mar 2005 00:17:05 -0000\r\nTo: neat@yahoogroups.com\r\nMessage-ID: &lt;d2ffi1+pep1@...&gt;\r\nIn-Reply-To: &lt;19b10d5105033012383df33ab@...&gt;\r\nUser-Agent: eGroups-EW/0.82\r\nMIME-Version: 1.0\r\nContent-Type: text/plain; charset=ISO-8859-1\r\nContent-Length: 5289\r\nX-Mailer: Yahoo Groups Message Poster\r\nX-Yahoo-Newman-Property: groups-compose\r\nX-eGroups-Msg-Info: 1:12:0\r\nFrom: &quot;gerbopel&quot; &lt;redcrocodile@...&gt;\r\nSubject: Re: Species stagnation\r\nX-Yahoo-Group-Post: member; u=216215274\r\nX-Yahoo-Profile: gerbopel\r\n\r\n\nDerek,\n\nThank you very much for your interest in my domain, let me explain\nmore specifically what I am doing and what I have done already.\n\nFirstly, this is for an Honours Dissertation in Computer Games\nTechnology, at the University of Abertay in Scotland.  I&#39;ve been doing\nresearch for it for over a month now so I feel that I have a good\ngrounding in the theory... it&#39;s the implementation that&#39;s troubling me.\n\nSo, here is a screenshot of the scenario:\nhttp://www.redcrocodile.net/test/nolog/CatAndMouse.jpg\n\nThe cat is red, the mouse is yellow.  The cat has 16 inputs:\n\n0-3: Distance to walls in U,R,D,L\n4-7: Proximity to mouse in U,R,D,L (-1.0 for no sight)\n8-11: Direction heading of mouse is: U,R,D,L (-1.0 or +1.0)\n12-15: Measure of how long since walking on tiles in U,R,D,L\n\nThe cat can only see through LOS.  There are five outputs of the cat:\n\n0 - Move Up\n1 - Move Right\n2 - Move Down\n3 - Move Left\n4 - Make Sound\n\nThe sounds can be ignored at this point.  If no direction value is &gt;=\n0.9 then the cat stays put.  Otherwise whichever direction value is\nhighest, the cat goes that way.  This is processed every game tick.\n\nEach agent (cat and mouse) can move one tile per turn.  They both get\none turn per game tick.  The cat goes first.\n\nI am taking an incremental approach to learning here so these are the\nfour scenarios that have been tackled to this point:\n\nA) Static mouse.  The cat has LOS to the mouse and must go to him. \nVarious distances and locations to walls tested.  Evolved successfully.\n\nB) Mouse moving away from cat (3 tiles max).  The cat has LOS to the\nmouse and the mouse moves away from the cat but does not reach an\nintersection.  Various distances and locations to walls tested. \nEvolved successfully.\n\nC) Mouse moving towards cat.  Identical to B but mouse runs straight\nat the cat.  Evolved successfully.\n\nD) Mouse goes out of sight (4 tiles max).  Mouse starts in an\nintersection (screenshot above) and on his first move will go out of\nsight from the cat.  With a 4 move maximum you will notice that the\nmouse will never be able to turn at another intersection.  The cat\nreceives the direction vector of the mouse for the frame after it\ndissapeared (if he could see) but otherwise all he has is anything\nleft in his memory.  Obviously for this test to be successful, some\nrecurrent connections must be developed.  I have boiled this final\nscenario down to the simplest form possible for memory (screenshot). \nNothing is randomized, the start positions (for each scenario) are\nloaded from a scenario file and the directions that the mouse takes\nare alternated so the cat gets to try each intersection with the mouse\ngoing RIGHT, then LEFT.\n\nI do scenario D for directions: U, R (screenshot), D, L and not a\nsingle agent has managed to complete all four directions successfully.\n The directions that are done properly are obviously not because they\n&quot;remembered&quot; where the mouse was but because some random search\npattern happens to bring them to the right location, thus it works for\nsome but not for others.  The map layout is inducive to such behaviour\nbut I felt it was important to simplify everything as much as possible.\n\nThe way I work the evolution is first I evolve on scenario A.  Then I\ncombine scenario A with scenario B and evolve on both of those (so an\nagent is tested on both).  Then I combine scenario C with scenario A\nand B.  And so on.\n\nI have fantastic success with A,B,C.  I&#39;ve tried every setting in the\nworld for evolution now (% add link, % add neuron, % toggle link\nenabled, etc...) and A usually takes the longest (40 starting pairs)\nby finding a solution by G20.  10+ solutions by G50.  B usually finds\nupwards of 20 solutions by G28.  C usually finds a perfect solution\nwithin the first 1 or 2 generations.  10+ found by G13.\n\nI&#39;ve run D up to generation 1500 and out of a perfect 3197 the closest\na cat has come is around 2900.  Again, that is strictly through\n&quot;random&quot; searching that happens to pay off sometimes and looks\natrocious.  For example, some cats simply go down all the time - this\ngets them some payoffs as a bunch of the start pairs have the mouse\nplaced down from the cat.\n\nMy most recent aborted attempt at scenario D can be found here:\nhttp://www.redcrocodile.net/test/nolog/CatAndMouseLog.txt\n\nEach line is as follows:\n\n{Timestamp} Generation#(#since improv), # Of Spec, AvgFit, TopFit (ID)\n\nSo when the cats get to scenario D, they know how to do everything\nexcept remember where they last saw the mouse.  If they can see the\nmouse, they can catch him.  I keep scenario A,B,C in the comparison to\nensure that a method for solving D doesn&#39;t destroy the methods for\nsolving A,B,C.\n\nI think that answered all of your questions about the situation.  If I\nmissed anything out, let me know.\n\nThank you very much for your continued help, it is greatly\nappreciated.  I was feeling pretty distraught today (been doing these\nexperiments for 8 straight days now and don&#39;t have much to show for it\nyet) but I am not giving up yet!\n\nAt the moment I am sending a fully connected, 5 hidden neuron,\nrecurrent NN through scenarios A,B,C and D to see if indeed this is\npossible.  I am only evolving the weights and it has flown through A,B\nand C and is now working on D.  G94 has F2689 so far.  Not bad.\n\nMany thanks,\nMike\n\n\n\n\n"}}