{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[{"name":"READ"}]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"userId":216215274,"authorName":"gerbopel","from":"&quot;gerbopel&quot; &lt;redcrocodile@...&gt;","profile":"gerbopel","replyTo":"LIST","senderId":"vm8UZjHVB_5CWBMd2RPLOK1BQKqXP2vaw2-zmT-Ywb3katca5v5Nciiaw_kqnFEOlXbN49O0qfzqNfB3Bg1B-JK-wyqAQjnZPQQ4Zw","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: Species stagnation","postDate":"1112375437","msgId":1919,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGQyanZhZCszaHJyQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDE5YjEwZDUxMDUwNDAxMDgyODU5NTIzODA3QG1haWwuZ21haWwuY29tPg=="},"prevInTopic":1918,"nextInTopic":1920,"prevInTime":1918,"nextInTime":1920,"topicId":1899,"numMessagesInTopic":26,"msgSnippet":"Derek, Cheers for the feedback, I ll start by answering your questions. ... Yes.  I use -1.0 for invalid (for ex. no mouse sighted) and 0.0 to +1.0 for valid","rawEmail":"Return-Path: &lt;redcrocodile@...&gt;\r\nX-Sender: redcrocodile@...\r\nX-Apparently-To: neat@yahoogroups.com\r\nReceived: (qmail 32784 invoked from network); 1 Apr 2005 17:10:38 -0000\r\nReceived: from unknown (66.218.66.167)\n  by m29.grp.scd.yahoo.com with QMQP; 1 Apr 2005 17:10:38 -0000\r\nReceived: from unknown (HELO n2a.bulk.scd.yahoo.com) (66.94.237.36)\n  by mta6.grp.scd.yahoo.com with SMTP; 1 Apr 2005 17:10:38 -0000\r\nDomainKey-Signature: \r\nReceived: from [66.218.66.59] by n2.bulk.scd.yahoo.com with NNFMP; 01 Apr 2005 17:10:38 -0000\r\nReceived: from [66.218.66.84] by mailer8.bulk.scd.yahoo.com with NNFMP; 01 Apr 2005 17:10:38 -0000\r\nDate: Fri, 01 Apr 2005 17:10:37 -0000\r\nTo: neat@yahoogroups.com\r\nMessage-ID: &lt;d2jvad+3hrr@...&gt;\r\nIn-Reply-To: &lt;19b10d51050401082859523807@...&gt;\r\nUser-Agent: eGroups-EW/0.82\r\nMIME-Version: 1.0\r\nContent-Type: text/plain; charset=ISO-8859-1\r\nContent-Length: 5496\r\nX-Mailer: Yahoo Groups Message Poster\r\nX-Yahoo-Newman-Property: groups-compose\r\nX-eGroups-Msg-Info: 1:12:0\r\nFrom: &quot;gerbopel&quot; &lt;redcrocodile@...&gt;\r\nSubject: Re: Species stagnation\r\nX-Yahoo-Group-Post: member; u=216215274\r\nX-Yahoo-Profile: gerbopel\r\n\r\n\nDerek,\n\nCheers for the feedback, I&#39;ll start by answering your questions.\n\n&gt; So are all your inputs between 0 and 1?\n\nYes.  I use -1.0 for invalid (for ex. no mouse sighted) and 0.0 to\n+1.0 for valid inputs.\n\n&gt;&gt; 12-15: Measure of how long since walking on tiles in U,R,D,L\n&gt; \n&gt; I don&#39;t understand this set of inputs.\n\nThese 4 inputs measure how long (relatively speaking) it has been, in\ngame ticks, since the cat was last on the tiles in each direction\n(U,R,D,L).  So at the beginning, this will have a value of -1.0 for\nall four directions.  As soon as the cat moves 1 tile to the right\nthen he has just been on the tile to his left (last time there was\ntick 1, it is now tick 2) so it will have a value between 0.0 and\n+1.0.  The formula used is 1 - ((avg ticks since on tiles) /\ncurrent_tick_count).  Thus high values represent the fact that the cat\nwas just there.  This provides the cat with an input that he could\nutilize to avoid backtracking.\n\n&gt; The cat doesn&#39;t need to turn at all, correct?  It&#39;s got\n&gt; eyes in all four directions.\n\nCorrect.\n\n&gt; And if I&#39;m understand the mouse movement in the experiments\n&gt; where the mouse moves, it&#39;s moves are entirely deterministic,\n&gt; usually limited, and alternated left or right.  So when the\n&gt; mouse reaches it&#39;s fixed number of moves, it sits still?  Maybe\n&gt; I missed it, but how much time do you give the cat to find\n&gt; the mouse?\n\nThe direct route to the mouse is never greater than 21 tiles of\nmovement (everyone moves 1 tile per tick) and so I give the cat 35 ticks.\n\n&gt; So is a &quot;tile&quot; an area equivalent to the size of each actor?\n\nYes.\n\n&gt; &gt; D) Mouse goes out of sight (4 tiles max).  Mouse starts in an\n&gt; &gt; intersection (screenshot above) and on his first move will go\n&gt; &gt; out of sight from the cat.  With a 4 move maximum you will\n&gt; &gt; notice that the mouse will never be able to turn at another\n&gt; &gt; intersection.  The cat receives the direction vector of the\n&gt; &gt; mouse for the frame after it dissapeared (if he could see)\n&gt; &gt; but otherwise all he has is anything left in his memory.\n&gt; &gt; Obviously for this test to be successful, some recurrent\n&gt; &gt; connections must be developed. \n&gt; \n&gt; Hmm...I&#39;m not sure that&#39;s necessarily true, is it?  If I&#39;m\n&gt; understanding correctly, on the first time step, the cat has LOS to\n&gt; the mouse, then the next time step the mouse goes out of sight,\n&gt; either to the right or the left.  Is that correct?\n\nYes, that&#39;s correct.  A timeline, using this screenshot:\nhttp://www.redcrocodile.net/test/nolog/CatAndMouse.jpg\n\nNote: There are 2 tiles in between the cat and mouse.\n\nTick 1) Cat moves (mouse is in sight)\nTick 1) Mouse moves (mouse goes out of sight)\nTick 2) Cat cannot see the mouse.  Cat moves right again, still is not\nin sight of the mouse.\nTick 3) Mouse moves again.\nTick 3) If Cat moves right again, it reaches the intersection.  Now\nthe mouse is in sight.\n\n&gt; I think you are saying the mouse doesn&#39;t have enough movement to\n&gt; get out of LOS a second time.\n\nTrue.\n\n&gt; I&#39;m not sure this behavior would require a recurrent connections.\n&gt; As far as I can tell, the only significant difference in behavior\n&gt; desired is &quot;go in the direction the mouse *was*&quot; as opposed to &quot;go\n&gt; in the direction the mouse *is*&quot;.\n\nWell, personally, that is how I would define memory.  Semantics aside,\nmy understanding of NNs says that if all the information necessary to\nachieve best fitness is not available to the agent in the current\nstate (i.e. it is non-Markovian) then recurrent conections are required.\n\n&gt; And the main difference in inputs is that there is a constant input\n&gt; for mouse detection in the first ones, and only a single blip for\n&gt; input before the mouse ducks out of sight in the last.  Is this\n&gt; correct?\n\nYes.\n\n&gt; I&#39;m thinking that maybe that single blip of an input may not be\n&gt; enough to drive the cat in that direction, especially with a\n&gt; complicated recurrent network.\n\nAs mentioned, it works great with a hand-coded fully connected\nrecurrent network.  Even from distances across the entire map\n(1,1)-(23,1), it works perfectly (mentioned again at the end).\n\n&gt; I&#39;d be interested to see how a couple of variations might perform:\n&gt; \n&gt; 1) Clamp movement for both agents (cat and mouse) for something like\n&gt; 10 time steps, so that the cat is receiving direction and distance\n&gt; input for the mouse for more than 1 time step.  Then &quot;let them go&quot;.\n\nI&#39;m not sure what you mean by this.  Could you explain in a little\nmore detail?\n\n&gt; 2) Explicitly feed in an input for last known direction.  At this\n&gt; point it&#39;s not memorizing last position, but this might be a good\n&gt; intermediate step between C and D.  The mouse goes out of sight,\n&gt; but you&#39;re still feeding a positive input for that direction.  I\n&gt; would be interested to know how this performs too.\n\nYes, I would imagine that you&#39;re right in that this would help. \nHowever, I resigned myself to only allowing the cats access to LOS\ninputs from the beginning.  That, in particular, is one of the aspects\nthat differentiates my experiments with the others that I&#39;ve seen\n(obstacles blocking vision) amongst the NEAT circle of publications.\n\n-- Further update on my fully recurrent tests.  As mentioned they\npassed the simple scenario above (scenario D) with flying colours.  I\nincreased the glimpse distance to the entire map and they were able to\nproduce 40 different solutions (not carbon copies) by G1896 (first\nfound at G869).  For these experiments, my NEAT populations have not\ncome anywhere close to the fully recurrent population.\n\nCheers!\nMike\n\n\n\n\n"}}