{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[{"name":"READ"}]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"userId":54567749,"authorName":"Kenneth Stanley","from":"&quot;Kenneth Stanley&quot; &lt;kstanley@...&gt;","profile":"kenstanley01","replyTo":"LIST","senderId":"qf8zdBEOcoy65dqmEvvc-0Z9qKsGK5sOxWgauNfnlxZ0w8zzRVepalk-J8d3GVx41k7_E8QJg0mB44iwLb4jkoF95k5ZjlMFB7ebsyPJcJwt","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: response to advice offered","postDate":"1117074367","msgId":1979,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGQ3M2MzdithajJzQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDYuMi4wLjE0LjAuMjAwNTA1MjQxOTQ3MjEuMDM1ODRhMTBAcG9wLm1haWwueWFob28uY28udWs+"},"prevInTopic":1978,"nextInTopic":1980,"prevInTime":1978,"nextInTime":1980,"topicId":1975,"numMessagesInTopic":5,"msgSnippet":"I just thought I d follow up on some of Ian s comments based on my experience in the US. ... I ve ... Internet ... few ... at ... really ... From ... in ... ","rawEmail":"Return-Path: &lt;kstanley@...&gt;\r\nX-Sender: kstanley@...\r\nX-Apparently-To: neat@yahoogroups.com\r\nReceived: (qmail 1312 invoked from network); 26 May 2005 02:26:09 -0000\r\nReceived: from unknown (66.218.66.172)\n  by m29.grp.scd.yahoo.com with QMQP; 26 May 2005 02:26:09 -0000\r\nReceived: from unknown (HELO n12a.bulk.scd.yahoo.com) (66.94.237.20)\n  by mta4.grp.scd.yahoo.com with SMTP; 26 May 2005 02:26:09 -0000\r\nComment: DomainKeys? See http://antispam.yahoo.com/domainkeys\r\nReceived: from [66.218.66.58] by n12.bulk.scd.yahoo.com with NNFMP; 26 May 2005 02:26:09 -0000\r\nReceived: from [66.218.66.69] by mailer7.bulk.scd.yahoo.com with NNFMP; 26 May 2005 02:26:09 -0000\r\nDate: Thu, 26 May 2005 02:26:07 -0000\r\nTo: neat@yahoogroups.com\r\nMessage-ID: &lt;d73c3v+aj2s@...&gt;\r\nIn-Reply-To: &lt;6.2.0.14.0.20050524194721.03584a10@...&gt;\r\nUser-Agent: eGroups-EW/0.82\r\nMIME-Version: 1.0\r\nContent-Type: text/plain; charset=ISO-8859-1\r\nContent-Length: 10450\r\nX-Mailer: Yahoo Groups Message Poster\r\nX-Yahoo-Newman-Property: groups-compose\r\nX-eGroups-Msg-Info: 1:12:0\r\nFrom: &quot;Kenneth Stanley&quot; &lt;kstanley@...&gt;\r\nSubject: Re: response to advice offered\r\nX-Yahoo-Group-Post: member; u=54567749; y=pNU7jxHVWGlbBJtsnb6Bv3ZRSp4WIdJRDBhI_WsvoMQbktG2WH7W\r\nX-Yahoo-Profile: kenstanley01\r\n\r\nI just thought I&#39;d follow up on some of Ian&#39;s comments based on my\nexperience in the US.  \n\n--- In neat@yahoogroups.com, Ian Badcoe &lt;ian_badcoe@y...&gt; wrote:\n&gt; Hi,\n&gt; \n&gt; At 14:01 24/05/2005, you wrote:\n&gt; &gt;Thanks so much for your input guys, it is GREATLY appreciated. \nI&#39;ve\n&gt; &gt;been re-reading your posts several times now, exploring the\nInternet\n&gt; &gt;for information on Unis and thinking long and hard about my future.\n&gt; &gt;After all this, besides getting a headache, I have come up with a\nfew\n&gt; &gt;key points:\n&gt; &gt;\n&gt; &gt;(1) I don&#39;t know if I&#39;m &quot;qualified&quot; to enter into a PhD programme\nat\n&gt; &gt;the moment.  More than anything else this is because I am not\nreally\n&gt; &gt;sure what&#39;s involved in getting accepted.  I find that concrete\n&gt; &gt;information can be difficult to find on Universities&#39; websites. \nFrom\n&gt; &gt;my limited exposure to the entry requirements, I have noticed that\n&gt; &gt;applicants are required to write comprehensive essays and give\n&gt; &gt;discussions on their interested topic, including its history.  I do\n&gt; &gt;feel that my enthusiasm is at about 1000%, after engrossing myself\nin\n&gt; &gt;the subject for the last year, but I don&#39;t know if I&#39;d live up to\nthe\n&gt; &gt;PhD entry standards.\n&gt; \n&gt; Generally a good BSc is all that&#39;s required on paper and the rest is\ndown \n&gt; to impressing the potential-supervisor when you speak to him/her...\n&gt; \n&gt; Enthusiasm will help a lot, as will having already worked in a\nrelated area.\n&gt; \n\nThis is absolutely right.  It is a misconception to think that any\ndepartment expects you to be an expert before you arrive.  In my\nopinion at least, raw creative ability is far more valuable than \nexpansive expertise, which can be picked up sooner or later. \nEnthusiasm is a great predictor as well.\n\n&gt; &gt;Furthermore, correct me if I&#39;m wrong, but it seems that if I&#39;m\n&gt; &gt;interested in pursuing a PhD at a particular University, it is on\nme\n&gt; &gt;to: (a) come up with a project idea, (b) email the appropriate\nperson,\n&gt; &gt;(c) convince them to fund me while I do the work at their\ninstitution.\n&gt; &gt;  While I certainly have the enthusiasm and the drive to accomplish\n&gt; &gt;such a feat, I wonder if I would be successful after only 0.5\nyears of\n&gt; &gt;experience in the subject itself.  I find it difficult to know who\n&gt; &gt;exactly to ask in a Uni such specific questions and I don&#39;t want to\n&gt; &gt;bother the department heads if I don&#39;t need to.\n&gt; \n&gt; I hesitate to answer, because clearly a few things have changed\nsince my \n&gt; time as a Ph.D. student.\n&gt; \n&gt; Generally, however, this picture you paint seems a bit backwards. \nUsually \n&gt; what will happen (used to happen) is that a supervisor will have\nfunding \n&gt; for a Ph.D. place and will look around for somebody to fill it.  You\nare at \n&gt; a disadvantage compared to people who already did their first\ndegree in \n&gt; that department, simply because they will be known to the supervisor\nand \n&gt; also first to hear of it.\n\nThis may be true in some places, but it is probably not true as a\ngeneral rule.  A lot of places discourage students from applying to\nthe same place they completed they undergrad degree.  I know that the\nopposite also occurs, but opinions are very mixed.  UPenn told me\npersonally when I was an undergrad there I probably should apply\nelsewhere.  That may reflect on me (I hope not!) but I think it was\nmore of a general philosophy that it&#39;s healthier for everyone not to\nbe recycling the same blood forever.  Therefore, I&#39;d say being an\noutsider is just as likely to be an advantage as a disadvantage.  \n\nAlso, admission rationale can vary widely.  In some big departments,\nthey admit a lot of people who don&#39;t fit in with any specific funded\nresearch just because the person sounds promising or may fit in in the\nfuture.  UT is like that.  I came in as a TA with no official tie to\nany advisor.  They expected people like me to look for an advisor in\nthe couple years following admission to the Ph.D. program.  So the\npoint is, no prior tie-in was necessary.\n\n&gt; \n&gt; The subject of the Ph.D. is usually worked out by interaction\nbetween you \n&gt; and the supervisor, and generally changes a bit over the course of\nthe \n&gt; first year (mine went from enzyme kinetics and genetic engineering\nto \n&gt; computer simulation -- at one point I was just going to entitle it \n&gt; &quot;Studies.&quot; :) ).  How much of the subject is you and how much is\nthe \n&gt; supervisor depends on how the two of you get on.  You do here of\npeople \n&gt; studying something completely against the supervisors will, but a\nlot \n&gt; depends on who &quot;owns&quot; the funding, e.g. a studentship is generally\nawarded \n&gt; to _you_ and in extreme cases can be transferred to another\nsupervisor, \n&gt; whereas a research-assistantship is generally awarded to the\nsupervisor...\n&gt; \n\nThis is no doubt true in some places but again in other places the\ndepartment can support you for years without any definitive research\nagenda or even advisor.  It just depends on the department.  (perhaps\nit is also related to the academic culture in different countries)\n\n&gt; Half a years experience is a little low, but generally you learn\nwhat you \n&gt; need for a Ph.D. during the Ph.D. itself, e.g. my undergraduate \n&gt; Biochemistry merely equipped me to _start_ learning thew techniques\nI \n&gt; needed for a Ph.D. in enzyme kinetics, and when I switched to a \n&gt; computer-based approach I was essentially making it up myself....\n&gt; \n&gt; &gt;(2) Unfortunately, as I&#39;m sure you can all tell, this whole\nprocess is\n&gt; &gt;being rushed quite severely as I would like to continue studying\nASAP\n&gt; &gt;and not take too long of a break in between.  Of course, I need to\n&gt; &gt;balance this with finding the right institution, which may prove\n&gt; &gt;difficult.  That being said, it appears that most of the North\n&gt; &gt;American Universities stopped accepting MSc applications several\n&gt; &gt;months ago.\n&gt; \n&gt; In the UK, at least, Ph.Ds don&#39;t start at any particular time of \n&gt; year.  Although they cluster around september, just because that&#39;s\nwhen all \n&gt; the recent graduates get back from their holidays.  M.Sc.s come in\ntwo \n&gt; flavours &quot;by research&quot; and &quot;taught&quot;.  The former is 1/3 of a Ph.D,\nwhereas \n&gt; the latter is like an extra year of your B.Sc. course -- with the\nexception \n&gt; that it will specialize a lot more.\n&gt; \n\nIt&#39;s probably better to check the admissions schedules of the specific\nuniversities you are interested in rather than generalizing by county\nor continent.\n\n&gt; &gt;(3) Does anyone know of any Universities in Canada that are doing\nwork\n&gt; &gt;in the fields being discussed here?  I&#39;ve looked myself and come up\n&gt; &gt;empty handed.  I&#39;ve also emailed the CompSci departments at\nWaterloo\n&gt; &gt;and UofT to get their opinion, but have yet to hear back.\n&gt; \n&gt; Sorry, no idea.  You do have the biggest computer-game company in\nthe world \n&gt; however... and I think they sponsor a certain amount of research.\n&gt; \n&gt; &gt;(4) Right, more opinions needed.  I&#39;ll be honest, I&#39;m VERY keen to\ndo\n&gt; &gt;a PhD at UCF once Ken gets settled and gets the department up and\n&gt; &gt;running.\n&gt; \n&gt; 25 years time then...\n&gt; \n&gt; &lt;ducks&gt;\n&gt; \n&gt; But seriously, getting anything solid started in academia can take\nages...\n&gt; \n\n:) How can I avoid responding to this?  This kind of thing can&#39;t be\npredicted but I&#39;ve seen people launch big research programs in their\nfirst year before.  It depends on your connections and your startup\npackage terms.  Also, the department can support students through\nTAships who are starting out who will eventually convert to RAships\nwhen the professor gets things rolling.  One thing I can tell you is\nthat American Universities try to encourage the young profs to get\nthings off the ground quickly.  I have a startup package that includes\na certain level of funding for an RA and research costs right off the\nbat.  Ian&#39;s right though that establishing a big thriving research\ngroup will take time, but in general the first people to show up will\nbe the ones who end up in that research group.  Keep in mind I was a\nTA for 2 or 3 years here at UT before my advisor (Risto) paid me a\npenny out of his research budget.  Nevertheless, I was gradually\nestablishing myself as a member of his group during that time, and\ngetting paid the whole time by the department&#39;s TA fund.  At UT at\nleast, that seems to be the norm: People spend the first few years as\na TA while they shop around for an advisor.  Advisors start paying\npeople once they&#39;ve become established and productive in research.\nObviously the timetable can vary a lot since some people know exactly\nwhat they want to do and some have no idea.\n\n&gt; &gt;   In the mean time, the University of Sussex&#39;s &quot;Evolutionary\n&gt; &gt;and Adaptive Systems&#39; MSc programme looks absolutely perfect for\nwhere\n&gt; &gt;I am right now.  My thinking is that the extra year of intensive NE\n&gt; &gt;work should provide me with a more thorough background in NE (and\n&gt; &gt;related subjects) and thus perhaps get me into these surely\n&gt; &gt;competitive programmes.  What do you guys think?  Is that overkill\nor\n&gt; &gt;does it seem like a reasonable plan?\n&gt; \n&gt; Presumably you have confirmed that NE is in this program and that at\nleast \n&gt; one staff member is keen on it?\n&gt; \n&gt; e.g. &quot;Evolutionary and Adaptive Systems&#39; doesn&#39;t _have_ to include\nany NE, \n&gt; and if it does may not include TWEAN and only focus on tweaking \n&gt; weights.  It depends on the staff involved.  e.g. what they teach\nyou will \n&gt; focus on their personal interests, surrounded by a halo of more\ngeneral \n&gt; stuff, but if they personally dislike some approach, it can be\nreduced to a \n&gt; mere footnote.\n&gt; \n\nThere are a few people who were on this group that actually took that\nprogram.  I wonder if any of them could comment...\n\n&gt; Other than that, it sounds excellent and if you can get money from \n&gt; somewhere, it would be a very good set up for a Ph.D. plus giving\nyou a \n&gt; year to find one...\n&gt; \n\nThat&#39;s true, it may be a good way to spend the intervening year.\n\n&gt; Best of luck and hope I&#39;m not lying.\n&gt; \n&gt; \n&gt;          Ian\n&gt; \n&gt; p.s. there must be resources to help you with this, web-sites, \n&gt; careers-advisors, people you know from your last course...\n&gt; \n\nAlso some people on this group have been through looking for a program\nbefore.  It&#39;s tough in North America since hardly anywhere has any\nTWEANN or AE research going on.  There are a ton of programs ranked\nhighly in AI, but for some reason they aren&#39;t doing the stuff we&#39;re\ninterested in.  In some ways, we are in a battle to get established on\nthis continent because the  AI people in the more dominant/older areas\nare essentially a self-perpetuating unit.  But that&#39;s always the case\nwith change.\n\nken\n\n\n\n"}}