{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[{"name":"READ"}]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"userId":7192225,"authorName":"Ian Badcoe","from":"Ian Badcoe &lt;ian_badcoe@...&gt;","profile":"ian_badcoe","replyTo":"LIST","senderId":"ijisQa8kx8MgrMdYbJTwPxMBovcL4PGYAy1l6Vl7AhiEZzYBFSNW7hD4opJO7Z4S7D2HQpb6r1yyu9ukkRwqdSHIcuClp1AtQE4","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [neat] Benchmarks?","postDate":"1121172064","msgId":2061,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDYuMi4wLjE0LjAuMjAwNTA3MTIxMTU1MTguMDMyOTU5MDhAcG9wLm1haWwueWFob28uY28udWs+","inReplyToHeader":"PDQyRDJFRDY0LjUwMDAzMDRAZHNsLnBpcGV4LmNvbT4=","referencesHeader":"PDQyQ0M1MDE5LjMwNDA4MDlAZHNsLnBpcGV4LmNvbT4gPFBpbmUuTE5YLjQuNjMuMDUwNzA3MTIyMzIxMC4yODk4OUBvcmFuZ2UtcGVrb2UuY3MudXRleGFzLmVkdT4gPDQyRDA4OTgwLjkwNjAwMDdAZHNsLnBpcGV4LmNvbT4gPDYuMi4wLjE0LjAuMjAwNTA3MTExNzI0MTcuMDMyMGRkMDBAcG9wLm1haWwueWFob28uY28udWs+IDw0MkQyRUQ2NC41MDAwMzA0QGRzbC5waXBleC5jb20+"},"prevInTopic":2060,"nextInTopic":2062,"prevInTime":2060,"nextInTime":2062,"topicId":2028,"numMessagesInTopic":33,"msgSnippet":"At 23:06 11/07/2005, you wrote:\n Ian Badcoe wrote:\n \n Hi,\n \n \n \n I suspect the same problem is still present in game playing since you\n can only","rawEmail":"Return-Path: &lt;ian_badcoe@...&gt;\r\nX-Sender: ian_badcoe@...\r\nX-Apparently-To: neat@yahoogroups.com\r\nReceived: (qmail 8624 invoked from network); 12 Jul 2005 12:33:55 -0000\r\nReceived: from unknown (66.218.66.218)\n  by m23.grp.scd.yahoo.com with QMQP; 12 Jul 2005 12:33:55 -0000\r\nReceived: from unknown (HELO smtp005.mail.ukl.yahoo.com) (217.12.11.36)\n  by mta3.grp.scd.yahoo.com with SMTP; 12 Jul 2005 12:33:55 -0000\r\nReceived: (qmail 8945 invoked from network); 12 Jul 2005 12:33:40 -0000\r\nReceived: from unknown (HELO ian2k.yahoo.co.uk) (ian?badcoe@212.159.73.108 with login)\n  by smtp005.mail.ukl.yahoo.com with SMTP; 12 Jul 2005 12:33:40 -0000\r\nMessage-Id: &lt;6.2.0.14.0.20050712115518.03295908@...&gt;\r\nX-Mailer: QUALCOMM Windows Eudora Version 6.2.0.14\r\nDate: Tue, 12 Jul 2005 13:41:04 +0100\r\nTo: neat@yahoogroups.com\r\nIn-Reply-To: &lt;42D2ED64.5000304@...&gt;\r\nReferences: &lt;42CC5019.3040809@...&gt;\n &lt;Pine.LNX.4.63.0507071223210.28989@...&gt;\n &lt;42D08980.9060007@...&gt;\n &lt;6.2.0.14.0.20050711172417.0320dd00@...&gt;\n &lt;42D2ED64.5000304@...&gt;\r\nMime-Version: 1.0\r\nContent-Type: text/plain; charset=&quot;us-ascii&quot;; format=flowed\r\nX-eGroups-Msg-Info: 1:12:0\r\nFrom: Ian Badcoe &lt;ian_badcoe@...&gt;\r\nSubject: Re: [neat] Benchmarks?\r\nX-Yahoo-Group-Post: member; u=7192225; y=nfHkopFCGlt74S_QNa6MwUPUif9EYzZjiwmBsQG4GDhIg3JU2Q\r\nX-Yahoo-Profile: ian_badcoe\r\n\r\nAt 23:06 11/07/2005, you wrote:\n&gt;Ian Badcoe wrote:\n&gt;\n&gt; &gt;Hi,\n&gt; &gt;\n&gt; &gt;\n&gt; &gt;\n&gt; &gt;&gt;I suspect the same problem is still present in game playing since you\n&gt; &gt;&gt;can only evaluate a small proportion of the possible paths in the game -\n&gt; &gt;&gt;usually determined by the opponents you are playing against. In fact\n&gt; &gt;&gt;with co-evolution the networks will normally (I think) end up playing\n&gt; &gt;&gt;within a very narrow range of game strategies - which means they perform\n&gt; &gt;&gt;poorly when played against humans or even simple algorithmic strategies\n&gt; &gt;&gt;they have never encountered before. Although I&#39;m happy to be proved\n&gt; &gt;&gt;wrong on this, that partly my experience so in some limited Tic-Tac-Toe\n&gt; &gt;&gt;co-evolution experiments I&#39;ve been working on (more on those another time).\n&gt; &gt;&gt;\n&gt; &gt;&gt;\n&gt; &gt;\n&gt; &gt;I was talking to somebody on a newsgroup about just this point (it wasn&#39;t\n&gt; &gt;you, was it?)\n&gt; &gt;\n&gt; &gt;\n&gt;Nope, not me. I have just recently started lurking in newsgroups again\n&gt;so maybe you&#39;ll see this subject start up again. I&#39;ve been experimenting\n&gt;with tic-tac-toe (TTT), evaluating players against what I call a pareto\n&gt;dominance chain (I need to check this terminology, I suspect it&#39;s\n&gt;wrong). It goes something like this:\n&gt;\n&gt;1) In the first generation all players play each other and the best one\n&gt;becomes the first entry in the &#39;pareto dominance chain&#39; (to be honest\n&gt;though picking a random player is just as good).\n&gt;2) All subsequent evaluations are made by playing each entry in the\n&gt;chain. Fitness against each entry is multiplied by that entry&#39;s index+1,\n&gt;since later entries are deemed to be better players, and therefore\n&gt;scoring points against them is mostly better than points against earlier\n&gt;entries, mostly.\n&gt;3) If 1 or more players in a gen beats all of the entries in the chain\n&gt;then one of these is selected to be a new entry on the end of the chain.\n&gt;If there is more than one candidate with the same high score then just\n&gt;pick one at random (actually pick the last one I think, this doesn&#39;t\n&gt;matter).\n\nWhy treat the chain as an ordered set of tests?  e.g. if a player could \nbeat all _except_ the first in the chain, shouldn&#39;t that be regarded as \nvery fit?\n\nI guess the answer is &quot;CPU&quot;?\n\n&gt;I think Ken & Risto use a dominace chain in &quot;Competetive Coevolution\n&gt;through Evolutionary Complexification&quot; (2004), but this is only for\n&gt;monitoring progress of the co-evolution search proper. I instead use\n&gt;this as the basis for evaluation. This has a few side effects:\n&gt;\n&gt;1) Populations cannot ebb and flow between a few strategies, e.g.\n&gt;strategy A beats B, B beats C and C beats A. Repeat ad infinitum.\n&gt;2) Fitness is relative to the dominance chain, and so a higher fitness\n&gt;implies a better genome overall not just within the context of the\n&gt;current population.\n\nThis is true and a useful property.  However it does have the drawback of \nmaking the fitness in two runs non-comparable with each other.\n\n&gt;3) Evaluation is reasonably fast.\n&gt;\n&gt;Well ok it&#39;s not quite this straightforward. As you might expect there\n&gt;is a quick run of new entries into the dominace chain  early on and the\n&gt;frequency of new entries drops off as &#39;better&#39; players are appended,\n&gt;thus inceasing the threshold for entry onto the chain. Actually this is\n&gt;possibly a beneficial circumstance because if the chain gets long then\n&gt;evaluation will take longer.\n&gt;\n&gt;In my first experiments the chain length maxed out at around the\n&gt;mid-20&#39;s in length and the populations best players were poor. So why\n&gt;can&#39;t they beat the still relatively poor players in the chain? I\n&gt;hypothesized that they probably could, given enough time, but because of\n&gt;the narrow range of strategies represented by the chain most beneficial\n&gt;mutations/crossovers (against other strageties) are being discarded\n&gt;because the fitness function doesn&#39;t evaluate these aspects of play yet.\n\nYou do have the problem that until a strategy appears in the chain, there \nis no drive to create a solution to it.\n\nBut I would have thought that for a &quot;simple&quot; game like TTT this would form \nonly a minor probability barrier.  Is it possible that your representation \nis limiting evolution in some way?\n\n&gt;So how can I modify evaluation to &#39;catch&#39; more of these beneficial\n&gt;mutations? I obviously need a wider range of strategies to play against.\n&gt;Perhaps several dominance chains and some technique for ensuring they\n&gt;are representing different strategies, at least to some degree - this\n&gt;seems potentially difficult and/or conceptualy messy.\n&gt;\n&gt;Fortunately there is a technique that allows me to evaluate against a\n&gt;wider range of strategies using the dominancce chain I have in place,\n&gt;consider this... If two ANN&#39;s play TTT they will always play the same\n&gt;sequence of moves - so when evaluating them we just play two games -\n&gt;with each playing first. Ahh you say, but what if I rotate one of the\n&gt;player&#39;s view with respect to the other player? In fact there are four\n&gt;rotations * one flip (or viewing the board from the underside) * playing\n&gt;1st/2nd = 16 possible relative views of the board. Playing ANN&#39;s in all\n&gt;16 configurations gives a much better indication of their relative\n&gt;strength and also causes the ANNs to play a different/wider set of\n&gt;strategies.\n\nThis is a good way to increase the situations considered.\nBut my view (which you probably know :) would be that we need a way of \nsetting up the networks to be rotationally invariant before they would have \nmuch chance of finding the &quot;essence&quot; of the game.\n\nDamn, you motivated me, I want to work on this now!\n\nI&#39;d like to work in C++, what NEAT version would be best.  Just scanning \nthe list there&#39;s Ken&#39;s and Mat&#39;s.  I&#39;m generally on Windows, OTOH I don&#39;t \nespecially care about graphics for this, so....\n\n&gt;I currently have a search running using this technique and the dominance\n&gt;chain is 48 in length and best fitness is still improving at a steady\n&gt;rate. Unfortunately evaluation is now quite slow but this is more to do\n&gt;with the complexity of the genomes since I have optimised the game code\n&gt;to execute at several 100k games/sec (48*16=768 games/evaluation doesn&#39;t\n&gt;sound /too/ bad to me). A rather slow pruning phase is now underway so\n&gt;maybe speed will pick up again later (optimisation of pruning code may\n&gt;be on the cards here).\n&gt;\n&gt;Performance of the best genome so far is mediocre - looking at results\n&gt;against a random player they are roughly equal to the solutions evolved\n&gt;using Derek & Philip&#39;s approach of evolving against fixed strategies.\n&gt;But don&#39;t forget that no knowledge of TTT is inherent in the system, so\n&gt;I&#39;m quite happy with this result so far.\n&gt;\n&gt;Apart from further optimisation of SharpNEAT then I&#39;m also considering\n&gt;corrupting the concept of the dominace chain by limiting it&#39;s length to\n&gt;say, 30, thus dropping older, poor entries on the chain. Although this\n&gt;would open the door for the &#39;C beats A&#39; scenario it&#39;s now more like &#39;Z\n&gt;beats A&#39; and this is less likely now that there is a large difference in\n&gt;playing ability between the two ends of the chain. So new strategies may\n&gt;still beat the latest entry, but to get placed on teh chain new\n&gt;strategies must be ALL current entries on the chain.\n\nCould you keep stats on how many of the incoming players each member of the \nchain is able to defeat.  Then the one to trim would be the one showing the \nleast relevance to recent populations.\n\nAnother idea might be to make the chain a set, and test all players against \nall set members.  That costs more, BUT if you limit the size of the set, \nAND consider new entries to the set on the ability to beat a _different_ \nsubset of the players from the other members of the set...\n\n         Ian\n\nIn fifteen minutes, everybody will be in the future.\n\n\n\n\t\t\n___________________________________________________________ \nHow much free photo storage do you get? Store your holiday \nsnaps for FREE with Yahoo! Photos http://uk.photos.yahoo.com\r\n\n"}}