{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[{"name":"READ"}]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"userId":151231063,"authorName":"Joseph Reisinger","from":"Joseph Reisinger &lt;joeraii@...&gt;","profile":"joeraii","replyTo":"LIST","senderId":"ROlZQW4PJ1PGdQwUvIDj73efm0bi8PSQcr95xuokhM8Hqmp7_xtdtm3unwtqpKNMen7Uu--66MOEFif7xafVBRt6GEdAgf5NZfXNY6cDuw","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [neat] Introduction/Some Questions","postDate":"1121441047","msgId":2090,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PFBpbmUuTE5YLjQuNjMuMDUwNzE1MDkzMjA2MC40MzAzQG9yYW5nZS1wZWtvZS5jcy51dGV4YXMuZWR1Pg==","inReplyToHeader":"PGRiN240ZStqOXNmQGVHcm91cHMuY29tPg==","referencesHeader":"PGRiN240ZStqOXNmQGVHcm91cHMuY29tPg=="},"prevInTopic":2088,"nextInTopic":2096,"prevInTime":2089,"nextInTime":2091,"topicId":2088,"numMessagesInTopic":13,"msgSnippet":"Hi Ashot, Its great to see another face in the modular NEAT camp, at the moment we re greatly outnumbered :) But anyway in general its nice to see more people","rawEmail":"Return-Path: &lt;joeraii@...&gt;\r\nX-Sender: joeraii@...\r\nX-Apparently-To: neat@yahoogroups.com\r\nReceived: (qmail 58266 invoked from network); 15 Jul 2005 15:27:54 -0000\r\nReceived: from unknown (66.218.66.167)\n  by m23.grp.scd.yahoo.com with QMQP; 15 Jul 2005 15:27:54 -0000\r\nReceived: from unknown (HELO nobodaddy.cs.utexas.edu) (128.83.120.154)\n  by mta6.grp.scd.yahoo.com with SMTP; 15 Jul 2005 15:27:54 -0000\r\nReceived: from orange-pekoe.cs.utexas.edu (joeraii@... [128.83.120.122])\n\tby nobodaddy.cs.utexas.edu (8.13.4/8.13.4) with ESMTP id j6FFO7WA004761\n\tfor &lt;neat@yahoogroups.com&gt;; Fri, 15 Jul 2005 10:24:07 -0500 (CDT)\r\nReceived: (from joeraii@localhost)\n\tby orange-pekoe.cs.utexas.edu (8.13.4/8.13.4/Submit) id j6FFO7Bc004912;\n\tFri, 15 Jul 2005 10:24:07 -0500\r\nDate: Fri, 15 Jul 2005 10:24:07 -0500 (CDT)\r\nTo: neat@yahoogroups.com\r\nIn-Reply-To: &lt;db7n4e+j9sf@...&gt;\r\nMessage-ID: &lt;Pine.LNX.4.63.0507150932060.4303@...&gt;\r\nReferences: &lt;db7n4e+j9sf@...&gt;\r\nMIME-Version: 1.0\r\nContent-Type: TEXT/PLAIN; charset=US-ASCII; format=flowed\r\nX-eGroups-Msg-Info: 1:12:0\r\nFrom: Joseph Reisinger &lt;joeraii@...&gt;\r\nSubject: Re: [neat] Introduction/Some Questions\r\nX-Yahoo-Group-Post: member; u=151231063; y=WiweKo8K_ZqhjELQbew8dt5AL9NJlKf2NhHV48PsxhM9gA\r\nX-Yahoo-Profile: joeraii\r\n\r\nHi Ashot,\n\nIts great to see another face in the modular NEAT camp, at the moment \nwe&#39;re greatly outnumbered :) But anyway in general its nice to see more \npeople tacking the &quot;NN representation problem,&quot; particularly since the \nlimitations of direct NN encodings are so painful.\n\n&gt; \tMy initial idea was a type of modular NEAT. Essentially the way it\n&gt; works is that each new innovation actually creates a coevolving NEAT\n&gt; population which starts as simple but can complexify (which then have\n&gt; nodes which can complexify).  Every network that uses this innovation\n&gt; would actually share the same &#39;module&#39; which would be the module with\n&gt; the best average fitness across all networks.  Modules would be\n&gt; evolved for several generations before the &#39;top&#39; NEAT population was\n&gt; given one generation.  The benefits here are that this would allow\n&gt; evolution to choose the level of modularity that was fitting for the\n&gt; problem, would be a continuous &#39;evolution&#39;(pardon) on NEAT rather than\n&gt; a radical change (in other words it reduces to NEAT), and would solve\n&gt; the problem of adding on new modules while maintaining smooth mutation\n&gt; (by starting them small).  Sort of an ESP meets NEAT idea perhaps.\n&gt; I&#39;ve looked over some of Joe&#39;s stuff, but I think this is different in\n&gt; that modularity is optional rather than forced.\n\nThis is definitely an interesting direction, I particular appreciate that \nyou&#39;ve found a way to circumvent &quot;forcing&quot; modularity, as this would \nprobably improve your performance in cases where a lot of modularity is \nnot strictly necessary to solve the problem. I have a few questions \nthough:\n\n1) What is the fitness function of the co-evolved module populations? Just \nmaximizing the average fitness of the &#39;top&#39; population? One of the things \nwe found out running modular NEAT was that promoting &quot;generalist&quot; module \nstrategies over &quot;specialist&quot; module strategies didn&#39;t really make sense. \nShouldn&#39;t you want to keep any module that creates an innovative \nbreakthrough, even if it only does so in one member of the &#39;top&#39; \npopulation (i.e. has a low average fitness, but generates a fitness spike \nin one parent).\n\n2) How will you generate the initial seeding of a module population?\n\n3) How will you allocate input/outputs and module connectivity? This was \none of the trickiest problems in writing modular NEAT (you discuss this at \nlength below, see my reply).\n\n4) How will you deal with the stochastic evaluation situation created by \nmodule-module co-evolution. Consider this case: two modules (A and B) \ncompose network X. Under your algorithm (if I understand correctly) A gets \nan evolution phase, B gets an evolution phase, and then X evolves one \ngeneration. So now when we come back to A&#39;s evolution phase, the \npopulation fitness rankings may have completely changed, because fitness \nis dependent on B&#39;s evolution is well. In modular NEAT this proved to be \nthe biggest weak point in the algorithm, since it yielded no real module \nevolution (if you read the paper: modules evolved to be /highly/\ngeneralist, and then it turned out that only bindings really mattered for \nfitness).\n\nOne approach Ken and I discussed akin to this is &quot;hierarchical \nmodularizing NEAT&quot; where subpopulations could have their own \nsubpopulations of modules, ad infinitum. This allows evolution to choose the \nright granularity for each module more effectively, at the cost of having \nto evaluate many, many more subpopulations. Initially, you don&#39;t really \nknow how complex a module needs to be, so you start by making naive module \npartitions. Later, however, it may turn out that some modules you \npartitioned off can stay simple, but others may need to become very \ncomplex (i.e. should be constructed out of sub-modules). Anyway, it seems \nyour approach is a good first step towards this. I&#39;m very interested in to\nsee your results.\n\n&gt; \tThe main questions with this approach is what the base building block\n&gt; should be and how to produce the initial selection pressure for\n&gt; modularity (since the &#39;module&#39; would be used in the same network).\n&gt; The building block can be just a node, just a link, or more.  By more\n&gt; perhaps the new module should have the option of connecting from a\n&gt; random set of up to n to another random set of up to n nodes.  By\n&gt; changing the n we can have different binding specificity for the\n&gt; modules.\n\nDid Risto show you the (unpublished) paper by Steetskamp? He did some \ntests on doing SANE/ESP with things other than fully connected nodes (for \nexample individual links, half-nodes, etc). And the main thing he found \nwas that once you introduce hard-dependencies between two modules (i.e. if \nmodule A&#39;s output feeds only into module B), then correctly evaluating \nmodule performance becomes very difficult (i.e. module A&#39;s fitness is now \ncompletely at the whim of module B, and vice-versa).\n\nAnyway,  if the building block is just a link, how would you then do \ncomplexification? You&#39;d need some mechanism to pull in more inputs \nand maybe more outputs later (similar perhaps to Shimon&#39;s work on fsNEAT).\n\n&gt; \tThink along these lines brought up some other questions.  When NEAT\n&gt; adds a node it actually is functionally no different then a weight\n&gt; mutation (with the exception of the non-linearity of the sigmoid).\n&gt; For a node to really add functionality above what direct link can\n&gt; accomplish it must at least have two inputs or two outputs.  So for\n&gt; NEAT to take advantage of a new node mutation it actually has to get\n&gt; lucky twice, once to add node in the right place, and another two add\n&gt; a link to/from it.  I think in general this problem is sidestepped by\n&gt; having a much higher add-connection rate.  If I&#39;m right on this (am I?\n&gt; ) then perhaps the mutation should  be changed to add a node which\n&gt; connects two inputs/outputs simultaneously, or n inputs/outputs?\n\nThis is probably worth exploring. I&#39;ll defer to Ken on discussing it, \nthough.\n\n&gt; \tAlong the same lines of thinking, has anyone tried using more\n&gt; powerful functions at the nodes rather than just a threshold? For\n&gt; example an average, or maximum, or minimum, or a switch, or so on?\n\nI was just discussing adding gating/competition to NEAT with Risto a few \nweeks ago. He seems to think it might be worthwhile. For example, \ncompetition between nodes could be implemented simply using a &quot;compete&quot; \ntype link, which would then compare the activation of the two competing \nnodes, and only allow the node with the higher activation to fire.\n\n&gt; mutations incremental by being clever.  The only drawback I see here\n&gt; is that this is less biologically &#39;accurate&#39;, but this is irrelevant\n&gt; for us right?  I can think of several functions that would be\n&gt; particularly useful in combining modules together, or reusing modules\n&gt; in new places.\n\nYes, Ken gave a great talk at GECCO this year on fully exploring where we \nshould be shackled to biology, and where we should cast off our slimy \norganic fetters.\n\n&gt; \tMore along the same lines, and with some inspiration from this paper:\n&gt; http://nn.cs.utexas.edu/lookup?whiteson:gecco03, what I am leaning\n&gt; towards now is writing a switch network on top of the regular NEAT\n&gt; population.  The algorithm would start with just one NEAT population\n&gt; which attempts to solve the entire problem, then after n generations,\n&gt; or after stagnation, a switch network would complexify on top of this\n&gt; population. At each &#39;switch&#39; an NN also evolves which makes the\n&gt; decision on which network to choose to perform the task.  I think the\n&gt; difficulty here is the chicken and egg problem in getting the system\n&gt; off the ground.  What I&#39;m aiming for is to solve the 3v1 keepaway task\n&gt; (from the paper) without using hand coded sub-tasks.  I&#39;m not sure\n&gt; I&#39;ve atriculated this very well, but hopefully the gist comes across.\n&gt; Thanks for any thoughts.\n\nThis is definitely a more tractable architecture, but its more rigid, and \nlimited a-priori. What if you find you need 4 behaviors, instead of 3? \nAlso, how would you handle the switching in networks with recurrent \nconnections (i.e. memory)? Would each network &quot;observe&quot; and keep track of \nmemory individually, or would a switch start running from a &quot;newly \nawakened&quot; sub-network?\n\nAnyway, this looks like a great start, and I hope you will be continuing \nthis work in the Fall as well.\n\n\n-- \n\nJoseph Reisinger\nhttp://www.cs.utexas.edu/users/joeraii\n\n"}}