{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[{"name":"READ"}]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"userId":7192225,"authorName":"Ian Badcoe","from":"Ian Badcoe &lt;ian_badcoe@...&gt;","profile":"ian_badcoe","replyTo":"LIST","senderId":"Mks8JZ07i0DtcUrughxp0sA3ueojU04gf9QVL-j8kuIm6ijAybx5nMyS9NhKjJLbYsiHXsUdIUoUFvgkuhvQLUKoSUetGUa77Y0","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [neat] Introduction/Some Questions","postDate":"1121964047","msgId":2136,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDYuMi4wLjE0LjAuMjAwNTA3MjExMzQ5NDQuMDMyYzk1MDBAcG9wLm1haWwueWFob28uY28udWs+","inReplyToHeader":"PG9wc3QzMnowY3p4NHAzM21AbWFpbC51dGV4YXMuZWR1Pg==","referencesHeader":"PGRiN240ZStqOXNmQGVHcm91cHMuY29tPiA8Ni4yLjAuMTQuMC4yMDA1MDcxODEyMTMxMS4wMzM1YTUyMEBwb3AubWFpbC55YWhvby5jby51az4gPG9wc3QzMnowY3p4NHAzM21AbWFpbC51dGV4YXMuZWR1Pg=="},"prevInTopic":2123,"nextInTopic":0,"prevInTime":2135,"nextInTime":2137,"topicId":2088,"numMessagesInTopic":13,"msgSnippet":"","rawEmail":"Return-Path: &lt;ian_badcoe@...&gt;\r\nX-Sender: ian_badcoe@...\r\nX-Apparently-To: neat@yahoogroups.com\r\nReceived: (qmail 64617 invoked from network); 22 Jul 2005 08:16:24 -0000\r\nReceived: from unknown (66.218.66.172)\n  by m8.grp.scd.yahoo.com with QMQP; 22 Jul 2005 08:16:24 -0000\r\nReceived: from unknown (HELO smtp005.mail.ukl.yahoo.com) (217.12.11.36)\n  by mta4.grp.scd.yahoo.com with SMTP; 22 Jul 2005 08:16:24 -0000\r\nReceived: (qmail 48755 invoked from network); 22 Jul 2005 08:16:23 -0000\r\nReceived: from unknown (HELO ian2k.yahoo.co.uk) (ian?badcoe@212.159.73.108 with login)\n  by smtp005.mail.ukl.yahoo.com with SMTP; 22 Jul 2005 08:16:23 -0000\r\nMessage-Id: &lt;6.2.0.14.0.20050721134944.032c9500@...&gt;\r\nX-Mailer: QUALCOMM Windows Eudora Version 6.2.0.14\r\nDate: Thu, 21 Jul 2005 17:40:47 +0100\r\nTo: neat@yahoogroups.com\r\nIn-Reply-To: &lt;opst32z0czx4p33m@...&gt;\r\nReferences: &lt;db7n4e+j9sf@...&gt;\n &lt;6.2.0.14.0.20050718121311.0335a520@...&gt;\n &lt;opst32z0czx4p33m@...&gt;\r\nMime-Version: 1.0\r\nContent-Type: text/plain; charset=&quot;us-ascii&quot;; format=flowed\r\nX-eGroups-Msg-Info: 1:12:0\r\nFrom: Ian Badcoe &lt;ian_badcoe@...&gt;\r\nSubject: Re: [neat] Introduction/Some Questions\r\nX-Yahoo-Group-Post: member; u=7192225; y=33-EEE5vmDU8WW8Bj7qDLzlU7v2R1o1OeVFU8lYUYZb6nbASgw\r\nX-Yahoo-Profile: ian_badcoe\r\n\r\n\n&gt; &gt;&gt; which I am having trouble with because I\n&gt; &gt;&gt; have so many brilliant ideas ;)\n&gt; &gt; I think that&#39;s quite a common problem around here.  I think it indicates\n&gt; &gt; that the subject is so rich in potential that we all see many many more\n&gt; &gt; possibilities than we have time to try...\n&gt;or it may also indicate that we are shooting somewhat in the dark..\n\nThat too!\n\n&gt; &gt; - how are module&lt;-&gt;module connections coded?\n&gt;\n&gt;I&#39;m not sure I understand what this means, how are they implemented?\n\nHow do you know which output on which module to connect to which input on \nwhich other module?\nWhat kind of gene encodes it, and where is that gene, and what happens when \na gene specifies a connection that the module does not have?\n\n&gt; &gt; - can a module change its &quot;signature&quot; and display new inputs/outputs?\n&gt;\n&gt;see below\n\nI looked below but i didn&#39;t find the piece you meant...\n\n&gt; &gt; - can a module appear more than once in a genome?\n&gt;\n&gt;In the sense that the same module is reused in networks that have been \n&gt;mutated, or crossed-over, yes.\n\nThere&#39;s a difference between two modules that happen to be the same and two \ninstances of the same module.  e.g. because only in the latter case will \nthey be mutated together and thus maybe find a better solution at _two_ \npoints in the network.\n\n&gt; &gt;&gt; Every network that uses this innovation\n&gt; &gt;&gt; would actually share the same &#39;module&#39; which would be the module with\n&gt; &gt;&gt; the best average fitness across all networks.\n&gt; &gt;\n&gt; &gt; So can there be more than one &quot;allele&quot; of the same module in the\n&gt; &gt; population, competing with one another?\n&gt;\n&gt;There are no actual modules in the parent chromosome, only pointers to the \n&gt;sub-populations.\n\nUnderstood, but the question was about what a &quot;module&quot; was.  Is a module \none network, or is a module a definition of a _type_ of network.\n\nIn the former case, all modules are equivalent and a module for &quot;log&quot; is in \ncompetition with a module for &quot;sqrt&quot;.\n\nIn the latter case, modules for log only compete with other modules for log...\n\n&gt; &gt; current - evolve modules faster than genomes so that they can adapt to best\n&gt; &gt; fill the slots they occupy\n&gt; &gt; reverse - evolve genomes faster than modules so they can explore the best\n&gt; &gt; usage of the modules they have\n&gt; &gt;\n&gt; &gt; :)\n&gt;\n&gt;Yea, after talking to Joe, I can see that my intuition on this was \n&gt;incorrect.  Specifically, evolving the modules before they were in \n&gt;significantly diverse environments doesn&#39;t make any sense.\n&gt;\n&gt;One idea to solve the issue of changing selective pressures is to clear \n&gt;and start clean at each phase.  In other words, evolve the parents, evolve \n&gt;the modules, clear the parents and evolve them from scratch with the \n&gt;modules fixed, and go back and forth this way.\n\nStarting again slaughters one view of modules.  e.g. by comparison with \nenzymes in cells, there is some argument that the content of the module \n(the active site of the enzyme that performs some chemical process) was \nvery hard to evolve but that the external interface of the module (the \ninputs and outputs for a module, the exact choice of chemical to work on \nand the response to other chemicals turning the enzyme on and off) are \neasily mutated.\n\nThus this definition of modularity becomes to do with what the \n&quot;evolvability&quot; people call weak and strong binding (I think they call it \nbinding...?).\n\nThe difficult to construct system inside the module consists of pieces that \nare strongly bound together.  It is veyr hard to mutate them without \nbreaking the system.\n\nThe external interface of the module is weakly bound, however and easily \nmutated.\n\nIn this definition, the whole purpose of the module is that the external \ninterface shields the inner workings so that they can be used in another \ncontext _without_ exposing them directly to the mutations required to get \nthem into the new context, which would probably destroy them.\n\nthink of it is like some standard electrical component which has a load of \nDIP switches on the back for configuring how its external connections \nwork.  When the component is inserted into a new machine, those switches \nare easily flipped until the machine&#39;s IO is acceptible to the component, \n_without_ having to get out a screwdriver and soldering iron and fiddle \nwith the &quot;NO USER SERVICEABLE PARTS&quot; inside.\n\n&gt; &gt;&gt;   The benefits here are that this would allow\n&gt; &gt;&gt; evolution to choose the level of modularity that was fitting for the\n&gt; &gt;&gt; problem, would be a continous &#39;evolution&#39;(pardon) on NEAT rather than\n&gt; &gt;&gt; a radical change (in other words it reduces to NEAT), and would solve\n&gt; &gt;&gt; the problem of adding on new modules while maintaining smooth mutation\n&gt; &gt;&gt; (by starting them small).\n&gt; &gt;\n&gt; &gt; That is a very good take on modules.  Another variant of the same thing\n&gt; &gt; that occurs to me is, introduce a new module by selecting a sub-net of an\n&gt; &gt; existing genome.  All entry-points to that sub-net are the module inputs\n&gt; &gt; and all exit-points are its outputs.  The modules initial contents are the\n&gt; &gt; original contents of the subnet.  Thus the initial addition of the module\n&gt; &gt; is guaranteed not to change the network.\n&gt; &gt;\n&gt; &gt; [[note that if the sub-net is one node then the module is the smallest\n&gt; &gt; possible non-inert fragment and if the sub-net is one link then the module\n&gt; &gt; is starting as a &quot;piece of wire&quot; which is _very_ simple, but has only one\n&gt; &gt; input and one output]]\n&gt;\n&gt;But how to create a selective pressure for modularity if we pick a \n&gt;specific sub-net from a specific network?\n\nI don&#39;t follow you.  Why would you want selection for modularity?  If the \nproblem requires modules (and your system supports them) then modules will \nfeature in the solution.  If you problem does not require modules, then it \nis a mistake to try and force them in...\n\nI also don&#39;t see how what I said has any impact on any scheme for selection \npressure.  I was just talking about creating the things, any selection \nhappens later.\n\n&gt; &gt;&gt;         Along the same lines of thinking, has anyone tried using more\n&gt; &gt;&gt; powerful functions at the nodes rather than just a threshold? For\n&gt; &gt;&gt; example an average, or maximum, or minimum, or a switch, or so on?\n&gt; &gt;\n&gt; &gt; We discussed this as well and I believe some people started to try it.  I\n&gt; &gt; plan to try it.  I&#39;m not sure &quot;more powerful&quot; functions are the most\n&gt; &gt; important angle, however, I think just a choice of different simple\n&gt; &gt; functions can be useful.  Look for a discussion about how hard it is to\n&gt; &gt; evolve a network that multiplies two inputs...\n&gt;\n&gt;I agree, I meant powerful from the perspective of the Neural Net, in other \n&gt;words a task which is elementary, yet difficult to for the NN to do now.\n\nAh!  Then yes, a lot fo us have been having that thought...\n\n         Ian\n\nIn fifteen minutes, everybody will be in the future.\n\n\n\n\t\t\n___________________________________________________________ \nHow much free photo storage do you get? Store your holiday \nsnaps for FREE with Yahoo! Photos http://uk.photos.yahoo.com\r\n\n"}}