{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[{"name":"READ"}]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"userId":54567749,"authorName":"Kenneth Stanley","from":"&quot;Kenneth Stanley&quot; &lt;kstanley@...&gt;","profile":"kenstanley01","replyTo":"LIST","senderId":"gvqnk8372neMQpbwnMfbwngfGsjZ2P50p4Bv3_oN46yEEVnE_SpqFCkEkYJhlM61oXqsaGV0MkyeAbhpVL4Qy7vm6j68Lj8BAloVF7oTN3gB","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: Speciation Compatibility Threshold Equation","postDate":"1069973082","msgId":227,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGJxNXVvcittdXY4QGVHcm91cHMuY29tPg==","inReplyToHeader":"PDIwMDMxMTI1MTYxOTQ0LjUwNTQ1LnFtYWlsQHdlYjYwNTA4Lm1haWwueWFob28uY29tPg=="},"prevInTopic":224,"nextInTopic":229,"prevInTime":226,"nextInTime":228,"topicId":134,"numMessagesInTopic":37,"msgSnippet":"... No actually I visited a couple universities and gave talks there. ... When will you calculate this difference?  During evolution itself?  Or some kind of","rawEmail":"Return-Path: &lt;kstanley@...&gt;\r\nX-Sender: kstanley@...\r\nX-Apparently-To: neat@yahoogroups.com\r\nReceived: (qmail 28803 invoked from network); 27 Nov 2003 22:44:45 -0000\r\nReceived: from unknown (66.218.66.216)\n  by m20.grp.scd.yahoo.com with QMQP; 27 Nov 2003 22:44:45 -0000\r\nReceived: from unknown (HELO n17.grp.scd.yahoo.com) (66.218.66.72)\n  by mta1.grp.scd.yahoo.com with SMTP; 27 Nov 2003 22:44:45 -0000\r\nReceived: from [66.218.67.137] by n17.grp.scd.yahoo.com with NNFMP; 27 Nov 2003 22:44:45 -0000\r\nDate: Thu, 27 Nov 2003 22:44:42 -0000\r\nTo: neat@yahoogroups.com\r\nSubject: Re: Speciation Compatibility Threshold Equation\r\nMessage-ID: &lt;bq5uor+muv8@...&gt;\r\nIn-Reply-To: &lt;20031125161944.50545.qmail@...&gt;\r\nUser-Agent: eGroups-EW/0.82\r\nMIME-Version: 1.0\r\nContent-Type: text/plain; charset=ISO-8859-1\r\nContent-Length: 12488\r\nX-Mailer: Yahoo Groups Message Poster\r\nX-eGroups-Remote-IP: 66.218.66.72\r\nFrom: &quot;Kenneth Stanley&quot; &lt;kstanley@...&gt;\r\nX-Yahoo-Group-Post: member; u=54567749\r\nX-Yahoo-Profile: kenstanley01\r\n\r\n--- In neat@yahoogroups.com, Derek James &lt;blue5432@y...&gt; wrote:\n\n&gt; What were you in California for?  A conference?\n&gt; \n\nNo actually I visited a couple universities and gave talks there.\n\n&gt; \n&gt; I think the basic approach Philip and I are going to\n&gt; take is to calculate some sort of percentage\n&gt; difference between chromosomes for usage as a\n&gt; speciation threshold.  If we find that our populations\n&gt; are either underspeciation or overspeciating, then\n&gt; we&#39;ll modify the threshold to be dynamic.\n&gt; \n\nWhen will you calculate this difference?  During evolution\nitself?  Or some kind of preprocessing?  \n\n&gt; \n&gt; I&#39;m not sure either.  Intuitively, I&#39;d be inclined to\n&gt; say that adding a node to a three-node network, in\n&gt; general, has a more profound effect on its behavior\n&gt; than adding a node to a 500-node network.  \n&gt; \n&gt; After all, one of the inherent features of distributed\n&gt; computing approaches like neural networks is their\n&gt; robustness.  A few thousand brain cells die off here\n&gt; or there, a chunk of the mouse&#39;s brain is cut out, but\n&gt; overall function isn&#39;t impacted significantly.  And I\n&gt; would think that the robustness of the network would\n&gt; only increase as the size of the network increased,\n&gt; and more redundancy and distribution become features\n&gt; of the system.\n&gt;  \n\nYes true I agree.  But there is a number under which \nI think realtive size is less important.  I just don&#39;t\nknow what that number is.\n\n&gt; &gt; --- In neat@yahoogroups.com, &quot;Derek James&quot;\n&gt; &gt; &lt;blue5432@y...&gt; wrote:\n&gt; So the speciation mechanism for an\n&gt; &gt; indirect encoding \n&gt; &gt; &gt; scheme would probably need to base speciation on\n&gt; &gt; phenotype.\n&gt; &gt; \n&gt; &gt; I strongly disagree with this.  Species in biology\n&gt; &gt; are organisms that\n&gt; &gt; share genetic history.  Those organisms in separate\n&gt; &gt; species share less\n&gt; &gt; genetic history.  And the history is *genetic* and\n&gt; &gt; not phenotypic- and\n&gt; &gt; genetic history is exactly what historical markings\n&gt; &gt; measure.  If you\n&gt; &gt; give up on that, you are left with massive analytic\n&gt; &gt; problem of\n&gt; &gt; comparing phenotypic morphologies and\n&gt; &gt; functionalities that are wildly\n&gt; &gt; complex.  But why do that when we know genetic\n&gt; &gt; history?\n&gt; \n&gt; Hmm...I honestly hadn&#39;t thought about this much when I\n&gt; answered Colin&#39;s point.  I guess I was thinking about\n&gt; sex in the real world, and the fact that what\n&gt; determines whether two organisms can successfully mate\n&gt; is their phenotype, rather than their genotype (e.g.,\n&gt; a neutered dog is genetically compatible with a\n&gt; fertile one of the opposite sex, but its phenotypic,\n&gt; um, limitations, keep it from mating).\n&gt; \n&gt; That is, things that happen to phenotypes in their\n&gt; environment can lead to inabilities to actually mate. \n&gt; But maybe carrying this level of literalness into the\n&gt; GA domain is a bit too much.\n&gt; \n\nYes, and I&#39;m not really sure you can say it&#39;s their phenotype\nwhich really keeps it from mating.  After all, many animals\n*could* mate physically, but they choose not to.  I&#39;m not saying \nthey would have viable offspring, but they could at least\ngive it a try.  So it&#39;s more a &quot;decision&quot; they make not to \nmate.  (I realize of course the decision-making apparatus is also\npart of the phenotype.) But the NN&#39;s we are evolving right now are \nfar from being capable of &quot;deciding&quot; on their own whom to mate with,\nso something has to make the decision for them.\n\n&gt; But I don&#39;t know.  Basically, if you use an indirect\n&gt; encoding scheme, the resultant organism is a\n&gt; combination of genetic determinism and influences from\n&gt; the environment.  If you base their compatibility\n&gt; solely on their genetic similarities, aren&#39;t you\n&gt; ignoring the environmental influences on the\n&gt; development of an organism?  And isn&#39;t how an\n&gt; indirectly-encoded phenotype develops and performs\n&gt; important to determining its fitness and the extent to\n&gt; which it should reproduce?\n&gt; \n\nYou cannot mate two phenotypes unless you have a direct encoding. \nWhen people mate, it&#39;s their DNA that&#39;s recombining not their bodies.\nI&#39;m not sure where environmental influence comes into play.\nIf the DNA are not compatible, they won&#39;t produce an offspring\nregardless of the environment.  I suppose if their DNA is compatible\nthere could still be some kind of physical injury or pathology in\none of the organisms preventing mating, but this hardly seems\nimportant for artificial evolution.  So I don&#39;t think the environment\nis relevant here.  \n\nI agree that how something develops contributes to its fitness\nand the extent to which it should reproduce.  But the genome is what\ndetermines how it should develop!  And also, fitness is not the same\nas compatibility.  All humans (more or less) are compatible for\nmating, whether the least intelligent and most physically unfit, or\nthe geniuses with olympic potential.  They are all the same species.\nDNA doesn&#39;t care who&#39;s more fit when the mating happens.\n\n&gt; &gt; I also disagree with the idea that changing a gene\n&gt; &gt; in indirect\n&gt; &gt; encoding can have a huge impact on phenotype.  I\n&gt; &gt; think this is only\n&gt; &gt; true in a *bad* indirect encoding.  In a good\n&gt; &gt; indirect encoding, such\n&gt; &gt; as DNA, there is canalization, which means that it&#39;s\n&gt; &gt; difficult to get\n&gt; &gt; massive perturbations in phenotype from small\n&gt; &gt; changes in genotype.  \n&gt; \n&gt; Hmm...this is interesting.  How does this work in\n&gt; nature?  I&#39;m thinking, for example, of a millipede. \n&gt; Is it the case with the legs of a millipede that there\n&gt; is a strand of DNA that encodes for a single leg, that\n&gt; is then looped through to create all of the\n&gt; millipede&#39;s legs?  If so, then wouldn&#39;t a mutation\n&gt; that affects one leg then have a profound effect on\n&gt; the organism as a whole?\n&gt; \n\nIt would have an impact on all the legs, but the point is\nit would be a *small* impact.  It&#39;s not like a single\namino acid mutation is going to cause the millipede to suddenly\ngrow feet, or lose its legs entirely for that matter.  \nSingle gene mutations will tend to have very small incremental\neffects on morphology.\n\nHere&#39;s the important point:  Can you imagine a single amino acid\nmutation in a human that actually creates a new species!?  \nSure, there may be a few critical sections of DNA where getting\nsomething wrong actually hurts fitness, but that doesn&#39;t mean\nthe offspring is no longer human.  Human (and other animal)\ndevelopment is canalized against such extreme kinds of change.\n\nIn contrast, if you look at an indirect encoding like L-systems\nfor example, changing a single character in the string can\nhave massive impact, creating *unrecognizable* offspring.  I think\nthat&#39;s a pretty good sign that L-systems are not canalized like\nDNA, and that we have to develop better encodings.\n\n&gt; I don&#39;t claim to know much about this subject.  How is\n&gt; fault tolerance for indirect encoding handled by\n&gt; biological organisms?  You refer to this as\n&gt; &quot;canalization&quot;, and I do remember you talking about\n&gt; this in the artificial embryogeny paper, but I&#39;m not\n&gt; sure I understand the concept well.\n&gt; \n\nAs you mentioned, (for other people in the group if they\nare interested) take a look at the Canalization section \n(section 3.4) of our Taxonomy paper to see the details.\nI mentioned 3 things in that paper that can lead to canalization:\nStochasticity, Resource Allocation, and Overproduction.  \nThere are probably more.  Note most indirect encodings today\nhave none of these features and display no sign of canalization.\nEvolution also plays a role over the long term: it will \ncanalize its forms simply because that makes them more like to\nproduce viable offspring.   Vageuly speaking, what happens is that \ndevelopment develops a kind of redundancy, in which if one path\nis shifted, another one can pick up the slack.  \n\n&gt; &gt; In\n&gt; &gt; other words, the system is more or less robust to\n&gt; &gt; change on the macro\n&gt; &gt; level.  It is important not to confuse current\n&gt; &gt; primitive indirect\n&gt; &gt; encodings with the potentially powerful indirect\n&gt; &gt; encodings we will\n&gt; &gt; ultimately use.  An encoding where flipping a bit\n&gt; &gt; can result in an\n&gt; &gt; unrecognizable phenotypic mutant is terribly\n&gt; &gt; brittle, and should not\n&gt; &gt; be the basis of our intuitions about\n&gt; &gt; complexification or speciation.\n&gt; \n&gt; Again, I&#39;m wondering about how biological organisms\n&gt; attain this robustness.  Surely in the case of\n&gt; structures (such as blood cells) that are produced\n&gt; millions of times over, there is encoding for a single\n&gt; blood cell.  And if a mutation occurs in that genetic\n&gt; material, how is it not going to result in massive\n&gt; perturbations in the phenotype?\n&gt; \n\nBut are you suggesting that the new phenotypes would no\nlonger be human?  Because remember we are talking about\nspeciation here.  And anyway, things aren&#39;t as simple\nas a one-to-one mapping in an indirect encoding, so a mutation\nin the code itself does not necessarily lead to an unrecognizable\nblood cell.  Perhaps slightly altered, but it may be better,\nit may be worse, and it is likely not something entirely novel.\nAlso canalization means different parts of the system can\npick up slack when other parts are altered.  So even if the\nblood cell type alters slightly, the parts the blood cells interact\nwith may themselves be flexible in those interactions, such that\nthey can deal with a slightly altered counterpart.  It&#39;s as if your\nhouse keys could remold themselves slightly on their own.  Then if\nI changed the locks on your doors, your keys would still work as\nlong as the change wasn&#39;t too dramatic and still bore some resemblance\nto the earlier configuration.\n\nI think the really important point here though is that you aren&#39;t\ngoing to get something that isn&#39;t human by changing a single gene.\nAnd that&#39;s what matters for speciation: small changes in the genotypes\ndon&#39;t lead to new species.  \n\nMainly your examples have been about *damage* to the phenotype.  And\nconsider that a damaged phenotypes is not a new species at all, but\nrather just a weaker version of the same.  Try to imagine a\nnon-damaging small genetic mutation that actually can lead immediately\nto an entirely new species.  To me it&#39;s inconceivable; it is clear\nthat evolution requires the accumulation of many many mutations over\nmany generations to get an entirely new character.\n\n&gt; &gt; I do agree, it is still aquestion whether N should\n&gt; &gt; be used or not in\n&gt; &gt; any encoding, whether direct or indirect.  I believe\n&gt; &gt; I&#39;ve heard that\n&gt; &gt; monkeys have 99% of the genetic history as humans. \n&gt; &gt; Assuming this is\n&gt; &gt; true, if we were normalizing for genome size, I\n&gt; &gt; think we&#39;d conclude\n&gt; &gt; that monkeys and people were in the same species!\n&gt; \n&gt; Well, you probably could, with a little tweaking, get\n&gt; a viable embryo that&#39;s a result of chimp and human DNA\n&gt; (this may not be far off in the future).  I think this\n&gt; will tend to blur the line of what a true biological\n&gt; species is (which is already somewhat fuzzy).\n&gt; \n\nI think this just emphasizes the fact that speciation is\nnot an exact science and just needs to be &quot;good enough.&quot;\nMaybe chimps could mate with people, but the fact that they\ndon&#39;t isn&#39;t devastating.  So I think that a lot of our\nconcern is not going to have massive impact.  It&#39;s not\nexactly &quot;where you draw the line&quot; that matters, but that\nyou do draw it somewhere and with some regularity.\n\n&gt; &gt; The issue behind the best way to use N (perhaps some\n&gt; &gt; nonlinear\n&gt; &gt; formula), if at all, is certainly an open question. \n&gt; &gt; But I don&#39;t think\n&gt; &gt; there is any future in comparing phenotypes instead\n&gt; &gt; of genotypes.\n&gt; \n&gt; I&#39;m not entirely sold, but I&#39;ll admit that it is a\n&gt; very interesting question. :)\n&gt; \n\nHere my big concern:  If you really propose to compare\nphenotypes for speciation, you are back to the competing\nconventions problem with different topologies \nthat NEAT solves.  We are literally back at square one.\nCan you imagine the kind of graph theory analysis necessary\nto establish that two morphologies are the same species?\nIt isn&#39;t even about macro-level similarity.  A human with\nno arms or legs is still human.  It would be mind boggling\nto come up with a formula that captures the intrinsic nature\nof &quot;human-ness&quot; from the phenotype.  On the other hand, the\ngenotype is completely sufficient: we all share a certain level\nof genetic similarity.  And with historical marking that\nlevel is wholly apparent.  So I don&#39;t want to go down the\nwrong path here back to the problems we started with.\n\nWell, I really went on a long time here, but hopefully it helps\nclarify my position and contributes to people&#39;s thoughts on\nthe matter, which I think will be important in the future.\n\nken\n\n\n"}}