{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[{"name":"READ"}]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"userId":54567749,"authorName":"Kenneth Stanley","from":"&quot;Kenneth Stanley&quot; &lt;kstanley@...&gt;","profile":"kenstanley01","replyTo":"LIST","senderId":"peVKkPuoggEhp_9TWkfCg5XS0qBra08yocl-rpzBuVXy_8GvcE4us6FZ7Xr38afaKH2gCrcwPxVLuW2pvK__SVQ5_rokwdgrcMQiTOQkWCbM","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: Patents and suchlike...","postDate":"1128648117","msgId":2323,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGRpNGlqbCtzMGVmQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDYuMi4zLjQuMC4yMDA1MTAwNjEwMjQyOC4wMzM0ZTcxOEBwb3AubWFpbC55YWhvby5jby51az4="},"prevInTopic":2322,"nextInTopic":2324,"prevInTime":2322,"nextInTime":2324,"topicId":2292,"numMessagesInTopic":11,"msgSnippet":"Ian, First (for those who haven t been following) rtNEAT is the only thing under patent and NEAT is *not* patented.  NEAT is completely in the public domain","rawEmail":"Return-Path: &lt;kstanley@...&gt;\r\nX-Sender: kstanley@...\r\nX-Apparently-To: neat@yahoogroups.com\r\nReceived: (qmail 59317 invoked from network); 7 Oct 2005 01:22:32 -0000\r\nReceived: from unknown (66.218.66.167)\n  by m28.grp.scd.yahoo.com with QMQP; 7 Oct 2005 01:22:32 -0000\r\nReceived: from unknown (HELO n10a.bulk.scd.yahoo.com) (66.94.237.44)\n  by mta6.grp.scd.yahoo.com with SMTP; 7 Oct 2005 01:22:32 -0000\r\nComment: DomainKeys? See http://antispam.yahoo.com/domainkeys\r\nReceived: from [66.218.66.58] by n10.bulk.scd.yahoo.com with NNFMP; 07 Oct 2005 01:22:02 -0000\r\nReceived: from [66.218.66.77] by mailer7.bulk.scd.yahoo.com with NNFMP; 07 Oct 2005 01:22:01 -0000\r\nDate: Fri, 07 Oct 2005 01:21:57 -0000\r\nTo: neat@yahoogroups.com\r\nMessage-ID: &lt;di4ijl+s0ef@...&gt;\r\nIn-Reply-To: &lt;6.2.3.4.0.20051006102428.0334e718@...&gt;\r\nUser-Agent: eGroups-EW/0.82\r\nMIME-Version: 1.0\r\nContent-Type: text/plain; charset=ISO-8859-1\r\nContent-Length: 11974\r\nX-Mailer: Yahoo Groups Message Poster\r\nX-Yahoo-Newman-Property: groups-compose\r\nX-eGroups-Msg-Info: 1:12:0:0\r\nFrom: &quot;Kenneth Stanley&quot; &lt;kstanley@...&gt;\r\nSubject: Re: Patents and suchlike...\r\nX-Yahoo-Group-Post: member; u=54567749; y=8kmmB0j4ubvmL0h0-Chw2g-Ttuc7IR48sAJPCZjKjIp7KrnrAAwO\r\nX-Yahoo-Profile: kenstanley01\r\n\r\nIan, \n\nFirst (for those who haven&#39;t been following) rtNEAT is the only \nthing under patent and NEAT is *not* patented.  NEAT is completely \nin the public domain and you can go make money off of it without \nspeaking to anyone.\n\nThe patent coverage for rtNEAT is I believe international.  We \npurposefully filed the provisional protection (long before the \npatent) in a way that secured international rights.  \n\nNow you are asking about what exactly is patented.  A patent is a \nvery complicated legal document, more like a computer program than a \nresearch paper.  You can think of it almost like a series of \nvariable declarations in different scopes.  The claims the patent \nmakes at the highest scope are more broad, and then there are more \nnarrow scopes for other claims, and there are some cases where \nparallel (i.e. independet) claims are made.  Therefore, the patent \ndoes not just cover a single concept, but rather a hierarchical and \nparallel set of ideas.  But the patent definitely concentrates on \nwhat is *not* obvious.  That you can be assured of.  The patent \noffice will not accept &quot;common knowledge,&quot; which includes things \nthat are obvious.  So it is the non-obvious aspects of rtNEAT that \nare really covered.\n\nLet&#39;s be realistic here before I go into what&#39;s obvious and what&#39;s \nnot.  Law always boils down to interpretation, in my opinion.  I \nknow people hate this fact, and everyone pounds their fists and \ndemands the most objective explanation, but everything from \nconstitutions to patents ultimately boils down to interpretation.  \nThat means you and I can disagree about what&#39;s obvious, and a judge \nwill decide.  We hope the people who enforce the law are fair-\nminded, and that&#39;s the best we can hope for.  That is, if something \nis truly obvious, they won&#39;t let someone get away with owning it.\nBut this is an imperfect world and there have been some terrible \nabuses of patent authority, such as certain software companies \nclaiming to have their patents infringed by Linux, even though they \ndid virtually nothing to bring Linux to fruition.  Still, we hope \nthose companies will lose in the end, and the system will end up \nworking.\n\nThat said, I&#39;ll tell you what I think is obvious not obvious in \nrtNEAT.  You are right that &quot;continuous evolution&quot; is pretty \nobvious.  In fact broad ideas are frequently obvious.  Therefore, \nhaving a broad idea is not a very firm ground for feeling slighted \nby someone else getting a patent related to your idea.  For example, \nI thought of &quot;time travel&quot; as a good idea.  But should I have some \nclaim on it if someone actually goes and implements it?  Of course \nnot, and the same goes with &quot;continuous evolution.&quot;  Therefore, \nbroad ideas are generally not what is being patented, and shouldn&#39;t \nbe.\n\nYou brought up some other putatively obvious thing:\n\n1 &gt; - replacing one unfit individual at a time\n2 &gt; - picking fit parents\n3 &gt; - minimum life if required\n\nI&#39;d agree 1 and 2 are obvious.  In fact, #1 is called &quot;steady state \nevolution,&quot; and also is used in a 1,1-ES (evolution strategy), all \npredating rtNEAT.  This idea is certainly not under anyone&#39;s \ncontrol.  However, the steady state idea is a lot simpler than the \npoint of rtNEAT.  Steady state methods do not general evaluate an \nentire population simulataneously and *asynchronously* as you would \nin a video game.  So really the term &quot;continuous evolution&quot; is \nambiguous.  It could mean different things.  It doesn&#39;t really mean \nanything in particular. \n\n#2 is certainly obvious in any EA.  But the whole question is how?  \nThat is not necessarily obvious.  #3 may or may not be obvious, but \nit&#39;s obvious enough that it is not what we&#39;re patenting.\n\nNow let me tell you some things that aren&#39;t obvious.  First, how do \nyou pick the one to remove?  Clearly that is not obvious since that \nwas one of your questions recently.  And our answer, removing the \none with lowest adjust fitness, is part of the patent.  If you \nadjust fitness according to a diversity scheme and then use those \nadjustments to pick the worst one for removal in the context of a \nreal-time EA, you are getting towards overlapping with our patent.\n\nOther things that are not obvious:  How do you maintain a steady # \nof species in real time?  How do you choose the # ticks between \nreplacements (we came up with a very nice equation for this)?  How \ndo you assign offspring to species in an equivalent dynamic to \nregular NEAT even though NEAT&#39;s fitness sharing equations are based \non generations?\n\nThese are all covered by the patent.  \n\nNow of course it can be argued that any of these is obvious to you.  \nThat&#39;s where we get into interpretation.  But let me just finish by \ngiving some of my own subjective opinion on why that doesn&#39;t \nmatter.  In my opinion, &quot;not obvious&quot; does *not* mean that &quot;no one \ncould have thought of it if they had tried to do the same thing.&quot;\nProbably a lot of people would come to similar conclusions if they&#39;d \ntried to do something like NERO.  That is, what &quot;not obvious&quot; means \nis that you wouldn&#39;t necessarily think of it unless you put in the \ntrouble to actually implement the system.\n\nAnd that is as it should be.  The whole point of patents is not to \nreward flashes of ingenious insight, but rather to reward the people \nwho put in the hard work figure out how to make some theoretical \nconcept (or broad concept) in someone&#39;s head actually work.  As you \nsay, the devil is in the details.  And I can tell you that while you \ncan try to take any one piece of rtNEAT and say, &quot;Hey, I would have \nthought of that,&quot; if you take the whole combination of components, \nit took a year of hard work to figure out all the dependencies and \nget something that actually works.  It&#39;s one thing to talk in \ntheory, but it&#39;s no trivial matter to set up a real-time evolution \nsystem in the form of NEAT inside a video game.  There&#39;s a reason \nthere has not been a NERO before- and it&#39;s not that it&#39;s impossible- \nit&#39;s that it takes a hell of a lot of work to get all the details \nright.\n\nAnd that&#39;s exactly what we have memorialized in the patent, so now \nno one has to go through that again.  And that&#39;s really the spirit \nof what patents are for and how they should work:  They should \nprotect the little guy who just spent years of his or her life \nmaking a working embodiment so that the little guy can&#39;t be taken \nadvantage of.  It&#39;s the working embodiment that creates the value \nfor society rather than just the idea alone.  The working embodiment \nnot only shows &quot;how&quot; to do it, but it also shows that it has real \nvalue.  It&#39;s not that someone else couldn&#39;t have done it; it&#39;s that \nthose who actually *did* do it deserve to get something for making \nthat contribution to society.  Remember, patents are only temporary \nanyway.  In the long run, we all benefit freely from all patents.\n\nThere is another aspect of your concern which has to do with small \ndetail-oriented ideas like &quot;arbitrary labels.&quot;  And that also \ntouches on my point above.  Ok, so a number of people may have \nthought of arbitrary labels, but I don&#39;t think anyone should be \nupset if someone else actually goes through the years of painstaking \nlabor to prove that arbitrary labels in fact work and are worth \nmillions of dollars to society.  After all, I could have done that \nmyself, but I chose not to.  And now this other person will benefit \nfrom an idea I may have had.  But that&#39;s the point:  The idea is \nhardly a stroke of genius; what&#39;s important is the hard work to \nactually show it has real practical value!  That&#39;s what a patent \nshould be rewarding.\n\nBut a connected point is that with something detail-oriented like \narbitrary labels, such an accomplishment is unlikely to materialize \nbecause they probably *don&#39;t* accomplish anything that is all that \nvaluable.  In other words, whatever arbitrary labels do, something \nelse can probably do more or less just as well.  That is, they won&#39;t \nbe making anyone millions of dollars anytime soon.  And if they \nwould, then we should be thankful for the person who shows us how, \nbecause *that* certainly isn&#39;t obvious.\n\nOne last point:  Since I am on the rtNEAT patent, I am probably \ngoing to be the one who would advise anyone to prosecute patent \ninfringement.  In other words, I&#39;m not going to mess with people who \nare going about their business doing truly independent things.  You \nguys know me pretty well and I am for the free exchange of ideas and \nalso for people building on each other&#39;s creations, and I am not \ninterested in becoming a patent factory that makes money of off \nfrivolous infringement lawsuits.\n\nSo I hope that I haven&#39;t wasted too much time writing virtually an \nessay on the point, but it should clarify some of both what is \npatented in the case of rtNEAT, and what patenting is about in \ngeneral.  The parts that are my opinion are developed over a very \nlong patent process and many discussions with the rtNEAT patent \nlawyer, as well as from seeing how dangerous the world is for an \ninventor in general through first-hand experience.\n\nAs I said before, nothing should stop the free flow of ideas.  \nrtNEAT and *any* university-owned property is always free for \nresearch purposes, and no one here can steal any implementation that \nyou disclose on the group, since there would then be evidence that \nit was your idea after all.  In some cases someone may take a broad \nidea and run with it, but as we seem to agree, broad ideas are \nusually obvious anyway, and it&#39;s not usually the broad idea itself \nthat is valuable, but rather the embodiment that makes it work.\n\nken\n\n--- In neat@yahoogroups.com, Ian Badcoe &lt;ian_badcoe@y...&gt; wrote:\n&gt; Hi Ken,\n&gt; \n&gt; \tLike I said, I completely understand that you and even the \n&gt; university have reasons, even pressing reasons, to raise the \n&gt; patent.  As you say, it can be necessary just to protect against \n&gt; other people doing it.\n&gt; \n&gt; \tI think my problem might be one of the difference between \nbroad \n&gt; concepts and fine details.\n&gt; \n&gt; \te.g. the broad concept of continuous NEAT is to my mind \nobvious.  In \n&gt; fact, I think about the third thing I thought when I first read \nyour \n&gt; paper (after &quot;now how does this work?&quot; and &quot;that is clever!&quot;) \nwas &quot;if \n&gt; I did this, I would do it continuously&quot;.\n&gt; \n&gt; \tAnd many of the ideas involved in doing that, are very \nobvious and \n&gt; also not specific to NEAT:\n&gt; \n&gt; - replacing one unfit individual at a time\n&gt; - picking fit parents\n&gt; - minimum life if required\n&gt; \n&gt; \tSo I would be very uncomfortable if the patent tried to \ncover any of \n&gt; these basic concepts.\n&gt; \n&gt; \tOTOH, the devil is in the details, and so also is the hard \nwork and \n&gt; the place where a person&#39;s talents most show.  So I would never \nwish \n&gt; to stop you protecting your investment in that.\n&gt; \n&gt; --\n&gt; \n&gt; \tThe other side of this is that not everything discussed is \nclearly \n&gt; property of one or other individual....\n&gt; \n&gt; \te.g. arbitrary labels, I invented those!  I distinctly \nremember it \n&gt; was about 10 years ago and I wanted them for GP at the time....\n&gt; \n&gt; \tEqually, I completely believe Colin used a version of them \nin one of \n&gt; his old projects...\n&gt; \n&gt; \tAnd that you (Ken) came up with them in the context you were \n&gt; describing yesterday...\n&gt; \n&gt; \tSo, until about 2 months ago all three of us genuinely \nbelieved we \n&gt; had a novel, unique and useful invention there.  And either one of \nus \n&gt; might have patented it, to the horror of the others....\n&gt; \n&gt; \t...but that&#39;s to do with the nature of patent and nothing we \ncan control :)\n&gt; \n&gt; --\n&gt; \n&gt; \tAnyway, you have clarified the situation a lot an reassured \nme \n&gt; somewhat, but can you briefly tell us what is and isn&#39;t covered by \nthe patent?\n&gt; \n&gt; \tIs this patent only in the US?\n&gt; \n&gt; \tIan\n&gt; \n&gt; In fifteen minutes, everybody will be in the future.\n&gt; \n&gt; \n&gt; \n&gt; \t\n&gt; \t\n&gt; \t\t\n&gt; ___________________________________________________________ \n&gt; Yahoo! Messenger - NEW crystal clear PC to PC calling worldwide \nwith voicemail http://uk.messenger.yahoo.com\n\n\n\n"}}