{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[{"name":"READ"}]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"userId":54567749,"authorName":"Kenneth Stanley","from":"&quot;Kenneth Stanley&quot; &lt;kstanley@...&gt;","profile":"kenstanley01","replyTo":"LIST","senderId":"Ij2BWi4zoUdVmkKl3t8mK030zCI0dzn1GrCzbp7pExnkMXTfrK3DqDNFjZo_teIouQak0swyGU1ACCZGCGjsM8BxvNpn33vyY7Qf3a2dV4Pe","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: Speciation Compatibility Threshold Equation","postDate":"1070326907","msgId":236,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGJxZ285cyt0NTJmQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDIwMDMxMTMwMTgwNjQ1LjM1MzE0LnFtYWlsQHdlYjYwNTA2Lm1haWwueWFob28uY29tPg=="},"prevInTopic":234,"nextInTopic":240,"prevInTime":235,"nextInTime":237,"topicId":134,"numMessagesInTopic":37,"msgSnippet":"... Good question.  It could be the same, but it isn t necessarily because although normalizing for genome size is effectively dynamic, it is not necessarily ","rawEmail":"Return-Path: &lt;kstanley@...&gt;\r\nX-Sender: kstanley@...\r\nX-Apparently-To: neat@yahoogroups.com\r\nReceived: (qmail 12278 invoked from network); 2 Dec 2003 01:01:54 -0000\r\nReceived: from unknown (66.218.66.166)\n  by m13.grp.scd.yahoo.com with QMQP; 2 Dec 2003 01:01:54 -0000\r\nReceived: from unknown (HELO n25.grp.scd.yahoo.com) (66.218.66.81)\n  by mta5.grp.scd.yahoo.com with SMTP; 2 Dec 2003 01:01:49 -0000\r\nReceived: from [66.218.67.250] by n25.grp.scd.yahoo.com with NNFMP; 02 Dec 2003 01:01:48 -0000\r\nDate: Tue, 02 Dec 2003 01:01:47 -0000\r\nTo: neat@yahoogroups.com\r\nSubject: Re: Speciation Compatibility Threshold Equation\r\nMessage-ID: &lt;bqgo9s+t52f@...&gt;\r\nIn-Reply-To: &lt;20031130180645.35314.qmail@...&gt;\r\nUser-Agent: eGroups-EW/0.82\r\nMIME-Version: 1.0\r\nContent-Type: text/plain; charset=ISO-8859-1\r\nContent-Length: 14302\r\nX-Mailer: Yahoo Groups Message Poster\r\nX-eGroups-Remote-IP: 66.218.66.81\r\nFrom: &quot;Kenneth Stanley&quot; &lt;kstanley@...&gt;\r\nX-Yahoo-Group-Post: member; u=54567749\r\nX-Yahoo-Profile: kenstanley01\r\n\r\n--- In neat@yahoogroups.com, Derek James &lt;blue5432@y...&gt; wrote:\n\n&gt; \n&gt; &gt; Yes true I agree.  But there is a number under which\n&gt; &gt; I think realtive size is less important.  I just\n&gt; &gt; don&#39;t\n&gt; &gt; know what that number is.\n&gt; \n&gt; Yes, you&#39;re probably right that there is a number\n&gt; under which relative size isn&#39;t that important.  20\n&gt; was your cutoff point in your original NEAT paper,\n&gt; which sounds reasonable to me.\n&gt; \n&gt; You said that in your robot duel experiments, genomes\n&gt; grew to 200-300 genes, and you still had N set to 1. \n&gt; But you also said that you were using a dynamic\n&gt; speciation threshold, right?  So the compatibility\n&gt; threshold fluctuated, probably between 3.0 and some\n&gt; larger values.  This essentially has the same\n&gt; practical effect of normalizing for chromosome size,\n&gt; doesn&#39;t it?  It&#39;s a way of comparing the difference in\n&gt; two individuals relative to the size of the\n&gt; chromosomes (as well as keeping the number of species\n&gt; stable).  \n&gt; \n\nGood question.  It could be the same, but it isn&#39;t \nnecessarily because although normalizing for genome\nsize is effectively dynamic, it is not necessarily\nthe same dynamic as moving the compatibility threshold\naround.  Also something to keep in mind is that\nit will be problem-dependent.  So you can&#39;t necessarily\ngeneralize from a single result.\n\n&gt; &gt; But the NN&#39;s we are evolving\n&gt; &gt; right now are \n&gt; &gt; far from being capable of &quot;deciding&quot; on their own\n&gt; &gt; whom to mate with,\n&gt; &gt; so something has to make the decision for them.\n&gt; \n&gt; I wasn&#39;t really talking about sexual selection.  What\n&gt; I was getting at is that often in nature, two\n&gt; individuals are genetically compatible, but\n&gt; phenotypically incompatible.\n&gt; \n&gt; For example, until most organisms reach some sort of\n&gt; developmental maturity, they are incapable of\n&gt; reproducing (this goes not only for\n&gt; sexually-reproducing organisms, but many\n&gt; asexually-reproducing ones).\n&gt; \n&gt; Two infants of a given species may be incapable of\n&gt; physically reproducing, even though they are\n&gt; genetically compatible.\n&gt; \n&gt; Many organisms do not end up reproducing because of\n&gt; developmental problems.  Their genotype hasn&#39;t\n&gt; properly encoded for an organism that is able to\n&gt; develop to the point of reproductive viability.\n&gt; \n&gt; Should an indirectly-encoded GA that includes some\n&gt; sort of developmental stage for phenotypes not also\n&gt; have similar standards for reproduction?  That is, if\n&gt; a genotype cannot encode for an individual that\n&gt; develops into a mature, functioning phenotype, should\n&gt; it be allowed to reproduce?\n\nBut for many years to come no one is going to try to\nliterally simulate gonadal development, unless for \nobscure reasons.  What I&#39;m saying is, indirect encodings\naren&#39;t so literally following biology as to actually\nencode testicles and ovaries, and the actual act of\nsex itself.  I suppose they could but what would be the\npoint?  It only adds unnecessary complexity to the search.\n\nMore importantly, if a phenotypes doesn&#39;t develop properly\nit won&#39;t be chosen to reproduce anyway since it&#39;s fitness\nwill be so low.  I don&#39;t see any problem there.  I mean,\nwe don&#39;t need to do any compatibility checking to see\nthat an organism is a failute.  It&#39;s a separate issue.\n\n&gt; \n&gt; &gt; You cannot mate two phenotypes unless you have a\n&gt; &gt; direct encoding. \n&gt; &gt; When people mate, it&#39;s their DNA that&#39;s recombining\n&gt; &gt; not their bodies.\n&gt; &gt; I&#39;m not sure where environmental influence comes\n&gt; &gt; into play.\n&gt; &gt; If the DNA are not compatible, they won&#39;t produce an\n&gt; &gt; offspring\n&gt; &gt; regardless of the environment.  I suppose if their\n&gt; &gt; DNA is compatible\n&gt; &gt; there could still be some kind of physical injury or\n&gt; &gt; pathology in\n&gt; &gt; one of the organisms preventing mating, but this\n&gt; &gt; hardly seems\n&gt; &gt; important for artificial evolution.  So I don&#39;t\n&gt; &gt; think the environment\n&gt; &gt; is relevant here.  \n&gt; \n&gt; Well, that&#39;s what I was getting at above.  It&#39;s not\n&gt; just pathology or injury that keeps phenotypes from\n&gt; mating, but also their stage of development.  And the\n&gt; development is dependent upon the environment.\n&gt; \n&gt; Is this important in artificial evolution?  I don&#39;t\n&gt; know.  But it&#39;s extremely important in natural\n&gt; evolution (e.g., a significant percentage of\n&gt; phenotypes never make it beyond the very first\n&gt; developmental stages).  Many genotypes are selected\n&gt; against based on their inability to construct viable\n&gt; phenotypes.\n&gt; \n&gt; So far, our evolutionary models are not very rich. \n&gt; There aren&#39;t many EAs that employ the sort of\n&gt; artificial embryogeny that you wrote about.  But as\n&gt; the models do become more complex, maybe some of these\n&gt; concepts from natural evolution (such as embryonic\n&gt; viability) will become more important.\n&gt; \n\nSure that makes sense but I think we&#39;re conflating\ntwo issues here: Fitness and compatibility.  My argument \nwas that compatibility checks should be done on genotype\nonly.  You are now saying that phenotypic development\nhas an important effect on fitness.  These two points\nare not in conflict.  They are just talking about different\nthings.  I still say if you check compatibility, you\nshould use the genotype.\n\n&gt; &gt; I agree that how something develops contributes to\n&gt; &gt; its fitness\n&gt; &gt; and the extent to which it should reproduce.  But\n&gt; &gt; the genome is what\n&gt; &gt; determines how it should develop!  \n&gt; \n&gt; That, and its environment, right?  You&#39;re not saying\n&gt; that the genome is the *only* thing that determines\n&gt; development, are you?\n&gt; \n\nNo, I think we agree here.  I just don&#39;t see the \ntie-in with compatibility checking.\n\n&gt; &gt; All humans (more or less) are\n&gt; &gt; compatible for\n&gt; &gt; mating, whether the least intelligent and most\n&gt; &gt; physically unfit, or\n&gt; &gt; the geniuses with olympic potential.  They are all\n&gt; &gt; the same species.\n&gt; &gt; DNA doesn&#39;t care who&#39;s more fit when the mating\n&gt; &gt; happens.\n&gt; \n&gt; Well, humans that are of a particular sexual\n&gt; development.  Humans that have not reached puberty are\n&gt; incapable of mating, as are women who reach menopause,\n&gt; and of course all those phenotypes that are sterile or\n&gt; impotent for one reason or another.\n&gt; \n&gt; In principle, you&#39;re right.  But part of the beauty of\n&gt; the way NEAT handles compatibility is also a problem. \n&gt; Basically, *any* two individuals are inherently\n&gt; capable of reproducing in NEAT.  We&#39;re forcing\n&gt; somewhat arbitrary decisions about which reproductive\n&gt; groups to fence off, based on differences in their\n&gt; genotypes.\n&gt; \n&gt; In NEAT, from a reproductive standpoint, all genotypes\n&gt; are theoretically compatible.  It is only the\n&gt; speciation compatibility threshold that determines who\n&gt; gets to mate with whom.  In nature, it&#39;s not an\n&gt; analysis of genetic compatibility that decides whether\n&gt; or not a butterfly can mate with a goat.  \n&gt; \n\nI don&#39;t see this as a problem.  In principle, anything\nin nature could be theoretically mated as well.  We\ncould line up the genes based on the best possible \nanalysis and then construct a new genome based on the\nhybrid.  But usually hybrids between different species \nwould have very low fitness (more likely no fitness at \nall).  The point is, where nature draws the line is \nitself arbitrary in the sense that it is just a side\neffect of a conglomeration of complex and happenstance \nfactors that causes species to avoid each other.  They\n*could* have mated, and perhaps 1 out of 1,000 of such\nmatings might create something interesting.  What I&#39;m\nreally saying is we should be careful not to personify\nnature as being  *objective*.  Nature&#39;s speciation is\npotentially not optimal either.  \n\nSo as you said, any two individual are theoretically\ncapable of mating in NEAT, but it&#39;s also true in nature.\nBut in both cases, more often than not, it will be \na mess.  So I don&#39;t see any disanalogy.  The only \ndifference is in how the line between species is \nenforced.  In one case, we decide it based on analysis,\nand in the other, it is a side-effect of physical \nmorphology.  But physical morphology is a proxy for\ngenetic compatibility.  In fact it is likely worse\nsince it&#39;s only an estimate!  Nature doesn&#39;t have access \nto historical data on genes so it has to do its best with w\nhat it has.  \n\n&gt; &gt; Here&#39;s the important point:  Can you imagine a\n&gt; &gt; single amino acid\n&gt; &gt; mutation in a human that actually creates a new\n&gt; &gt; species!? \n&gt; \n&gt; What you&#39;re basically saying (if I&#39;m hearing you\n&gt; right) is that nature favors mutations that\n&gt; individually do not have a significant impact on the\n&gt; development of the phenotype, as opposed to the\n&gt; &quot;hopeful monster&quot; hypothesis (that drastic mutations\n&gt; can sometimes provide larger jumps in evolution).  As\n&gt; far as I know, this issue is still debated among\n&gt; evolutionary biologists.\n&gt; \n&gt; The late Stephen J. Gould was a proponent of the idea\n&gt; that macromutations led to drastic changes in\n&gt; morphology by affecting the genes that controlled\n&gt; embryonic development.  I&#39;m not saying I agree with\n&gt; Gould.  I&#39;m just saying that the issue isn&#39;t\n&gt; necessarily a clear-cut one.  \n&gt; \n\nI guess there is some room for debate.  But I doubt\nany biologist thinks a single amino acid mutation can\ncreate a new species that is both fit and genetically\nincompatible with humans.\n\nOn the other hand, I&#39;m sure there are some rare small\nmutations that can totally screw up the phenotype, but\nthat&#39;s not the same as getting a new species: that&#39;s\njust a broken fetus.\n\n&gt; If I&#39;m hearing you right, though, the idea of\n&gt; canalization is that mutations never have a drastic\n&gt; impact on the phenotype, no matter whether the gene\n&gt; they affect encodes for a single trait or is copied\n&gt; millions of times over to produce the resulting\n&gt; phenotype.  In the case of neuroevolution, this would\n&gt; seem to argue for very low mutation rates, wouldn&#39;t\n&gt; it?  Especially with indirect encoding schemes.\n&gt;  \n\nI&#39;m not sure.  If the phenotypoe is tolerant to mutation\nwhy not experiment with high mutation rates since it\nlikely won&#39;t screw anything up?  But I think the question\nis open and a good question.\n\n&gt; &gt; In contrast, if you look at an indirect encoding\n&gt; &gt; like L-systems\n&gt; &gt; for example, changing a single character in the\n&gt; &gt; string can\n&gt; &gt; have massive impact, creating *unrecognizable*\n&gt; &gt; offspring.  I think\n&gt; &gt; that&#39;s a pretty good sign that L-systems are not\n&gt; &gt; canalized like\n&gt; &gt; DNA, and that we have to develop better encodings.\n&gt; \n&gt; I haven&#39;t ever taken a embryology class, though I&#39;m\n&gt; interested to know the average rate of fatal\n&gt; mutations.  I know that there is a significant rate of\n&gt; miscarriages among humans (many are not even noticed),\n&gt; and I wonder to what extent this is caused by\n&gt; mutations that adversely affect development. \n&gt; Basically, I&#39;m interested to know just how robust DNA\n&gt; is.\n&gt; \n\nI looked into this once.  Miscarriages are not all caused\nby mutations, but those that are I believe are small\npercentage, but still they do exist.  But what does this\nhave to do with genetic compatibility?  The miscarriages\naren&#39;t a new species.  They&#39;re just a nonfunctioning\nsystem.  Their genomes are still &quot;human&quot;.\n\n&gt;   \n&gt; &gt; Also canalization means different parts of the\n&gt; &gt; system can\n&gt; &gt; pick up slack when other parts are altered.  So even\n&gt; &gt; if the\n&gt; &gt; blood cell type alters slightly, the parts the blood\n&gt; &gt; cells interact\n&gt; &gt; with may themselves be flexible in those\n&gt; &gt; interactions, such that\n&gt; &gt; they can deal with a slightly altered counterpart.\n&gt; \n&gt; Okay, well that makes sense.  It seems to me that with\n&gt; neuroevolution, we&#39;re dealing with an inherently\n&gt; robust phenotype, wouldn&#39;t you say?  That is, if we\n&gt; were using NEAT to produce evolvable hardware (say, a\n&gt; walking machine), that sort of phenotype may be more\n&gt; brittle, in terms of the effects of new mutations on\n&gt; an individual&#39;s fitness.\n&gt; \n\nTrue, which is all the more reason we eventually need\nto get to indirect encodings.  Definitely though\nsome domains are far more brittle than others.  \n\n\n&gt; &gt; It&#39;s not exactly &quot;where you draw the line&quot; that \n&gt; &gt; matters, but that\n&gt; &gt; you do draw it somewhere and with some regularity.\n&gt; \n&gt; Well, I think it is an interesting question of how\n&gt; &quot;where you draw the line&quot; affects evolution.\n&gt; \n\nI agree.  It&#39;s will be interesting to experiment with\ndifferent methods.  I don&#39;t mean to imply we shouldn&#39;t\nexplore the way we compute thresholds and normalize for\ncompatibility.  All I am saying is that these computations\nshould be genotype-based.\n\n&gt; &gt; Here my big concern:  If you really propose to\n&gt; &gt; compare\n&gt; &gt; phenotypes for speciation, you are back to the\n&gt; &gt; competing\n&gt; &gt; conventions problem with different topologies \n&gt; &gt; that NEAT solves.  We are literally back at square\n&gt; &gt; one.\n&gt; &gt; Can you imagine the kind of graph theory analysis\n&gt; &gt; necessary\n&gt; &gt; to establish that two morphologies are the same\n&gt; &gt; species?\n&gt; &gt; It isn&#39;t even about macro-level similarity.  A human\n&gt; &gt; with\n&gt; &gt; no arms or legs is still human.  \n&gt; \n&gt; But a human with no reproductive organs cannot\n&gt; reproduce, even though it may be\n&gt; genetically-compatible with other humans.\n&gt; \n&gt; I&#39;m not proposing reproductive organs for our neural\n&gt; nets, though this is very much how nature determines\n&gt; whether or not individuals can reproduce (and with\n&gt; whom).  Very far down the line, the way artificial\n&gt; organisms are divided into reproductive populations\n&gt; may be based on the way natural species are divided,\n&gt; and not by an algorithm that determines genetic\n&gt; compatibility.  But I&#39;d concede that it is a much more\n&gt; efficient, much more likely paradigm for the near\n&gt; future.\n&gt; \n\nYes I follow you...way down the line maybe we can\nsimulate the whole deal, down to the cells or even\natoms.  Then we wouldn&#39;t have to do any speciation\ncomputations of our own.  Of course, what we would\nhave to do would be far more complex and difficult.\nBut who knows..maybe .someday...\n\n&gt; Just curious...I&#39;m guessing that most people here in\n&gt; the group come from a computer science background.  Is\n&gt; that an incorrect assumption?  Neuroevolution is a\n&gt; multi-disciplinary field, so are there any people here\n&gt; with more experience in say, biology, psychology, or\n&gt; neuroscience than in computer science?\n&gt; \n\nFor what it&#39;s worth, I&#39;ve taken graduate level neuroscience, \ngraduate level biological evolution and development, (a.k.a. evodo),\nand several other courses on evolution.  But it would\nbe cool if anyone else here has their own biological expertise\nas Derek is asking?\n\nken\n\n\n"}}