{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[{"name":"READ"}]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"userId":7192225,"authorName":"Ian Badcoe","from":"Ian Badcoe &lt;ian_badcoe@...&gt;","profile":"ian_badcoe","replyTo":"LIST","senderId":"n12VNdTcmExzkNbhcGtjGmIN6501PeIU0S0lZIaJiR3YTVnukwhs9_edccQ-9m1x6Qfc06-tL9lNvTQsymDbSzxAU9YGE8_JQEc","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [neat] Re: Automatically setting the Speciation Threshold","postDate":"1131553637","msgId":2401,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDYuMi4zLjQuMC4yMDA1MTEwOTEyMDA0Ni4wMzNhNmQ0OEBwb3AubWFpbC55YWhvby5jby51az4=","inReplyToHeader":"PDUxN2ZhNmYxMDUxMTA4MTAyNXI1M2Q4MTM5YnFmMzNmYTI1NGVmYTY3OTE4QG1haWwuZ21haWwuY28gbT4=","referencesHeader":"PDYuMi4zLjQuMC4yMDA1MTEwNTE2MjQ1MC4wMzNmZTM0OEBwb3AubWFpbC55YWhvby5jby51az4gPGRra3I2aStzOGdoQGVHcm91cHMuY29tPiA8Ni4yLjMuNC4wLjIwMDUxMTA3MTcyODA5LjAzMzUyYzE4QHBvcC5tYWlsLnlhaG9vLmNvLnVrPiA8NTE3ZmE2ZjEwNTExMDcxMDI5ajFmOWUxN2Uzbzg4NmZlNmQxZDQ3YjcwMTZAbWFpbC5nbWFpbC5jb20+IDw2LjIuMy40LjAuMjAwNTExMDgxMzU3NDEuMDMzMzgzYzBAcG9wLm1haWwueWFob28uY28udWs+IDw1MTdmYTZmMTA1MTEwODEwMjVyNTNkODEzOWJxZjMzZmEyNTRlZmE2NzkxOEBtYWlsLmdtYWlsLmNvbT4="},"prevInTopic":2400,"nextInTopic":2402,"prevInTime":2400,"nextInTime":2402,"topicId":2386,"numMessagesInTopic":20,"msgSnippet":"At 18:25 08/11/2005, you wrote:\n On 11/8/05, Ian Badcoe  wrote:\n  It s just an idea.  I m not sure if it has any benefits over the\n","rawEmail":"Return-Path: &lt;ian_badcoe@...&gt;\r\nX-Sender: ian_badcoe@...\r\nX-Apparently-To: neat@yahoogroups.com\r\nReceived: (qmail 53720 invoked from network); 9 Nov 2005 16:26:01 -0000\r\nReceived: from unknown (66.218.66.172)\n  by m29.grp.scd.yahoo.com with QMQP; 9 Nov 2005 16:26:01 -0000\r\nReceived: from unknown (HELO smtp001.mail.ukl.yahoo.com) (217.12.11.32)\n  by mta4.grp.scd.yahoo.com with SMTP; 9 Nov 2005 16:26:01 -0000\r\nReceived: (qmail 71442 invoked from network); 9 Nov 2005 16:25:59 -0000\r\nReceived: from unknown (HELO ian2k.yahoo.co.uk) (ian?badcoe@212.159.73.108 with login)\n  by smtp001.mail.ukl.yahoo.com with SMTP; 9 Nov 2005 16:25:58 -0000\r\nMessage-Id: &lt;6.2.3.4.0.20051109120046.033a6d48@...&gt;\r\nX-Mailer: QUALCOMM Windows Eudora Version 6.2.3.4\r\nDate: Wed, 09 Nov 2005 16:27:17 +0000\r\nTo: neat@yahoogroups.com\r\nIn-Reply-To: &lt;517fa6f10511081025r53d8139bqf33fa254efa67918@...\n m&gt;\r\nReferences: &lt;6.2.3.4.0.20051105162450.033fe348@...&gt;\n &lt;dkkr6i+s8gh@...&gt;\n &lt;6.2.3.4.0.20051107172809.03352c18@...&gt;\n &lt;517fa6f10511071029j1f9e17e3o886fe6d1d47b7016@...&gt;\n &lt;6.2.3.4.0.20051108135741.033383c0@...&gt;\n &lt;517fa6f10511081025r53d8139bqf33fa254efa67918@...&gt;\r\nMime-Version: 1.0\r\nContent-Type: text/plain; charset=&quot;us-ascii&quot;; format=flowed\r\nX-eGroups-Msg-Info: 1:12:0:0\r\nFrom: Ian Badcoe &lt;ian_badcoe@...&gt;\r\nSubject: Re: [neat] Re: Automatically setting the Speciation Threshold\r\nX-Yahoo-Group-Post: member; u=7192225; y=nvwK5V2VfqmjQqq1yWGnzPhpSuKM0mXqs6Dh1vx80dgORSU_sg\r\nX-Yahoo-Profile: ian_badcoe\r\n\r\nAt 18:25 08/11/2005, you wrote:\n&gt;On 11/8/05, Ian Badcoe &lt;ian_badcoe@...&gt; wrote:\n&gt; &gt; &gt;It&#39;s just an idea.  I&#39;m not sure if it has any benefits over the\n&gt; &gt; &gt;existing system or not.  Nor do I have a clear idea of how it might be\n&gt; &gt; &gt;implemented.  But maybe there is merit to the idea.  Anybody have any\n&gt; &gt; &gt;thoughts or comments?\n&gt; &gt;\n&gt; &gt; I&#39;m still contemplating my next move, but it sounds like we&#39;re coming\n&gt; &gt; at the same limitations with different approaches?\n&gt;\n&gt;Perhaps.  Recognize speciation for what it was: an attempt to protect\n&gt;genetic diversity.\n\nI wasn&#39;t supposing otherwise.  In fact, I would go further an say I \nwas only treating it as a way of increasing search efficiency.  The \ntheory is that this happens by increasing diversity, but I wouldn&#39;t \ncall that proven...\n\n&gt;   Explore the possibility that speciation, while\n&gt;being *A* way to accomplish that goal, may not be the ONLY way, and it\n&gt;may not even be the BEST way.  Humans are only ONE species.  Yet we\n&gt;have a great deal of genetic diversity.   There must be a way, within\n&gt;the species itself, of accomplishing that goal.\n&gt;\n&gt;The more I think about it, the more I think that the hard-edged\n&gt;demarcation of boundaries is not the best way to go.\n\nThis was the idea behind my &quot;heap selection&quot; but I still didn&#39;t come \nup with a formulation of that that really gelled.\n\n&gt;   The existence of\n&gt;&#39;variable speciation threshold&#39; is evidence that such is the case.\n&gt;\n&gt;If you randomly select from a population, the results of your sample\n&gt;set should be proportional to the proportions of the population.  We\n&gt;don&#39;t want that.  We want to maintain the genetic diversity.  But, of\n&gt;course, we want to manage our resource allocation based on productive\n&gt;search areas.  So an elegant and flexible method is needed that lets\n&gt;us control where in this &#39;diverse&#39; sea of genomes we focus.\n&gt;\n&gt;What is an elegant (even if it is computationally intense) solution\n&gt;besides speciation?\n&gt;\n&gt;Well, speciation, done right, is basically &#39;clustering&#39;.\n\nAn alternative view is that each species represents a \nsemi-independent search.  e.g. suppose I have two machines and each \nday I copy the same population onto each, seed their random numbers \ndifferently, and then leave them running all day.  In the evening I \nhave two examples of different ways that the same random search could \nproceed.  I probably cannot merge them, because innovation numbers \nhave not be synchronized between them.  But I can take the best of \nthe two and discard the whole of the other.  This, to my mind, is the \nmost primitive use of &quot;species&quot;...\n\nThose two populations do represent different samples of the search \nspace, but they don&#39;t really represent clusters, it is more that each \none represents a different path across the search space (although \nonly the end-point still exists when I look at them in the \nevening).  If you imagine the result of me repeating this over a lot \nof days, then the total path explored is branched, with a split \nappearing each morning and the less-successful of the two branches \nbecoming a dead-end each evening.\n\nMy idea for the more advanced use of species (or &quot;species&quot;, since \nthey are not necessarily like real ones) is like this, except with \nthe hope of not just discarding the less successful ones, but also \nhaving the chance to merge anything unique they have discovered back \ninto the main-stream.\n\nI think there is more to that than clustering, but it depends a lot \non your problem space.  If you search space is essentially just a \nspace, then maintaining diversity is probably the best you can do, \ne.g. the space doesn&#39;t have internal structure and there is no reason \nto believe that merging unique features of two partial solutions \nwould lead to any better solution (in the same way that merging \nlocations in London with ones in Manchester doesn&#39;t find points of \nhigh population density).  Most problems are richer than that, \nhowever.  Their solution spaces have internal structure \n(partial-independence of the parts of the solution) so that merging \nparts of different solutions can lead to good results.  e.g. in TTT \nyou might merge an individual who can play for winning lines with one \nwho can block losing lines, and end up with a better player overall...\n\n&gt;   Done right,\n&gt;clustering doesn&#39;t have a fixed threshold.  Nor does it have a fixed\n&gt;cluster count.  Clusters are where clusters are.  Just find them.  So\n&gt;the work to maintain a fixed number of species probably isn&#39;t a good\n&gt;idea.  But you can&#39;t have every individual in their own species,\n&gt;right?  Only because of how a species is used to constrain\n&gt;reproduction.  If reproduction were constrained not by cluster but by\n&gt;individual pairings of compatible individuals, then the whole concept\n&gt;of a species would not be necessary.  It would, however, be useful for\n&gt;controlling resource allocation, so an alternative / replacement would\n&gt;be needed.\n\nAll this is true, but I think you are making the implicit assumption \nthat the distance metric used to determine the distance between \nindividuals reflects something real about the solution \nspace.  Unfortunately this is not the case, one small area of space \nmight contain several solutions that we would want to call different, \nwhereas another area might be huge but contain only solutions that we \nwould want to call the same...\n\nUnfortunately any distance metric is going to be at best an estimate \nof how different two individuals are algorithmically.\n\nSo what I&#39;m saying is if you spread the individuals too evenly \naccording to the distance metric, you might doom 99% of them to be in \nunproductive areas, just because the productive areas are relatively small...\n\n&gt;Say you have 1000 individuals in the population.  Pair them up, and\n&gt;you have 500 pairs.  Each pair could be combined in multiple ways.  So\n&gt;each pairing could produce 2-5 (or more) offspring.  Let&#39;s say they\n&gt;all produce 5 offspring.  You could then re-pair each individual with\n&gt;a different individual.  Repeat however often you like.  Add to that\n&gt;elitism, selecting the most fit individuals from each region of the\n&gt;search space.  Add to that random weight mutations.  And random\n&gt;topology mutations.\n&gt;\n&gt;Let&#39;s say that your 1000 individuals become, for the sake of argument,\n&gt;10,000 individuals.  Now, you don&#39;t want to test them all.  So,\n&gt;instead, you sample the 1000 of them that best represent the whole\n&gt;search space covered by that 10,000, with a little bias for areas of\n&gt;the search space where the fitness is higher.\n\nYou lost me.  There can&#39;t be any point in generating individuals that \nare not tested?  I can understand if you wanted to test some of them \nmore heavily than others, but surely an individual that is created \nand deleted without ever being tested has effectively never existed?\n\n         Ian\n\n&gt;The purist that tries to squeeze out every last bit of performance\n&gt;from the genome portion of the evolution would probably call that a\n&gt;waste of computational resources.  But for a really large and complex\n&gt;search space, I propose that this will make for a much more efficient\n&gt;search that is less likely to get stuck in a local optima.  Thus,\n&gt;reducing the amount of fitness evaluations (the really expensive part\n&gt;of any non-trivial domain), you win in the end.\n&gt;\n&gt;But the only way to know for sure is to try it out and see what the\n&gt;results are.  That means figuring out the right way to do that\n&gt;&#39;sampling&#39;.  Anybody have any suggestions on how best do do that\n&gt;representative sampling of the search space covered by the 10,000\n&gt;individuals?\n&gt;\n&gt;-- John\n&gt;\n&gt;\n&gt;\n&gt;\n&gt;Yahoo! Groups Links\n&gt;\n&gt;\n&gt;\n&gt;\n\n\nIn fifteen minutes, everybody will be in the future.\n\n\n\n\t\t\n___________________________________________________________ \nHow much free photo storage do you get? Store your holiday \nsnaps for FREE with Yahoo! Photos http://uk.photos.yahoo.com\r\n\n"}}