{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[{"name":"READ"}]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"userId":7192225,"authorName":"Ian Badcoe","from":"Ian Badcoe &lt;ian_badcoe@...&gt;","profile":"ian_badcoe","replyTo":"LIST","senderId":"Vw4Vs3gTEvRBr6srnqq6nu-qI3EroPjkVdlsSQ2299Xnfv5Ww86-kNPKJvtQ1CHzAzIrS9oumzUr5LVq5pILUO0xmDnI7ue7juo","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [neat] Alternative speciation strategies...","postDate":"1136926179","msgId":2486,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDYuMi4zLjQuMC4yMDA2MDExMDIwMDA1MC4wMzVlM2Y5MEBwb3AubWFpbC55YWhvby5jby51az4=","inReplyToHeader":"PDQzQzJGNTZGLjkwMzAyMDRAZHNsLnBpcGV4LmNvbT4=","referencesHeader":"PDYuMi4zLjQuMC4yMDA2MDEwODE0MTU0Ny4wMzU5MDI3MEBwb3AubWFpbC55YWhvby5jby51az4gPDQzQzJGNTZGLjkwMzAyMDRAZHNsLnBpcGV4LmNvbT4="},"prevInTopic":2485,"nextInTopic":2487,"prevInTime":2485,"nextInTime":2487,"topicId":2484,"numMessagesInTopic":6,"msgSnippet":"... Sorry, I wasn t clear what I meant.  When I called this alternative speciation I meant as a strategy to use entirely instead of the current approach.","rawEmail":"Return-Path: &lt;ian_badcoe@...&gt;\r\nX-Sender: ian_badcoe@...\r\nX-Apparently-To: neat@yahoogroups.com\r\nReceived: (qmail 52831 invoked from network); 10 Jan 2006 20:48:34 -0000\r\nReceived: from unknown (66.218.66.172)\n  by m9.grp.scd.yahoo.com with QMQP; 10 Jan 2006 20:48:34 -0000\r\nReceived: from unknown (HELO smtp1.freeserve.com) (193.252.22.158)\n  by mta4.grp.scd.yahoo.com with SMTP; 10 Jan 2006 20:48:34 -0000\r\nReceived: from me-wanadoo.net (localhost [127.0.0.1])\n\tby mwinf3014.me.freeserve.com (SMTP Server) with ESMTP id 800518800087\n\tfor &lt;neat@yahoogroups.com&gt;; Tue, 10 Jan 2006 21:48:33 +0100 (CET)\r\nReceived: from giles.yahoo.co.uk (modem-1474.lynx.dialup.pol.co.uk [217.135.197.194])\n\tby mwinf3014.me.freeserve.com (SMTP Server) with ESMTP id 4E8F9880009C\n\tfor &lt;neat@yahoogroups.com&gt;; Tue, 10 Jan 2006 21:48:31 +0100 (CET)\r\nX-ME-UUID: 20060110204831322.4E8F9880009C@...\r\nMessage-Id: &lt;6.2.3.4.0.20060110200050.035e3f90@...&gt;\r\nX-Mailer: QUALCOMM Windows Eudora Version 6.2.3.4\r\nDate: Tue, 10 Jan 2006 20:49:39 +0000\r\nTo: neat@yahoogroups.com\r\nIn-Reply-To: &lt;43C2F56F.9030204@...&gt;\r\nReferences: &lt;6.2.3.4.0.20060108141547.03590270@...&gt;\n &lt;43C2F56F.9030204@...&gt;\r\nMime-Version: 1.0\r\nContent-Type: text/plain; charset=&quot;us-ascii&quot;; format=flowed\r\nX-eGroups-Msg-Info: 1:12:0:0\r\nFrom: Ian Badcoe &lt;ian_badcoe@...&gt;\r\nSubject: Re: [neat] Alternative speciation strategies...\r\nX-Yahoo-Group-Post: member; u=7192225; y=YKVCUsa5nbpQBYiSMFVfn8fKnzt9bmffxh3LQzNpHyEWAmS7DA\r\nX-Yahoo-Profile: ian_badcoe\r\n\r\nAt 23:44 09/01/2006, you wrote:\n&gt;Hi Ian,\n&gt;\n&gt;Interesting post. I Just have a couple of points/thoughts...\n&gt;\n&gt;\n&gt; &gt;         &quot;Theorum #1&quot; -- a single species that is making progress (becoming\n&gt; &gt;fitter) at some reasonable rate, needs no extra-species interaction\n&gt; &gt;(splitting, merging or cross-breeding).\n&gt; &gt;\n&gt; &gt;\n&gt;Hmm maybe, but. If it is fitter it will take up a larger proportion of\n&gt;the population, some poor niche species will die out and the dominant\n&gt;species will be split to bring the # of species back to normal. That\n&gt;latter speciation is therefore based upon smaller differences between\n&gt;genomes within the dominant species (This is all assuming fitness\n&gt;sharing and a dynamic compatibility threshold of course). This all means\n&gt;that your species may actually be quite compatible, compatible enough\n&gt;that interspecies mating is beneficial.\n\nSorry, I wasn&#39;t clear what I meant.  When I called this &quot;alternative \nspeciation&quot; I meant as a strategy to use entirely instead of the \ncurrent approach.  e.g. I&#39;m listing here other ways of splitting \nspecies, and in a while I&#39;ll list ways of merging them again, and \nwhen you have both of those there won&#39;t be need for the current \ncompare and assign to put individuals into species, I&#39;ll just create \nspecies to address specific situations and pursue them until they \neither become productive or get fall foul of some heuristic and get trashed.\n\ne.g. for my first take on this, I wasn&#39;t thinking of very having more \nthan two species, and then only evolving one at a time, so:\n\n1) seed mainstream...\n2) evolve until it stalls\n3) generate a side-species using one of the approaches I outlined\n4) evolve the side-species until it stalls\n5) if the side-species is fitter, it replaces the mainstream and go to 3, else\n6) merge the side-species into the mainstream and go to 2\n\n--\n\nWhile comparison based speciation clearly works very well for Ken&#39;s \noriginal objective, I&#39;m coming more round to the idea now that we now \nneed a little more from a speciation strategy.\n\nIn particular, I&#39;m becoming uneasy with the idea of assigning \nindividuals to species based on a comparison (yes, I think I said \nthis before...).  Specifically because when you do that, you are \nnudging the species closer together.  Why, consider the creation of \nan individuals who are hybrids of species X and Y.  Obviously they \nwill fall into either X, or Y or Z (some other species).  In either \ncase all three species have been moved a small distance closer together.\n\nA similar argument applies when mutating individuals from a single \nspecies, if the individual is tested first against some species other \nthan the one it came from, then the chances are the second species \nhas been moved closer to the first.\n\nYou are probably saying &quot;but how are things different if in another scheme?&quot;\n\nWell I&#39;m glad you asked me that :)  If an individual is parented from \na single species, mutated and then assigned back to the same species, \nthen sure, there is a chance that will be a move closer to some other \nspecies, but note that this move is no more likely to be in that \ndirection than in any other.  And in the case of inter-species \nbreeding... I would never do that except when I had the specific \nobjective of merging the two species (and a merge can always fail, if \nthe result turns out not be fitter than the parent species)...\n\n&gt;Hmm which makes me wonder if interspecies reproduction should be\n&gt;increased between more similar species, which sort of ties in with the\n&gt;next bit...\n\nI&#39;m not quite sure how you got to this from the previous paragraph, \nbut did you also see my previous suggestion that one should only ever \nmerge from a less fit species to a fitter one.  The idea there being \nthat merging from fitter to less-fit will just overwrite the \nrecipient species with a copy of the fit one, but when merging from a \nless-fit species, the recipient is immune from complete take-over \n(being fitter) but may gain something if the two species have \ndifferent strengths...\n\n&gt; &gt;       And &quot;Theorum #2&quot; -- that the only purpose of a second (or more)\n&gt; &gt;species, is if it (i) replaces, or (ii) contributes genetic\n&gt; &gt;information to the mainstream.\n&gt; &gt;\n&gt; &gt;\n&gt;\n&gt;\n&gt;Traditionally we tend to think of just (i), but (ii) may be happening I\n&gt;suppose. Or could be made more likely to occur. [Side though] tracking\n&gt;the history of mutations and reproductions migth be a good way of\n&gt;identifying what dynamics are actually driving progress. In a past\n&gt;project I store what the very last operation was on a genome (was it the\n&gt;product of weight mutation, add node, crossover, etc) along with it&#39;s\n&gt;parent(s) fitnesses. This means that when you evaluate, if the fitenss\n&gt;is better than your parent(s) then you can increment a counter based on\n&gt;teh type of genetic operator that was used to create the genome. So as a\n&gt;search progresses you can look at ths stats and say - of x many\n&gt;mutations y% were good, and crossover was no use... etc.\n&gt;\n&gt;Yes I know, it&#39;s come up before and maybe you could use these stats to\n&gt;alter the search parameters. I&#39;ll get my coat shall I.\n\nNo, please stay :)  Have a beer.\n\nI also have muttered about this plan, except I was going to store the \nentire mutation statistics in each individual, at least back N \ngenerations.  By which I mean the list of which mutation operators \nwere applied.\n\nIf you sum the history over all living individuals, then correct me \nif I&#39;m wrong but you get a direct measure fo what mutations have been \nuseful in the last N generations...\n\nSo as long as you clamp the mutation frequencies, so that no mutation \ncan become eliminated...\n\n&gt; &gt;       ((Obviously it can try to do that, fail and be made extinct, but its\n&gt; &gt;objective must be to do one of those two.))\n&gt; &gt;\n&gt; &gt;       OK, so types of speciation:\n&gt; &gt;[...]\n&gt; &gt;\n&gt; &gt;--\n&gt; &gt;\n&gt; &gt;Bottleneck Speciation\n&gt; &gt;\n&gt; &gt;\n&gt;\n&gt;Points noted, also refer back to &#39;extinct event&#39; discussion.\n\nYes, the great thing on a computer being that you can have an \nextinction event _and_ retain the pre-extinction population.\n\nAlthough I do have an old back-up of the dinosaurs around somewhere...\n\n&gt; &gt;\n&gt; &gt;Side-step Speciation\n&gt; &gt;\n&gt; &gt;--\n&gt; &gt;\n&gt; &gt;Try-again Speciation\n&gt; &gt;\n&gt; &gt;\n&gt;\n&gt;I think of both of these as ways of doing a sort of wide or splatter\n&gt;search of the fitness space in the area around a genome/species.\n\nIf you applied than randomly (e.g. as a sort of meta-mutation) then \nyes, but in my above plan they are more like a &quot;kick&quot; to try and get \nthe system going again....\n\nIn which case, you can imagine turning up the power of the &quot;kick&quot; \neach time it fails...\n\n&gt;  The\n&gt;side shift looks at the area a bit further than normal mutation, and\n&gt;try-again actually takes some large leaps out in all directions. At this\n&gt;point I&#39;d like to re-raise my idea of ring-fencing areas of the fitness\n&gt;space as off limits, thus preventing individuals from regrouping around\n&gt;a local maxima (*). If it is a big maxima then they may form smaller\n&gt;groups around the edge of the mountain side ring fence (or think of\n&gt;volcano shape if of you prefer). This hopefully has the long term effect\n&gt;of causing more search space to be covered, away from tried and\n&gt;tested(failed) areas of the search space. But the space is approached\n&gt;more slowly than side-step, and probably even try-again.\n\nThis is interesting if you think of a using a tabu as a way of \ngenerating a side-species...\n\nIn which case multiple-side-species might be wanted, with different \ntabus in each...\n\nThis reminds me of another form of speciation that I forgot:\n\n--\n\nVariable target function Speciation.\n\nVTF is used in, for example, simulated annealing, and refers to the \nsame approach that EC people often use where the fitness function \n(target function) starts &quot;easy&quot; and is made more challenging as you \nget closer to the objective.\n\nIn this case, however, I&#39;d like to suggest a slightly different \ntwist, based on pareto.  e.g. if your fitness function is a sum over \nN test cases (say, ~620 tic-tac-toe boards).  Then you can obviously \nconstruct a large number (insert factorials here) of related fitness \nfunction each using a subset of the N test cases.\n\nIn VTF speciation all you do is generate on of those sub-set fitness \nfunctions, and use that on the side-species.\n\nObviously you have to return to the full fitness function at some \npoint, and you have the choice of:\n\n1) after the side-species stalls, switch it back to the full fitness \nfunction and evolve again untill it stalls, or,\n2) after the side species stalls, calculate its instantaneous full \nfitness and make a merge decision as outlined above...\n\n--\n\n&gt;     (*) I recently discovered that this general approach is in fact\n&gt;called a Tabu Search - which is a phrase I&#39;d heard/read but I didn&#39;t\n&gt;know what is was. (see wikipedia!)\n\nOh yes, I also discovered that.  I should have said, sorry.\n\n&gt; &gt;       [[I am also interested in using &quot;type zero&quot; as the form of parallel\n&gt; &gt;processing that I think I mentioned late last year, where you branch\n&gt; &gt;the population into N copies with different random number seeds (e.g.\n&gt; &gt;on remote machines) and after M generations select the fittest\n&gt; &gt;version and discard the others.]]\n&gt; &gt;\n&gt; &gt;\n&gt;I currently have a discussion going off-list about distributed\n&gt;processing. I&#39;ll try and coax it onto the group. My preference is for an\n&gt;&#39;island&#39; model, rather than a centrally controlled &#39;star&#39; model. Island\n&gt;seems  simpler and more scalable, in fact it can be made to be\n&gt;infinitely scalable.\n\nThey are both very scalable, but the island responds better to a \ngrid-based approach where individual servers drop in and out all the time...\n\n         Ian\n\nIn 15 minutes everybody will be in the future.\n\n\n\n\n"}}