{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[{"name":"READ"}]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"userId":127853030,"authorName":"Colin Green","from":"Colin Green &lt;cgreen@...&gt;","profile":"alienseedpod","replyTo":"LIST","senderId":"oGu0lMuxWhcPR4F-mESy3uQSl11mZL3m8innx6LmRMpi7UBMtSwxN6u2C_VWPlFjKpUr9fI7D8pKRNtwwRPMzlhSw-0FktZ4-w","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [neat] Alternative speciation strategies...","postDate":"1137269034","msgId":2487,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDQzQzk1OTJBLjkwMzA0MDdAZHNsLnBpcGV4LmNvbT4=","inReplyToHeader":"PDYuMi4zLjQuMC4yMDA2MDExMDIwMDA1MC4wMzVlM2Y5MEBwb3AubWFpbC55YWhvby5jby51az4=","referencesHeader":"PDYuMi4zLjQuMC4yMDA2MDEwODE0MTU0Ny4wMzU5MDI3MEBwb3AubWFpbC55YWhvby5jby51az4gPDQzQzJGNTZGLjkwMzAyMDRAZHNsLnBpcGV4LmNvbT4gPDYuMi4zLjQuMC4yMDA2MDExMDIwMDA1MC4wMzVlM2Y5MEBwb3AubWFpbC55YWhvby5jby51az4="},"prevInTopic":2486,"nextInTopic":2488,"prevInTime":2486,"nextInTime":2488,"topicId":2484,"numMessagesInTopic":6,"msgSnippet":"... Understood. ... One aspect of this sort of approach may be to more thoroughly examine the fitness space around a given species. The current mechanism of ","rawEmail":"Return-Path: &lt;cgreen@...&gt;\r\nX-Sender: cgreen@...\r\nX-Apparently-To: neat@yahoogroups.com\r\nReceived: (qmail 9387 invoked from network); 14 Jan 2006 20:04:27 -0000\r\nReceived: from unknown (66.218.66.167)\n  by m26.grp.scd.yahoo.com with QMQP; 14 Jan 2006 20:04:27 -0000\r\nReceived: from unknown (HELO astro.systems.pipex.net) (62.241.163.6)\n  by mta6.grp.scd.yahoo.com with SMTP; 14 Jan 2006 20:04:27 -0000\r\nReceived: from [10.0.0.11] (81-86-161-87.dsl.pipex.com [81.86.161.87])\n\tby astro.systems.pipex.net (Postfix) with ESMTP id 28B6AE000298\n\tfor &lt;neat@yahoogroups.com&gt;; Sat, 14 Jan 2006 20:03:54 +0000 (GMT)\r\nMessage-ID: &lt;43C9592A.9030407@...&gt;\r\nDate: Sat, 14 Jan 2006 20:03:54 +0000\r\nUser-Agent: Mozilla Thunderbird 1.0.7 (Windows/20050923)\r\nX-Accept-Language: en-us, en\r\nMIME-Version: 1.0\r\nTo: neat@yahoogroups.com\r\nReferences: &lt;6.2.3.4.0.20060108141547.03590270@...&gt; &lt;43C2F56F.9030204@...&gt; &lt;6.2.3.4.0.20060110200050.035e3f90@...&gt;\r\nIn-Reply-To: &lt;6.2.3.4.0.20060110200050.035e3f90@...&gt;\r\nContent-Type: text/plain; charset=ISO-8859-1; format=flowed\r\nContent-Transfer-Encoding: 7bit\r\nX-eGroups-Msg-Info: 1:12:0:0\r\nFrom: Colin Green &lt;cgreen@...&gt;\r\nSubject: Re: [neat] Alternative speciation strategies...\r\nX-Yahoo-Group-Post: member; u=127853030; y=6Pv1thwZd-Pbbh0uCgWWuzmnyrfmLleC_M7oQ8uCxyvihiBz5pE6\r\nX-Yahoo-Profile: alienseedpod\r\n\r\nIan Badcoe wrote:\n\n&gt;\n&gt;Sorry, I wasn&#39;t clear what I meant.  When I called this &quot;alternative \n&gt;speciation&quot; I meant as a strategy to use entirely instead of the \n&gt;current approach. \n&gt;\n\nUnderstood.\n\n\n&gt;\n&gt;e.g. for my first take on this, I wasn&#39;t thinking of very having more \n&gt;than two species, and then only evolving one at a time, so:\n&gt;\n&gt;1) seed mainstream...\n&gt;2) evolve until it stalls\n&gt;3) generate a side-species using one of the approaches I outlined\n&gt;4) evolve the side-species until it stalls\n&gt;5) if the side-species is fitter, it replaces the mainstream and go to 3, else\n&gt;6) merge the side-species into the mainstream and go to 2\n&gt;\n&gt;  \n&gt;\n\nOne aspect of this sort of approach may be to more thoroughly examine \nthe fitness space around a given species. The current mechanism of \nhaving many species potentially dilutes the ability to search any one \nspecies. Having said that, sharpneat disables the standard culling of \nstalled species for the best species,  hence a stalled dominant species \nshould be spawning off side-species anyway.\n\n\n&gt;--\n&gt;\n&gt;While comparison based speciation clearly works very well for Ken&#39;s \n&gt;original objective, I&#39;m coming more round to the idea now that we now \n&gt;need a little more from a speciation strategy.\n&gt;\n&gt;In particular, I&#39;m becoming uneasy with the idea of assigning \n&gt;individuals to species based on a comparison (yes, I think I said \n&gt;this before...).  Specifically because when you do that, you are \n&gt;nudging the species closer together.  Why, consider the creation of \n&gt;an individuals who are hybrids of species X and Y.  Obviously they \n&gt;will fall into either X, or Y or Z (some other species).  In either \n&gt;case all three species have been moved a small distance closer together.\n&gt;  \n&gt;\nIt depends on how you do the cpomparison, but generally speaking yes. \nOriginally I selected random genomes from a species to compare new \ngenomes against, but I changed this to always compare with the species \nchamp. Now if the champ is always the same genome (or if it doesn&#39;t \nchange very often) then the species is more tightly anchored to a \nspecific point in the fitness space. Unfortunately whether this actually \nhappens depends on the fitness function, e.g. if the it is \nnon-deterministic then the best genome may be different at each generation.\n\n\n&gt;A similar argument applies when mutating individuals from a single \n&gt;species, if the individual is tested first against some species other \n&gt;than the one it came from, then the chances are the second species \n&gt;has been moved closer to the first.\n&gt;  \n&gt;\nSure, but again I always test against the parent specie(s) first. \nInitially this was a performance optimisation, but it does make [some] \nsense to only put a spawned genome in a different species if it is \nsufficiently different to escape the parent specie(s).\n\n&gt;You are probably saying &quot;but how are things different if in another scheme?&quot;\n&gt;\n&gt;Well I&#39;m glad you asked me that :)\n&gt;\n\nerr, go on then...\n\n&gt;&gt;Hmm which makes me wonder if interspecies reproduction should be\n&gt;&gt;increased between more similar species, which sort of ties in with the\n&gt;&gt;next bit...\n&gt;&gt;    \n&gt;&gt;\n&gt;\n&gt;I&#39;m not quite sure how you got to this from the previous paragraph, \n&gt;but did you also see my previous suggestion that one should only ever \n&gt;merge from a less fit species to a fitter one.  The idea there being \n&gt;that merging from fitter to less-fit will just overwrite the \n&gt;recipient species with a copy of the fit one, but when merging from a \n&gt;less-fit species, the recipient is immune from complete take-over \n&gt;(being fitter) but may gain something if the two species have \n&gt;different strengths...\n&gt;  \n&gt;\nYep, makes sense. So you do interspecies mating but always place the \noffspring in the fittest (target) species in the hope of aquiring \nbeneficial genetic material from the less fit species - it having \nevolved on a seperate path for some time. So you could maybe draw an \nanalogy with different human races and children of mixed race parentage. \nPeople of two seperate races have been evolving sort of in isolation \n(geographical seperation) for sometime and although different, they are \nstill genetically compatible. In fact a recent news story (probably \nbased on some scientific research/report) raised the issue of mixed race \ncouple&#39;s children being less susceptible to genetic diseases, because \nthe chance of aquiring the same bad gene (which are often a feature of a \nspecific race) from both parents is greatly diminished. Just a thought.\n\n\n&gt;  \n&gt;\n&gt;&gt;&gt;      And &quot;Theorum #2&quot; -- that the only purpose of a second (or more)\n&gt;&gt;&gt;species, is if it (i) replaces, or (ii) contributes genetic\n&gt;&gt;&gt;information to the mainstream.\n&gt;&gt;&gt;\n&gt;&gt;&gt;\n&gt;&gt;&gt;      \n&gt;&gt;&gt;\n&gt;&gt;Traditionally we tend to think of just (i), but (ii) may be happening I\n&gt;&gt;suppose. Or could be made more likely to occur. [Side though] tracking\n&gt;&gt;the history of mutations and reproductions migth be a good way of\n&gt;&gt;identifying what dynamics are actually driving progress. In a past\n&gt;&gt;project I store what the very last operation was on a genome (was it the\n&gt;&gt;product of weight mutation, add node, crossover, etc) along with it&#39;s\n&gt;&gt;parent(s) fitnesses. This means that when you evaluate, if the fitenss\n&gt;&gt;is better than your parent(s) then you can increment a counter based on\n&gt;&gt;teh type of genetic operator that was used to create the genome. So as a\n&gt;&gt;search progresses you can look at ths stats and say - of x many\n&gt;&gt;mutations y% were good, and crossover was no use... etc.\n&gt;&gt;\n&gt;&gt;Yes I know, it&#39;s come up before and maybe you could use these stats to\n&gt;&gt;alter the search parameters. I&#39;ll get my coat shall I.\n&gt;&gt;    \n&gt;&gt;\n&gt;\n&gt;No, please stay :)  Have a beer.\n&gt;\n&gt;I also have muttered about this plan, except I was going to store the \n&gt;entire mutation statistics in each individual, at least back N \n&gt;generations.  By which I mean the list of which mutation operators \n&gt;were applied.\n&gt;  \n&gt;\nYes, tracking the last operation is rather simplistic. You need a \nhistory of mutations and gene exchange to arrive at a complete picture. \nYou could then reset (store away) the history at each improvement in \nfitness, on teh basis that this is represents one chunck of genetic \noperations that improved fitness and we can now start tracking history \nfrom scratch again (for that genome).\n\n&gt;If you sum the history over all living individuals, then correct me \n&gt;if I&#39;m wrong but you get a direct measure fo what mutations have been \n&gt;useful in the last N generations...\n&gt;  \n&gt;\nIndeed.\n\n&gt;\n&gt;\n&gt;  \n&gt;\n&gt;&gt;Points noted, also refer back to &#39;extinct event&#39; discussion.\n&gt;&gt;    \n&gt;&gt;\n&gt;\n&gt;Yes, the great thing on a computer being that you can have an \n&gt;extinction event _and_ retain the pre-extinction population.\n&gt;\n&gt;Although I do have an old back-up of the dinosaurs around somewhere...\n&gt;\n&gt;  \n&gt;\nYeh but they&#39;re on old laser disks that no-one can read. Also (more \nserious but slightly irrelevant point) I don&#39;t think DNA is actually the \ncomplete blueprint for a creature as is often stated, even if you \ninclude the separate mitochondrial DNA. Live DNA/RNA exists within a \nframework of chemical/biological machinery, take away the machinery and \nyou&#39;re left with a load of useless information. Fortunately modern day \ncells are probably no different to prehistoric ones... probably. Oh hold \non, I think this is the basis of &#39;Jurassic Park&#39; :) - they used \nhermaphrodite frog cells or something.\n\n&gt;&gt;&gt;Side-step Speciation\n&gt;&gt;&gt;\n&gt;&gt;&gt;--\n&gt;&gt;&gt;\n&gt;&gt;&gt;Try-again Speciation\n&gt;&gt;&gt;\n&gt;&gt;&gt;\n&gt;&gt;&gt;      \n&gt;&gt;&gt;\n&gt;&gt;I think of both of these as ways of doing a sort of wide or splatter\n&gt;&gt;search of the fitness space in the area around a genome/species.\n&gt;&gt;    \n&gt;&gt;\n&gt;\n&gt;If you applied than randomly (e.g. as a sort of meta-mutation) then \n&gt;yes, but in my above plan they are more like a &quot;kick&quot; to try and get \n&gt;the system going again....\n&gt;\n&gt;In which case, you can imagine turning up the power of the &quot;kick&quot; \n&gt;each time it fails...\n&gt;  \n&gt;\n\nOh ok. I guess there will be a limit to how big a kick you can use to \nfind good genomes, at which point you just keep trying at the max kick \nlevel?\n\n&gt;  \n&gt;\n&gt;&gt;[Ring-fencing / Tabu search]\n&gt;&gt;    \n&gt;&gt;\n&gt;\n&gt;This is interesting if you think of a using a tabu as a way of \n&gt;generating a side-species...\n&gt;\n&gt;In which case multiple-side-species might be wanted, with different \n&gt;tabus in each...\n&gt;\n&gt;This reminds me of another form of speciation that I forgot:\n&gt;\n&gt;--\n&gt;\n&gt;Variable target function Speciation.\n&gt;\n&gt;[...]\n&gt;\n&gt;--\n&gt;\n&gt;  \n&gt;\n\nYes this makes sense also - so e.g. search for slightly different \naspects of TTT game play in the hope that the some of the different \nstrategies that are found complement each other when merged together. \nHowever, my head is now starting to spin.\n\n\nGoing to try and get back to coding now,\n\nColin\n\n"}}