{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[{"name":"READ"}]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"userId":7192225,"authorName":"Ian Badcoe","from":"Ian Badcoe &lt;ian_badcoe@...&gt;","profile":"ian_badcoe","replyTo":"LIST","senderId":"9eFrgY1nrPmEF1DqSpfivPSw3CMgFcqmjc-hE22ArQyn5qep5XWzEasSz-0pC_IQz8PtR5Ria79KtLEVGMQa1LiFiAIpQ0SJrKQ","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Merging species...","postDate":"1138121972","msgId":2499,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDIwMDYwMTI0MTY1OTMyLjc3NzU5LnFtYWlsQHdlYjI1MTAzLm1haWwudWtsLnlhaG9vLmNvbT4=","inReplyToHeader":"PDIwMDYwMTE4MTQ0OTMyLjUzMTU2LnFtYWlsQHdlYjYwODIzLm1haWwueWFob28uY29tPg=="},"prevInTopic":2498,"nextInTopic":2500,"prevInTime":2498,"nextInTime":2500,"topicId":2494,"numMessagesInTopic":17,"msgSnippet":"Hi, So, further to my last post about alternative speciestion, I wanted to discuss the case where you have two species and want to merge them back together, in","rawEmail":"Return-Path: &lt;ian_badcoe@...&gt;\r\nX-Sender: ian_badcoe@...\r\nX-Apparently-To: neat@yahoogroups.com\r\nReceived: (qmail 370 invoked from network); 24 Jan 2006 17:59:36 -0000\r\nReceived: from unknown (66.218.66.218)\n  by m32.grp.scd.yahoo.com with QMQP; 24 Jan 2006 17:59:36 -0000\r\nReceived: from unknown (HELO web25103.mail.ukl.yahoo.com) (217.12.10.51)\n  by mta3.grp.scd.yahoo.com with SMTP; 24 Jan 2006 17:59:35 -0000\r\nReceived: (qmail 77761 invoked by uid 60001); 24 Jan 2006 16:59:32 -0000\r\nMessage-ID: &lt;20060124165932.77759.qmail@...&gt;\r\nReceived: from [195.152.206.139] by web25103.mail.ukl.yahoo.com via HTTP; Tue, 24 Jan 2006 16:59:32 GMT\r\nDate: Tue, 24 Jan 2006 16:59:32 +0000 (GMT)\r\nTo: neat@yahoogroups.com\r\nIn-Reply-To: &lt;20060118144932.53156.qmail@...&gt;\r\nMIME-Version: 1.0\r\nContent-Type: text/plain; charset=iso-8859-1\r\nContent-Transfer-Encoding: 8bit\r\nX-eGroups-Msg-Info: 1:12:0:0\r\nFrom: Ian Badcoe &lt;ian_badcoe@...&gt;\r\nSubject: Merging species...\r\nX-Yahoo-Group-Post: member; u=7192225; y=YVeyujc8C_qhPsk6eYU14YaclMyXKwIVN_ZBXX3V1SX3Riy3Rw\r\nX-Yahoo-Profile: ian_badcoe\r\n\r\nHi,\n\n    So, further to my last post about alternative\nspeciestion, I wanted to discuss the case where you\nhave two species and want to merge them back together,\nin such a way as to obtain the maximum fitness in the\nmerged species.\n\n    Obviously the nature of this merge depends a lot\non how closely related the two species are.  If they\nare too similar, then there is nothing to gain from\nmerging, and the merge might even consist of merely\nrelabelling two sets of individuals as a single set.\n\n    Equally, if the two species are totally\ndissimilar, then merging them may not make sense. \nOTOH, if you regarded the process as forming a\nsymbiosis, rather than direct cross-breeding (and\nassuming your system supports that in some way) then\ntwo dissimilar species could co-evolve so as to work\ntogether and achieve a higher fitness than either\nacting alone.\n\n    As long as we&#39;re not not discussing concrete\ndetails of any system, the distinction between\ncross-breeding and the formation of a symbiosis is\nfairly semantic anyway.  And as my thesis in this\nmessage is going to be that merging two species will\nrequire evolving them, then maybe the idea of merging\nvery different species is more a difference in degree\nrather then a difference in kind.\n\n--\n\n    Note that merging can be preserving or\ndestructive.  By this I refer to whether the\nindividuals in the parent species will or will not get\nthe chance to survive the merge.  The significance of\nthis is that if Species-B has nothing to contribute to\nfitness, then a preserving merge of A and B will\nresult in a new species identical, or strongly\nresembling A.  And definitely as fit as A.  Whereas a\ndestructive merge may &quot;damage&quot; A as a result of\nforcing it to merge with B.  Note that the less-fit\nspecies is not guarranteed to survive in either\ncase...\n\n    Ok, so ideas for merging:\n\n1) union merge - just put all the individuals into a\nsingle species, call the merge done and rely on\nfurther normal genetics to finish the merge.\n\n    - obviously if you have fixed size species you\nwill need to halve the size of the new one:\n\n    i) take the best 50% of each input species\n    ii) take the best 50% of the combined species (no,\nthese are not the same)\n    iii) take only the two champions and let their\ninteraction refill the new species\n    iv) allow an oversize species and decrease it\nslowly over time\n\n2) special union merge - as above, but setup special\nbreeding conditions for the period following the\nmerge, e.g. maybe turn down (of off) mutation and\nfocus only on cross-over...\n\n    [[ these are all preserving ]]\n\n3) pairwise breed merge - draw random pairs from the\ntwo input species, crossbreed them once and place the\noffspreing into the new one\n\n    - this preserves the species size, if your\ncrossbreed method is non-deterministic you might want\nto repeat each breeding M times and insert only the\nfittest into the new species, although this might br\noverkill because the new species will not go on to\nbreed in its own right and thus generate some of that\nvariation.\n\n    [[ destructive ]]\n\n4) all-all breed merge - crossbreed every individual\nfrom species A with every individual from species B\nand keep only the N fitest individuals from the whole\nprocess\n\n    - optionally repeat each crossbreeding M times but\nonly take the fittest offspring\n\n    [[ destructive ]]\n\n5) champion breed merge - take the highest scoring M\nindividuals from each species and crossbreed them to\nproduce the new species\n\n    - if M = sqrt(n) and we crossbreed every possible\npair we get back to N individuals\n\n    [[ destructive ]]\n\n6) influence merge - continue to run one species as\nnormal, but make members of the other available as\nparents\n\n    - this has the effect of presenting a constant\ninfluence from the constant second species onto the\nfirst.  Genes from the second will make there way into\nthe first, and the first may evolve ways to exploit\nthem.\n\n    [[ preserving for the first species ]]\n\n--\n\n    One idea that might have some use for\nbreeding-based merges is &quot;asymmetric parentage&quot;.  This\nis simply the idea that one partent might be a lesser\ncontributor to the ofspring than the other. \nTraditional NEAT has this in as much as where genes\nare present in both parents, the copy from the fitter\nparent is taken in preference to the one from the\nother.  It gives the less-fit parent equal weighting\nwhen it takes all unpaired genes from both parents,\nhowever...\n\n    Asymmetric parentage becomes useful if we accept\nthe idea that some genes from the one species might be\nadaptive transferred into the other, while others were\nvery unadaptive.  With equal parentage, to discover\nthis we need to (i) crossbreed two individuals and\nthen (ii) delete the deadly genes (even assuming the\nintermediate individual is fit enough to get\nconsidered for mutation; and that you have\ndelete/disable mutations).\n\n    With asymmetric parentage, if the second parent\nhas a weight of (say) 0.1, then on average a sample of\n10% of its genes will appear in the offspring.  As\nlong as you are prepared to try the same crossbreeding\nseveral times, this gives you a far better chance of\npulling out only the useful one(s)...\n\n--\n\n    As you might guess, this is for SLEAT and at\npresent I just have a union merge, which I didn&#39;t see\nworking very well yet, but then again I wouldn&#39;t\nexpect it to until the system has got sufficiently\nstuck as to need a &quot;step-aside&quot; speciation, and that\nprobably needs me to run it for 10,000,000 cycles...\n\n    As usual, any thoughts gratefully recieved...\n\n    Ian\n\n\n\t\t\n___________________________________________________________ \nTo help you stay safe and secure online, we&#39;ve developed the all new Yahoo! Security Centre. http://uk.security.yahoo.com\n\n"}}