{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[{"name":"READ"}]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"userId":127853030,"authorName":"Colin Green","from":"Colin Green &lt;cgreen@...&gt;","profile":"alienseedpod","replyTo":"LIST","senderId":"CNfYHjJe9sk3Z2Xn6PcZtN3bgG4raV9-Sf8YTx6jdORTYGwrQGSyduVdPZxgytFDHmgWQ7kiUi3Ok3YytbT7bZPYv_RkQ10e-Q","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [neat] Evolving a Trading Strategy: Update","postDate":"1158448906","msgId":2748,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDQ1MEM4NzBBLjMwMzA2MDhAZHNsLnBpcGV4LmNvbT4=","inReplyToHeader":"PDAwMDAwMWM2ZDVmNSQzODBkZjM2MCQwMzAyYThjMEBtb2JpbGU+","referencesHeader":"PDQ0RkY0ODNCLjMwNDA0MDZAZHNsLnBpcGV4LmNvbT4gPDAwMGEwMWM2ZDNiZSQzYTg4ODNmMCQwMjAyYThjMEBIb3VzZT4gPDQ1MDJCNTYxLjQwNDAwMDdAZHNsLnBpcGV4LmNvbT4gPDAwMDAwMWM2ZDVmNSQzODBkZjM2MCQwMzAyYThjMEBtb2JpbGU+"},"prevInTopic":2746,"nextInTopic":2749,"prevInTime":2747,"nextInTime":2749,"topicId":2733,"numMessagesInTopic":13,"msgSnippet":"Hi Jeff, ... I don t know much about speech recognition but I am aware of the basic concept of analysing the frequency spectrogram generated using fixed length","rawEmail":"Return-Path: &lt;cgreen@...&gt;\r\nX-Sender: cgreen@...\r\nX-Apparently-To: neat@yahoogroups.com\r\nReceived: (qmail 43017 invoked from network); 16 Sep 2006 23:21:47 -0000\r\nReceived: from unknown (66.218.66.167)\n  by m36.grp.scd.yahoo.com with QMQP; 16 Sep 2006 23:21:47 -0000\r\nReceived: from unknown (HELO ranger.systems.pipex.net) (62.241.162.32)\n  by mta6.grp.scd.yahoo.com with SMTP; 16 Sep 2006 23:21:46 -0000\r\nReceived: from [10.0.0.11] (81-86-161-87.dsl.pipex.com [81.86.161.87])\n\tby ranger.systems.pipex.net (Postfix) with ESMTP id 04790E000771\n\tfor &lt;neat@yahoogroups.com&gt;; Sun, 17 Sep 2006 00:21:44 +0100 (BST)\r\nMessage-ID: &lt;450C870A.3030608@...&gt;\r\nDate: Sun, 17 Sep 2006 00:21:46 +0100\r\nUser-Agent: Mozilla Thunderbird 1.0.7 (Windows/20050923)\r\nX-Accept-Language: en-us, en\r\nMIME-Version: 1.0\r\nTo: neat@yahoogroups.com\r\nReferences: &lt;44FF483B.3040406@...&gt; &lt;000a01c6d3be$3a8883f0$0202a8c0@House&gt; &lt;4502B561.4040007@...&gt; &lt;000001c6d5f5$380df360$0302a8c0@mobile&gt;\r\nIn-Reply-To: &lt;000001c6d5f5$380df360$0302a8c0@mobile&gt;\r\nContent-Type: text/plain; charset=ISO-8859-1; format=flowed\r\nContent-Transfer-Encoding: 7bit\r\nX-eGroups-Msg-Info: 1:0:0:0\r\nFrom: Colin Green &lt;cgreen@...&gt;\r\nSubject: Re: [neat] Evolving a Trading Strategy: Update\r\nX-Yahoo-Group-Post: member; u=127853030; y=ecpfJEKnujpCZqxAMaSyabUc25kZpaPTfvz9Q6ZOp2Oo_c5EY4nh\r\nX-Yahoo-Profile: alienseedpod\r\n\r\nHi Jeff,\n\nJeff Morton wrote:\n\n&gt;There really aren&#39;t any studies I can personally attest to since I have really just begun this learning process myself.  I will note that it appears to me based solely on observation that using just the technical bar data is inadequate.  This kind of reminds me of the problem faced when trying to use neural networks to recognize speech.  In this instance a simple frame by frame fourier transform of the data will not produce the patterns necessary for detection.  You actually have to analyze the spectrogram of varying time periods for those patterns to develop properly.  \n&gt;  \n&gt;\n\n\nI don&#39;t know much about speech recognition but I am aware of the basic \nconcept of analysing the frequency spectrogram generated using fixed \nlength moving time frames ( the last n milliseconds). Now I realise \nyou&#39;re not necesarily suggesting using spectrograms but my immediate \nreaction to the idea is that financial time series data oscillates at \nmuch lower frequencies than most audio signals and therefore a much \nlonger time frame would be needed to produce a meaningful spectrogram. \nActually though I quite like the idea. And I suppose the longer time \nframes would pick up on very low frequency signals whereas the shorter \ntime frames would give a more immediate response to higher frequency \ncomponents.\n\n&gt;It might be more useful to include standard indicators over differing time periods with other fundamental financial data, etc.  Perhaps using statistics like those used in digital signal processing would be a better idea as well.  \n&gt;  \n&gt;\n\n\nYou mean something like this (taken from wikipedia page on digitla \nsignal processing:\n\n&quot;There are some commonly used frequency domain transformations. For \nexample, the cepstrum &lt;http://en.wikipedia.org/wiki/Cepstrum&gt; converts a \nsignal to the frequency domain through Fourier transform, takes the \nlogarithm, then applies another Fourier transform. This emphasizes the \nfrequency components with smaller magnitude while retaining the order of \nmagnitudes of frequency components.&quot;\n\n\n&gt;I think the biggest problem at this point is that PCs just aren&#39;t quite fast enough or are limited by available RAM.  this is bound to change very quickly though so developing these systems now makes a lot of sense to me.  \n&gt;  \n&gt;\n\n\nI think there&#39;s a lot that can be done with existing PC&#39;s so long as \nyou&#39;re not too wasteful. E.g. you would want to pre-calculate frequency \nspectrograms where possible (liek where the time frame(s) is/are fixed). \nCurrently all of my derived signals are currenly pre-calculated and \nplaced into a data structure that is organised into the order that data \nis normally accessed, thus improving CPU cache utilisation.\n\n\n&gt;As far as my current implementation is concerned.  Bascially what I&#39;ve done is developed a backtesting engine which is utilized by an agent of sorts which randomly selects techical indicators with varying parameters and runs them against the market data.  This has been marginally effective and I think this has just brought home the point to me that technical indicators alone are not enough.\n&gt;  \n&gt;\n\n\nI do pretty much the same thing but I try to evolve a single ANN agent \n(or that gives buy sell signals to an agent) and that takes some simple \nderived signals at its inputs. Now I provide the same complete set of \nsignals to all of my ANNs, but they can of course choose to ignore \nsignals, modify them. What they can&#39;t do is provide parametrs to the \nroutine that generates the derived signals, not least because as I said \nabove, the signals are pre-calculated.\n\n&gt;My current idea is to replace those algorithmic technical indicators with small neural networks that I can train to act as technical indicators.  Not because I necessarily believe this will produce better results but because I intend to modify my current system to handle neural networks instead of the predefined indicator classes I&#39;m currently using.  NEAT looks like a good place to start digging into code to do this.\n&gt;  \n&gt;\n\nAssuming your agent utilises a sub-set of all available indicators, \ncould you not simply add some additional ANN indicators to the set of \nexisting algorithmic ones?\n\n\n&gt;BTW, I&#39;m working in C#.\n&gt;  \n&gt;\n\n\nThat&#39;s fine by me. Just in case you hadn&#39;t already realised, I&#39;m the guy \nwho wrote SharpNEAT :)\n\n&gt;As far as the time series data, if all you are looking for are a couple of data sets than you should definately check out finance.yahoo.com.  You can download CSV files for free.  The oldest I have going back to the 1960&#39;s (IBM on the NYSE).\n&gt;  \n&gt;\n\noh wow, yes you&#39;re right. I just downloaded the Dow Jones \nopen/high/low/close all the way back to 1928 in about 10 seconds! Now \nI&#39;m thinking I should probably adjust for inflation.\n\n\n\n&gt;If you think you might have a need for ALL of it then we can make arangements for me to transmit this to you over the internet.  That file which covers all historical data for all US markets compressed to just over 500meg using RAR.\n&gt;  \n&gt;\n\nThanks for the offer. I&#39;ve got enough to be going on with for a while, \nbut maybe at a alter date.\n\nRegards,\n\nColin\n\n"}}