{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[{"name":"READ"}]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"userId":151231063,"authorName":"Joseph Reisinger","from":"Joseph Reisinger &lt;joeraii@...&gt;","profile":"joeraii","replyTo":"LIST","senderId":"zRJ3BkYPS_pe2SnjpINgHnoek84GU_VXyh9HJqikuAyfKnUiyOmkLctyoAfxE64vlWei2d3Kes-yje4V_-FDeWHBtysbYcDZwndBCgv85Q","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [neat] Re: HyperNEAT: Creating Neural Networks with CPPNs","postDate":"1175060026","msgId":3056,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDI1QUVFM0JELURBMjQtNERGNS05NjcyLTJEMkRERDlCNjUzMEBjcy51dGV4YXMuZWR1Pg==","inReplyToHeader":"PGV1YWI3aittbGNmQGVHcm91cHMuY29tPg==","referencesHeader":"PGV1YWI3aittbGNmQGVHcm91cHMuY29tPg=="},"prevInTopic":3054,"nextInTopic":3065,"prevInTime":3055,"nextInTime":3057,"topicId":3028,"numMessagesInTopic":34,"msgSnippet":"... Right, but such pattern matching is independent of the developmental process, its a representational feature that could be added in to any indirect","rawEmail":"Return-Path: &lt;joeraii@...&gt;\r\nX-Sender: joeraii@...\r\nX-Apparently-To: neat@yahoogroups.com\r\nReceived: (qmail 56330 invoked from network); 28 Mar 2007 05:33:55 -0000\r\nReceived: from unknown (66.218.67.35)\n  by m36.grp.scd.yahoo.com with QMQP; 28 Mar 2007 05:33:55 -0000\r\nReceived: from unknown (HELO spunkymail-a19.g.dreamhost.com) (208.97.132.66)\n  by mta9.grp.scd.yahoo.com with SMTP; 28 Mar 2007 05:33:55 -0000\r\nReceived: from [10.0.0.115] (72-48-75-214.dyn.grandenetworks.net [72.48.75.214])\n\tby spunkymail-a19.g.dreamhost.com (Postfix) with ESMTP id A5AAE11796\n\tfor &lt;neat@yahoogroups.com&gt;; Tue, 27 Mar 2007 22:33:50 -0700 (PDT)\r\nMime-Version: 1.0 (Apple Message framework v752.2)\r\nIn-Reply-To: &lt;euab7j+mlcf@...&gt;\r\nReferences: &lt;euab7j+mlcf@...&gt;\r\nContent-Type: text/plain; charset=US-ASCII; delsp=yes; format=flowed\r\nMessage-Id: &lt;25AEE3BD-DA24-4DF5-9672-2D2DDD9B6530@...&gt;\r\nContent-Transfer-Encoding: 7bit\r\nDate: Wed, 28 Mar 2007 00:33:46 -0500\r\nTo: neat@yahoogroups.com\r\nX-Mailer: Apple Mail (2.752.2)\r\nX-eGroups-Msg-Info: 1:0:0:0\r\nFrom: Joseph Reisinger &lt;joeraii@...&gt;\r\nSubject: Re: [neat] Re: HyperNEAT: Creating Neural Networks with CPPNs\r\nX-Yahoo-Group-Post: member; u=151231063; y=gAlT5bTGP3f-v04rBLRFiJ5WbrqaTyGdJ5SMXo_qzzwaNw\r\nX-Yahoo-Profile: joeraii\r\n\r\n&gt; Joe, I may not be fully understanding your point, so I wanted to ask\n&gt; for clarification.\n&gt; My point was only that CPPNs can abstract away\n&gt; the temporal unfolding and local interaction that are usually\n&gt; associated with development.  You are saying something that does not\n&gt; seem in opposition to this point, but I may be misunderstanding.  It\n&gt; seems you are saying that &quot;pattern recognition&quot; gives a powerful\n&gt; capability to traditional developmental systems in terms of being\n&gt; able to target mutations to specific areas.  I would not disagree\n&gt; with that point.\n\nRight, but such pattern matching is independent of the developmental  \nprocess, its a representational feature that could be added in to any  \nindirect encoding. Its just a different way of specifying locality in  \na slightly more &quot;unstructured&quot; way than is done with CPPNs. In fact  \nit could certainly be used with CPPNs, in the same way we use it for  \nneural networks.\n\nI want to be clear that I believe the idea of &quot;pattern recognition&quot;  \nin development is completely independent of local interactions  \ndetermining &quot;where am i?&quot; Furthermore, I believe this idea plays a  \nrole in determining evolvability.\n\n&gt;\n&gt; However, what I would say, which may simply be consistent with what\n&gt; you are saying, is that CPPNs abstract away the need for there to be\n&gt; such pattern recognition in order to get either global or local\n&gt; targeted mutations.  I still submit that the targeted mutations to\n&gt; which you are referring ultimately hinge on &quot;where am I?&quot;  Because\n&gt; how did the liver cell ultimately figure out it was a liver cell?\n&gt; It&#39;s because of its neighbors, and so forth.  It&#39;s all context-\n&gt; dependent.\n\nBut it doesn&#39;t have to be determined from the neighbors. A cell could  \njust have a context determined by overlapping regulatory regions on a  \nfixed substrate (like how CPPNS and implicit NEAT work). These  \noverlapping regulatory regions are what I&#39;m trying to get at here: A  \nregulatory region in a gene does exactly the &quot;pattern recognition&quot;  \nthat we are discussing. For instance, a cell at some fixed location  \ncould respond to some regulatory signals A, B, and C. These signals  \nexactly determine the cell&#39;s context within development, and other  \ncells with the exact same signals would be treated the same, even  \nthough they may be located in spatially diverse areas.\n\n&gt;\n&gt; On the other hand, in the CPPN, the liver is a local coordinate\n&gt; frame (i.e. some internal node) that is built upon (i.e. a function\n&gt; of) other coordinate frames.  So in effect the same thing is going\n&gt; on, just in a different way.  But ultimately it &quot;knows&quot; it is a\n&gt; liver cell in either case.  In the CPPN this knowledge is simply\n&gt; encapsulated as the node in the CPPN itself where the coordinate\n&gt; frame is represented.  A mutation thereabout will effect only those\n&gt; cells within that coordinate frame.  So you get targeted mutations\n&gt; just as well without &quot;pattern recognition.&quot;\n\nRight, this is a good example. The hierarchical nesting of coordinate  \nframes in CPPNs and the idea of doing pattern recognition for  \nmatching regulatory signals accomplish the same goal, although they  \nare wildly different approaches. One could almost say that a CPPN  \nbuilds definitions of locality &quot;explicitly&quot; while the regulatory  \napproach builds it &quot;implicitly.&quot; Which of these representations is  \nbetter for what problems is an interesting open problem in  \nrepresentation design.\n\n&gt;\n&gt; I think what I&#39;m saying is consistent with the results that you cite\n&gt; from your paper since I fully believe that IF you are using a\n&gt; traditional developmental encoding, &quot;pattern recognition&quot; indeed\n&gt; carries the benefits you cite.  So I expect you could demonstrate it\n&gt; experimentally.\n\nAgain to be clear where I disagree with you, &quot;pattern recognition&quot;  \ncan be used and is beneficial independent of whether a traditional  \ndevelopmental encoding is used.\n\n&gt;\n&gt; I think this is a great discussion to have.\n&gt;\n&gt; ken\n&gt;\n&gt; --- In neat@yahoogroups.com, Joseph Reisinger &lt;joeraii@...&gt; wrote:\n&gt;&gt;\n&gt;&gt; Hi Ken,\n&gt;&gt;\n&gt;&gt; I have one (small) point of clarification to add to your\n&gt; exposition\n&gt;&gt; here:\n&gt;&gt;\n&gt;&gt;&gt; &quot;genes essentially &#39;pattern recognize&#39; certain areas in the\n&gt;&gt;&gt; organism&quot;\n&gt;&gt;&gt;\n&gt;&gt;&gt; That is absolutely correct for biological organisms, and for\n&gt;&gt;&gt; iterated developmental systems in general.  However, the deep\n&gt;&gt;&gt; question is *why* should they need to &quot;pattern recognize&quot; certain\n&gt;&gt;&gt; areas?\n&gt;&gt;&gt;\n&gt;&gt;&gt; And the answer is because they need to know where they are.  In\n&gt;&gt;&gt; effect, in the physical universe, there is no intrinsic\n&gt; coordinate\n&gt;&gt;&gt; system that cells can query to ask their location.  Thus, they\n&gt; must\n&gt;&gt;&gt; develop elaborate and ad hoc ways of communicating to each\n&gt; other, as\n&gt;&gt;&gt; a group, where everyone is.  I send my neighbor signals, my\n&gt; neighbor\n&gt;&gt;&gt; sends me signals back, and we negotiate our roles.\n&gt;&gt;&gt;\n&gt;&gt;&gt; My undoubtedly controversial contention is that the\n&gt; question &quot;where\n&gt;&gt;&gt; am I?&quot; is the ONLY reason that such negotation is necessary.  If\n&gt; you\n&gt;&gt;&gt; didn&#39;t have to ask that question, then you would not need to\n&gt; talk to\n&gt;&gt;&gt; your neighbors in order to determine your role.  Rather, you\n&gt; could\n&gt;&gt;&gt; just compute your role as a function of your known\n&gt;&gt;&gt; coordinate/position in the world.\n&gt;&gt;\n&gt;&gt; Your answer to &quot;why we need to pattern recognize&quot; is a little\n&gt;&gt; incomplete. Basically you&#39;ve only answered this from the cell&#39;s\n&gt;&gt; perspective. Lets consider &quot;pattern recognize&quot; from the\n&gt; perspective\n&gt;&gt; of the developmental program instead of the cell. Then the main\n&gt;&gt; question is &quot;how do I select a bunch of cells that match some\n&gt;&gt; property?&quot; That is, I want to select some contiguous region,\n&gt; e.g.,\n&gt;&gt; &quot;toe cells&quot; or &quot;heart cells&quot; or maybe I want to select something\n&gt; more\n&gt;&gt; developmentally useful, e.g. &quot;epithelial cells&quot; or &quot;cells in some\n&gt;&gt; stripe pattern along the HOX axis.&quot;\n&gt;&gt;\n&gt;&gt; Why is this useful? Because then we can make mutations that\n&gt; affect\n&gt;&gt; these areas and no others, i.e. mutation selectivity that is\n&gt; defined\n&gt;&gt; for some (hopefully) useful phenotypic axes of variation. A lot\n&gt; of\n&gt;&gt; useful things fall out naturally from this idea, like modularity\n&gt; or\n&gt;&gt; evolvability (this is where I cite my GECCO 2007 paper, which is\n&gt; not\n&gt;&gt; yet on the web). In CPPN terms it would be like being able to\n&gt; select,\n&gt;&gt; say, all the black stripes in a sine grating, but not the white\n&gt; ones.\n&gt;&gt; If I&#39;m not mistaken, CPPNs support this idea of regional\n&gt; selection\n&gt;&gt; very nicely, so I&#39;m not sure why you don&#39;t mention it here.\n&gt;&gt;\n&gt;&gt; Anyway, I totally agree that doing away with the &quot;negotiation&quot;\n&gt; step\n&gt;&gt; required for developmental systems using purely local interactions\n&gt; is\n&gt;&gt; a useful optimization, but I wouldn&#39;t be so quick to say that\n&gt; being\n&gt;&gt; able to &quot;pattern recognize&quot; certain areas serves the sole purpose\n&gt; of\n&gt;&gt; localization with respect to only the global coordinate system.\n&gt;&gt;\n&gt;&gt; I&#39;ll go into this issue in more detail in my talk at GECCO, but I\n&gt;&gt; think its very important, and our empirical results seem to back\n&gt; it\n&gt;&gt; up quite strongly.\n&gt;&gt;\n&gt;&gt; -- Joe\n&gt;&gt;\n&gt;&gt; http://www.cs.utexas.edu/~joeraii\n&gt;&gt;\n&gt;\n&gt;\n&gt;\n&gt;\n&gt;\n&gt; Yahoo! Groups Links\n&gt;\n&gt;\n&gt;\n\n\n"}}