{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[{"name":"READ"}]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"userId":151231063,"authorName":"Joseph Reisinger","from":"Joseph Reisinger &lt;joeraii@...&gt;","profile":"joeraii","replyTo":"LIST","senderId":"VVCdLCvsEoQHt3BL1MbHT3pxFKzAawjMP2R0xuMhlBOuylLjDfGMHWP4jZWXh8zNISZp6lhsaTf2AvTv_NWtDV9O4VQDT2Lddn3dbxgUxg","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [neat] Tile Coding and HyperNEAT","postDate":"1178881693","msgId":3266,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDNGMTQ2NDc4LUFCMTQtNEJGQi1CNEZELTA5QzUwM0VCMUFGNUBjcy51dGV4YXMuZWR1Pg==","inReplyToHeader":"PGYxNjJyMytidTU0QGVHcm91cHMuY29tPg==","referencesHeader":"PGYxNjJyMytidTU0QGVHcm91cHMuY29tPg=="},"prevInTopic":3249,"nextInTopic":3269,"prevInTime":3265,"nextInTime":3267,"topicId":3214,"numMessagesInTopic":27,"msgSnippet":"I ve been aching to reply to this post for a while, and I finally have enough free time to do so. I think we could have a really interesting discussion here,","rawEmail":"Return-Path: &lt;joeraii@...&gt;\r\nX-Sender: joeraii@...\r\nX-Apparently-To: neat@yahoogroups.com\r\nReceived: (qmail 55781 invoked from network); 11 May 2007 11:08:34 -0000\r\nReceived: from unknown (66.218.66.70)\n  by m50.grp.scd.yahoo.com with QMQP; 11 May 2007 11:08:34 -0000\r\nReceived: from unknown (HELO spunkymail-a9.g.dreamhost.com) (208.97.132.177)\n  by mta12.grp.scd.yahoo.com with SMTP; 11 May 2007 11:08:34 -0000\r\nReceived: from [192.168.1.250] (ZK107226.ppp.dion.ne.jp [222.5.107.226])\n\tby spunkymail-a9.g.dreamhost.com (Postfix) with ESMTP id 9B1A120ECE\n\tfor &lt;neat@yahoogroups.com&gt;; Fri, 11 May 2007 04:08:33 -0700 (PDT)\r\nMime-Version: 1.0 (Apple Message framework v752.2)\r\nIn-Reply-To: &lt;f162r3+bu54@...&gt;\r\nReferences: &lt;f162r3+bu54@...&gt;\r\nContent-Type: text/plain; charset=US-ASCII; delsp=yes; format=flowed\r\nMessage-Id: &lt;3F146478-AB14-4BFB-B4FD-09C503EB1AF5@...&gt;\r\nContent-Transfer-Encoding: 7bit\r\nDate: Fri, 11 May 2007 06:08:13 -0500\r\nTo: neat@yahoogroups.com\r\nX-Mailer: Apple Mail (2.752.2)\r\nX-eGroups-Msg-Info: 1:0:0:0\r\nFrom: Joseph Reisinger &lt;joeraii@...&gt;\r\nSubject: Re: [neat] Tile Coding and HyperNEAT\r\nX-Yahoo-Group-Post: member; u=151231063; y=wwK_yihFRmIpehy9em36SGHGKVZo-NeIz6YI75oc2jbsqw\r\nX-Yahoo-Profile: joeraii\r\n\r\nI&#39;ve been aching to reply to this post for a while, and I finally  \nhave enough free time to do so. I think we could have a really  \ninteresting discussion here, hopefully at least more interesting than  \nthe NFL tangent.\n\n&gt;&gt; Sure, but tile-coding does respect at least one form of geometry:\n&gt;&gt; Nearby elements in the state space are known to be nearby, and thus\n&gt;&gt; are grouped in the same tile.\n&gt;\n&gt; I have to dispute this characterization of tile coding\n&gt; as &quot;respecting at least one form of geometry.&quot; I think you are\n&gt; being unnecessarily equitable toward tile coding.\n&gt;\n&gt; What you are saying is that in effect taking a nice sculpture and\n&gt; cutting it into pieces &quot;respects&quot; its geometry because those little\n&gt; pieces are not broken up any further than that. It&#39;s like saying\n&gt; that someone who cut your head off &quot;respected&quot; your head by keeping\n&gt; its internal integrity intact. In fact, tile coding is peforming a\n&gt; grievous violation against the existing geometry of the domain, and\n&gt; does not deserve to be credited with respecting geometry\n&gt; whatsoever. I&#39;m hard pressed to imagine how one could do worse\n&gt; beyond cutting things up into even tinier and tinier bits; but even\n&gt; then, those bits still contain &quot;nearby elements in the state\n&gt; space.&quot; So that isn&#39;t saying much.\n\nYeah, from the way your framing this argument, e.g. tile-coding used  \nin the GA model-selection sense, you&#39;re absolutely right. I&#39;ll get  \nback to exactly what I mean by that in a bit. For now lets try to  \nreframe the issue from an RL perspective, which is where tile-codings  \nare predominantly used. In RL, the tile-coding is just a  \nrepresentation for a function approximator (in a sense its sort of  \nlike a really simple spline cure) that learns in a supervised manner.  \nTile coding makes a lot of sense in this domain because you can  \ncalculate with a good deal of precision how much some particular tile  \ndiffers from the expected value of the function being approximated  \n(in this case the Bellman error).\nTiles hat is cover a broad area where the value function changes a  \nlot (&quot;have bad fit&quot;, &quot;are too general&quot;, etc) are then split so that  \nthe subtiles can better fit the value function being learned. Note  \nthat there is very little generalization desired here; the best thing  \ngiven infinite computational resources would be to have a whole ton  \nof itty-bitty tiles that fit the value function perfectly.\n\nAnyway, since we&#39;re in the standard RL framework, there is really no  \nway of learning the &quot;geometry&quot; of a value function (well, technically  \nthere is, but thats a long tangent towards a really interesting  \nresearch area). Maybe if the geometry was given by the experimenter  \nbeforehand (this would also lead to an interesting extension of tile- \ncodings that you might like a little better). But in any case, since  \nall we&#39;re trying to do in RL is supervised function approximation,  \nthe lack of geometry isn&#39;t bad.\n\n\n&gt; I&#39;m obviously not a big fan of tile coding :) I&#39;m not really\n&gt; concerned whether it might do better in some cases; the problem with\n&gt; it is that it is a dead end for future progress because it is about\n&gt; ruining our ability to exploit geometric relationships.\n\nOk, this is where the discussion gets really interesting. Remember  \nwhen I mentioned GA&#39;s &quot;performing model selection&quot; or something like  \nthat before? Thats a fundamental difference in the GA approach and  \nRL. So what do I mean by model selection: roughly speaking, in  \nBayesian inference you have this idea of some separation of the  \nparameters you are optimizing (e.g. the weights in an NN) and the  \nmodel that generates those parameters (e.g. the topology of the NN,  \nor even whether you use an NN or decision tree or something). RL is  \ninherently incapable of performing model selection (at least outside  \nof NEAT+Q and some others). Once you start learning with  a given  \nvalue function representation, you can no longer switch to a  \ndifferent representation without throwing away everything you&#39;ve just  \nlearned.  GAs on the other hand learn one parameterized model per  \nindividual. This is an important distinction.\n\nNow, what does this have to do with tile coding and learning  \ngeometry?  When you talk about &quot;cutting up different variables&quot; you  \nare inherently making an argument from the standpoint of model  \nselection: i.e. what is the best representation for this learning  \nproblem? This is a valid question in the GA world, and I agree with  \nyou tile coding wouldn&#39;t work at all for learning good  \nrepresentations that allow good future learning. But from the RL  \nstandpoint, since all tile-coding is used for is function  \napproximation, I don&#39;t think they are as problematic as you imagine.\n\n-- Joe\n\n"}}