{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[{"name":"READ"}]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"userId":211599040,"authorName":"Jeff Clune","from":"Jeff Clune &lt;jclune@...&gt;","profile":"jeffreyclune","replyTo":"LIST","senderId":"cQ_yGlV3aEIknFRRi1IkZAbrC-vbUmo5i-omjT0E1W-8eDjyykF-Wx6QIPDZGbFxVtb5HwUQ2i7-TdclPuyDO6m3","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [neat] Re: What&#39;s Natural About Interactive Evolution (Warning: LONG message)","postDate":"1187320043","msgId":3529,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEMyRUE4OTJCLjFCRTc1JWpjbHVuZUBtc3UuZWR1Pg==","inReplyToHeader":"PGY5dHVuMitkN3NxQGVHcm91cHMuY29tPg=="},"prevInTopic":3516,"nextInTopic":3531,"prevInTime":3528,"nextInTime":3530,"topicId":3478,"numMessagesInTopic":28,"msgSnippet":"... Right. So I guess it depends on the human in your IEC has a long term goal in mind. Thus, the issue is not IEC, but a type of IEC. And this type of IEC is","rawEmail":"Return-Path: &lt;jclune@...&gt;\r\nX-Sender: jclune@...\r\nX-Apparently-To: neat@yahoogroups.com\r\nReceived: (qmail 52144 invoked from network); 17 Aug 2007 03:07:43 -0000\r\nReceived: from unknown (66.218.66.68)\n  by m52.grp.scd.yahoo.com with QMQP; 17 Aug 2007 03:07:43 -0000\r\nReceived: from unknown (HELO py-out-1112.google.com) (64.233.166.181)\n  by mta11.grp.scd.yahoo.com with SMTP; 17 Aug 2007 03:07:42 -0000\r\nReceived: by py-out-1112.google.com with SMTP id u77so835589pyb\n        for &lt;neat@yahoogroups.com&gt;; Thu, 16 Aug 2007 20:07:28 -0700 (PDT)\r\nDKIM-Signature: a=rsa-sha1; c=relaxed/relaxed;\n        d=gmail.com; s=beta;\n        h=domainkey-signature:received:received:user-agent:date:subject:from:to:message-id:thread-topic:thread-index:in-reply-to:mime-version:content-type:content-transfer-encoding:sender;\n        b=UrZv57lUXOCs+gy+Qo/3zED+XF9hLP+qozMm14Cr1k8zSTwolExR4CG/vOwCPId46RLiGF+VSMb+X26XFAkdxqew7w5CaFMylymQR5EpEiAyOgB5VC/jJflBxqNyP4Uye43JZk1XzVyShJpTgjEyliPUGUmExo86DlIsWRxi8nU=\r\nReceived: by 10.65.196.2 with SMTP id y2mr4404927qbp.1187320048103;\n        Thu, 16 Aug 2007 20:07:28 -0700 (PDT)\r\nReturn-Path: &lt;jclune@...&gt;\r\nReceived: from ?192.168.2.10? ( [24.23.79.232])\n        by mx.google.com with ESMTPS id 34sm5127327nza.2007.08.16.20.07.26\n        (version=TLSv1/SSLv3 cipher=OTHER);\n        Thu, 16 Aug 2007 20:07:26 -0700 (PDT)\r\nUser-Agent: Microsoft-Entourage/11.3.3.061214\r\nDate: Thu, 16 Aug 2007 23:07:23 -0400\r\nTo: &quot;neat@yahoogroups.com&quot; &lt;neat@yahoogroups.com&gt;\r\nMessage-ID: &lt;C2EA892B.1BE75%jclune@...&gt;\r\nThread-Topic: [neat] Re: What&#39;s Natural About Interactive Evolution\n (Warning: LONG message)\r\nThread-Index: Acfge7s4+dtJekxuEdywZwAX8sZ+PA==\r\nIn-Reply-To: &lt;f9tun2+d7sq@...&gt;\r\nMime-version: 1.0\r\nContent-type: text/plain;\n\tcharset=&quot;US-ASCII&quot;\r\nContent-transfer-encoding: 7bit\r\nX-eGroups-Msg-Info: 1:0:0:0\r\nFrom: Jeff Clune &lt;jclune@...&gt;\r\nSubject: Re: [neat] Re: What&#39;s Natural About Interactive Evolution\n (Warning: LONG message)\r\nX-Yahoo-Group-Post: member; u=211599040; y=jOselYy827MSvEo7lcPXPlrjRNwhNwI1aPvu3WscYqWMUwCWU8IN\r\nX-Yahoo-Profile: jeffreyclune\r\n\r\n&gt; Jeff, I went on too many tangents in my long post and thereby\n&gt; probably diluted my main point.  My main point was not about\n&gt; reaching any particular long term goal.  My point was that there is\n&gt; an analogy between the *process* of IEC and natural evolution.\n&gt; Remember that the original statement that spawned this discussion\n&gt; was about IEC being more natural than TBE.\n&gt; \n&gt; When you mention that IEC can no better reproduce an image than TBE\n&gt; (and that you had trouble with your tiger), you are really making my\n&gt; point.  As soon as you start setting a target (such as your tiger),\n&gt; you are in effect imposing TBE.  That is, an individual who starts\n&gt; playing with an IEC interface from scratch who is intent on\n&gt; achieving a particular image will be disappointed because they are\n&gt; basically just doing TBE.\n\nRight. So I guess it depends on the human in your IEC has a long term goal\nin mind. Thus, the issue is not IEC, but a type of IEC. And this type of IEC\nis similar to co-evolution and alife and even some types of TBE (those that\nleave a good cookie crumb trail).\n\nMaybe I misread you, but I also got the drift that you were saying that one\nof the reasons TBE is wrongheaded is because it seeks a particular goal. But\nthis criticism seems a bit odd, since they are interested in a particular\ngoal (e.g. A car part that does x, y and z). While the processes you herald\nmight be better for producing higher levels of complexity in general, they\nwon&#39;t produce a car part that works for our mechanical engineer. As such,\nTBE seems the right choice if you do have a goal in mind. I think most\npeople would agree with you that if you want to evolve complexity in general\nit is a bad idea to have it try to produce something specific.\n\n&gt; That&#39;s why I said, &quot;Stop telling evolution what you want and let\n&gt; evolution show you what it can do.&quot;  Evolution can do a lot of\n&gt; amazing things if we just let it show us the paths it is disposed to\n&gt; take.  IEC is a way of exploring all those paths with no particular\n&gt; purpose in mind (just like nature).\n\nOk. I think I agree with you with some types of EC. But there are many types\nof EC that are not TBE and do not suffer from this problem (e.g. most Alife,\nlike Avida). In those systems we still don&#39;t see things complexify like they\ndo in the natural world (i.e. We see nothing like open-ended evolution). So,\nthe problem is not ONLY TBE.\n\nI was hoping to hear whether you put projects like Golem or sims in the TBE\ncategory...what do you call something that has a more abstract goal like\n&quot;move far, fast.&quot; Do you think that suffers from the problems you outline\nwith TBE?\n\n&gt; In fact, I can even demonstrate to you that it is not just the CPPN\n&gt; encoding that is allowing the impressive results on Picbreeder\n&gt; because one such project on the internet actually already used\n&gt; DelphiNEAT-based encoding, but they implemented the collaboration\n&gt; with the traditional averaging method.  It&#39;s called the &quot;Living\n&gt; Image Project.&quot;  Look at the massive difference between what this\n&gt; system produces and Picbreeder (the Living Image Project has been\n&gt; going more than a year):\n&gt; \n&gt; http://w-shadow.com/li/\n&gt; \n\n I think these are pretty cool...and complex...and even show things like\nradial and bilateral symmetry! All this without hyperneat?!?  What was I\nsupposed to find lacking here?  I clearly do not have the trained eye for\nthese things that you do.\n\n&gt; It&#39;s important to note that I don&#39;t mean to pick on this project.\n&gt; It was one of the very few of its kind when it began and was\n&gt; genuinely groundbreaking.  Its author deserves to be commended and\n&gt; its a lot of fun to follow.  Yet it does show that when you are\n&gt; collating a mass of opinions, you cannot go off in a myriad of\n&gt; different directions.  In fact, you can barely move anywhere at\n&gt; all.  Collaborative Genetic Art installations of the past generally\n&gt; used this collating method (in one way or another) and produced\n&gt; images that look generally pretty, but don&#39;t show any real\n&gt; progression.\n\nWhat I have been saying has been lurking behind this discussion for a while,\nso let&#39;s bring it to the surface: how do you quantify progression? How do\nyou know (or why do you think) that picbreeder has more _____ (complexity?\nDiversity?) than this project?\n&gt; \n&gt; Anyway, the main point is that the multi-user branching-style of IEC\n&gt; (like Picbreeder) leads to a process that is more analogous to\n&gt; natural evolution than TBE.\n\nWhat you have created is a large world with different niches (niches being\nusers, types of users, etc.) It is more natural because the large number of\ndifferent niches increases the diversity of the population..and these niches\nchange and grow, partly in response to the existing population....all that\nhas a lot of things that the natural world has. So, I see where you are\ncoming from. And I can see how having the entire population shoot for one\ngoal could prevent that type of diversity. So, I understand some of the\nreasons you think a form of IEC (e.g. not the form I employed when searching\nfor the Tiger) have natural elements in them. Thanks for expositing them.\n\njeff\n\n&gt; \n&gt; ken\n&gt; \n&gt; --- In neat@yahoogroups.com, Jeff Clune &lt;jclune@...&gt; wrote:\n&gt;&gt; \n&gt;&gt; See below. \n&gt;&gt; \n&gt;&gt;&gt; image as a target and evaluate against that.  Could we then\n&gt; evolve a\n&gt;&gt;&gt; CPPN (or ANN if you prefer) that produces the desired image?\n&gt;&gt;&gt; \n&gt;&gt;&gt; The answer is surprising (we&#39;ve tried it!).  It turns out to be\n&gt; very\n&gt;&gt;&gt; hard with anything but the simplest of images.  What you discover\n&gt;&gt;&gt; quickly is that the fitness function isn&#39;t rewarding the right\n&gt;&gt;&gt; things.  The images tends to devolve into a gray cloud that\n&gt; minimizes\n&gt;&gt;&gt; error by choosing an intermediate shade- not what you want at\n&gt; all.\n&gt;&gt;&gt; \n&gt;&gt;&gt; Yet the issue is deeper than that.  In fact, here is what is\n&gt; really\n&gt;&gt;&gt; interesting: If you take any image (except the simplest ones) on\n&gt;&gt;&gt; Picbreeder- images that were evolved through IEC with NEAT- you\n&gt; will\n&gt;&gt;&gt; not be able to evolve to those same images through TBE with\n&gt; NEAT!  I\n&gt;&gt;&gt; challenge anyone to disprove me on this; I&#39;d be very interested.\n&gt;&gt;&gt; \n&gt;&gt;&gt; That is a remarkable observation: NEAT can&#39;t reproduce it&#39;s own\n&gt;&gt;&gt; results!  The only conclusion is that the selection method is the\n&gt;&gt;&gt; culprit.  That is, it has to do with how you decide what&#39;s good\n&gt; in\n&gt;&gt;&gt; any particular generation, which of course is different in IEC\n&gt; and\n&gt;&gt;&gt; TBE.\n&gt;&gt; \n&gt;&gt; But I&#39;ll bet you can&#39;t reproduce images using IEC either...I tried\n&gt; to get to\n&gt;&gt; a tiger looking shape and did not get very far (though I only\n&gt; stuck around\n&gt;&gt; for about 40 generations). Note: a tiger&#39;s entire body in profile,\n&gt; not a\n&gt;&gt; face. \n&gt;&gt; \n&gt;&gt;&gt; So let&#39;s look more closely at this issue:  How did we evolve\n&gt; images\n&gt;&gt;&gt; interactively that could not be reached through regular TBE?  The\n&gt;&gt;&gt; answer is that humans have a different way of rewarding\n&gt; intermediate\n&gt;&gt;&gt; results.  In particular, human breeders in IEC examine what is\n&gt; good\n&gt;&gt;&gt; *in the present* and make their decision based on that whereas\n&gt; TBE\n&gt;&gt;&gt; compares what you have in the present to a long-term future goal.\n&gt;&gt;&gt; \n&gt;&gt;&gt; Perhaps if you&#39;ve used Picbreeder or IEC you may think that you\n&gt; were\n&gt;&gt;&gt; actually evolving to a target and thus that I am wrong.  But\n&gt;&gt;&gt; Picbreeder disproves this view.  As soon as *someone else*\n&gt; branches\n&gt;&gt;&gt; from your image, whatever &quot;target&quot; you may have had in mind (if\n&gt; any)\n&gt;&gt;&gt; is irrelevant.  They have their own ideas about what is good.\n&gt; So it\n&gt;&gt;&gt; isn&#39;t possible that what the next person in the chain evolved was\n&gt;&gt;&gt; your original intent.\n&gt;&gt;&gt; \n&gt;&gt;&gt; On the other hand I may not need to go that far to make the point\n&gt;&gt;&gt; because if you&#39;re like me, you kind of discover what&#39;s cool as\n&gt; you\n&gt;&gt;&gt; go.  I may have a vague idea in mind, but on the road to that\n&gt; idea I\n&gt;&gt;&gt; see that something cool I hadn&#39;t thought of before pops up, so I\n&gt; go\n&gt;&gt;&gt; off in that direction instead.  What matters most is what&#39;s good\n&gt; in\n&gt;&gt;&gt; the present.\n&gt;&gt;&gt; \n&gt;&gt;&gt; Now here is the connection to natural evolution:  Natural\n&gt; evolution\n&gt;&gt;&gt; is also completely unconcerned with ultimate goals or targets.\n&gt; It\n&gt;&gt;&gt; only concerns itself with whether the present candidates are\n&gt; good in\n&gt;&gt;&gt; the present.  \n&gt;&gt;&gt; \n&gt;&gt;&gt; I am going to argue that that is a major source of its power; it\n&gt;&gt;&gt; explains in part its prolific creativity and its astounding\n&gt; ability\n&gt;&gt;&gt; to elaborate indefinitely.  Yes, I am claiming that it can do all\n&gt;&gt;&gt; that because it *doesn&#39;t* have a target.\n&gt;&gt; \n&gt;&gt; True, but the problem is not IEC vs TBE...it is long-term targets\n&gt; vs.\n&gt;&gt; something like co-evolution.\n&gt;&gt; \n&gt;&gt;&gt; So then what&#39;s so great about not having a target?  What&#39;s great\n&gt; is\n&gt;&gt;&gt; that you get rewarded for doing what you *can* do.  And a good\n&gt;&gt;&gt; encoding can do a lot.  However, what&#39;s very difficult, even for\n&gt; a\n&gt;&gt;&gt; good encoding, is to do a completely arbitrary complex thing\n&gt; that is\n&gt;&gt;&gt; nowhere close to the current population in the search space.\n&gt;&gt;&gt; \n&gt;&gt;&gt; That is why I called TBE a liability:  It evaluates the current\n&gt;&gt;&gt; candidates against something that ignores their current strengths\n&gt;&gt;&gt; completely.  For example, imagine if the first bilateria\n&gt; (bilaterally-\n&gt;&gt;&gt; symmetric organisms) were evaluated for their humanity.  They\n&gt; would\n&gt;&gt;&gt; all fail miserably and they would all therefore be eliminated.\n&gt;&gt;&gt; Humanity would never have evolved even though we in fact did\n&gt; evolve\n&gt;&gt;&gt; from the first bilateria!  If TBE were in charge and humans were\n&gt; the\n&gt;&gt;&gt; goal, we wouldn&#39;t exist right now.\n&gt;&gt;&gt; \n&gt;&gt;&gt; Try going back even farther.  Can you imagine evaluating single\n&gt;&gt;&gt; celled organisms for their &quot;human-ness?&quot;  That would be silly.\n&gt;&gt;&gt; \n&gt;&gt;&gt; Yet that is exactly what we are doing in most evolutionary\n&gt;&gt;&gt; experiments.  We do nothing to capture good intermediate ideas\n&gt; from\n&gt;&gt;&gt; which it would be possible to build our ultimate objectives.  So\n&gt; we\n&gt;&gt;&gt; are hampered from getting anywhere truly interesting.\n&gt;&gt; \n&gt;&gt; Is that true in experiments like Karl Sims, or in the Golem\n&gt; Project, were\n&gt;&gt; goals were things like &quot;whatever can move the farthest from the\n&gt; starting\n&gt;&gt; point in x seconds is more fit&quot;? It seems like you can equally\n&gt; judge\n&gt;&gt; bilaterals vs. humans on this goals (and man do those bilaterals\n&gt; suck...but\n&gt;&gt; they are probably better than single cells).\n&gt;&gt; \n&gt;&gt;&gt; \n&gt;&gt;&gt; Then you might ask, that&#39;s all well and good, but how in the\n&gt; world\n&gt;&gt;&gt; can we reward the intermediate serendipitous discoveries if we\n&gt; don&#39;t\n&gt;&gt;&gt; know what they should be?  The  answer is: Respect the fact that\n&gt; you\n&gt;&gt;&gt; don&#39;t know what they are.  Stop trying to *tell* evolution what\n&gt; it\n&gt;&gt;&gt; can do and let it *show* you what it can do.  When it shows you\n&gt;&gt;&gt; something cool, then keep that for later.  Keep everything with\n&gt; any\n&gt;&gt;&gt; promise for later.  You never know what might be a foundation\n&gt; for the\n&gt;&gt;&gt; next level up.\n&gt;&gt;&gt; \n&gt;&gt;&gt; That&#39;s exactly what natural evolution did and that&#39;s exactly\n&gt; what IEC\n&gt;&gt;&gt; (Picbreeder variety) does:  In nature what happened was that\n&gt; there\n&gt;&gt;&gt; were many ways of doing a good job (at surviving) and there was\n&gt; room\n&gt;&gt;&gt; enough on Earth to support a lot of them at once.  Nobody &quot;knew&quot;\n&gt;&gt;&gt; which ones would form a good foundation for something more\n&gt; complex\n&gt;&gt;&gt; (and many lineages didn&#39;t go anywhere), but because a lot of cool\n&gt;&gt;&gt; ideas were able to hang around, some of them happened to be good\n&gt;&gt;&gt; stepping stones to the next big thing.  The issue was where the\n&gt; DNA\n&gt;&gt;&gt; encoding could go next from where it is now.\n&gt;&gt;&gt; \n&gt;&gt;&gt; Same with IEC in Picbreeder:  We don&#39;t know what we want to\n&gt; evolve\n&gt;&gt;&gt; collectively.  I think it&#39;s fair to say that we have no\n&gt; collective\n&gt;&gt;&gt; common goal at all.  We are all just trying different paths.\n&gt; Some of\n&gt;&gt;&gt; us, when we see a cool path, take that path a bit farther and a\n&gt; bit\n&gt;&gt;&gt; farther still.  We keep all the intermediate stages around\n&gt; forever\n&gt;&gt;&gt; and we therefore preserve all possible stepping stones.  Some\n&gt; happen\n&gt;&gt;&gt; to be genuinely good foundations for future progress, like those\n&gt; that\n&gt;&gt;&gt; produced the car, or the recent skull.  Yet who would have seen\n&gt; that\n&gt;&gt;&gt; coming?  If we had tried to evolve to them from the start, we&#39;d\n&gt; be\n&gt;&gt;&gt; nowhere (we&#39;d be in the usual TBE trap).\n&gt;&gt;&gt; \n&gt;&gt;&gt; For this reason, what&#39;s going on in Picbreeder is really\n&gt; intriguing.\n&gt;&gt;&gt; It&#39;s the first artificial evolutionary experiment that is really\n&gt;&gt;&gt; doing something like natural evolution!  We may have some amazing\n&gt;&gt; \n&gt;&gt; Karl Sims had exhibits where the length of time people stood in\n&gt; front of an\n&gt;&gt; image determined its fitness...and there have been others that put\n&gt; the\n&gt;&gt; fitness evaluation in the hands of distributed users (one at Gecco\n&gt; this\n&gt;&gt; year, for example)...so, while I think that (because of the CPPN)\n&gt;&gt; picbreeder&#39;s images are cooler than what others are producing,\n&gt; isn&#39;t it a\n&gt;&gt; stretch to call it the first?\n&gt;&gt; \n&gt;&gt;&gt; encodings out there, but we don&#39;t get to see it because all we\n&gt; do is\n&gt;&gt;&gt; TBE, where we keep losing the intermediate foundations we would\n&gt; need\n&gt;&gt;&gt; to get to a new level.  Picbreeder is the first time that we let\n&gt;&gt;&gt; evolution show us what it can do instead of telling it what we\n&gt; want\n&gt;&gt;&gt; it to do.  We are respecting the encoding just as nature\n&gt; respected\n&gt;&gt;&gt; DNA.\n&gt;&gt;&gt; \n&gt;&gt;&gt; There are some important corollaries: First, TBE is not just\n&gt; about\n&gt;&gt;&gt; images.  In effect, all regular fitness functions have the same\n&gt; TBE\n&gt;&gt;&gt; liability.  Do you think you can evolve an amazing neural network\n&gt;&gt;&gt; with NEAT or with HyperNEAT?  Or something else?  Well, if you\n&gt; have a\n&gt;&gt;&gt; target behavior that you evaluate against, you are never going to\n&gt;&gt;&gt; know how amazing things could be.  This is a sobering\n&gt; realization.\n&gt;&gt;&gt; But it&#39;s just as true with behaviors as it is with images.  (This\n&gt;&gt;&gt; insight suggests that evolving behaviors interactively instead of\n&gt;&gt;&gt; through a fitness function is a really promising path)\n&gt;&gt;&gt; \n&gt;&gt;&gt; One exception is competitive coevolution, wherein individuals\n&gt;&gt;&gt; actually are evaluated against other individuals, so it&#39;s not\n&gt; really\n&gt;&gt;&gt; target-based.  In a sense individuals are recognized for being as\n&gt;&gt;&gt; good as they can be in the present.  Of course, nature is a kind\n&gt; of\n&gt;&gt;&gt; coevolution.\n&gt;&gt;&gt; \n&gt;&gt;&gt; Yet I don&#39;t want to pretend that competitive coevolution is the\n&gt;&gt;&gt; perfect pathway to complexity because the task may be defined in\n&gt; such\n&gt;&gt;&gt; a way that it might as well be necessary to solve some gigantic\n&gt;&gt;&gt; problem to become good.  For example, competitive coevolution on\n&gt; Go\n&gt;&gt;&gt; may not really end up rewarding individuals for finding really\n&gt; basic\n&gt;&gt;&gt; regularities that are necessary to eventually evolving a good Go\n&gt;&gt;&gt; player.\n&gt;&gt; \n&gt;&gt; This is a good place to reiterate my claim from above: would\n&gt; humans be any\n&gt;&gt; better at providing the right pathway to complexity for Go? I\n&gt; think you and\n&gt;&gt; I agree that the hard part is knowing what cookie crumb trail to\n&gt; leave the\n&gt;&gt; populations...but I don&#39;t know that IEC is better than co-\n&gt; evolution or\n&gt;&gt; (well-done) TBE at rewarding good intermediate steps. Maybe a good\n&gt; Go\n&gt;&gt; teacher could do a good job because it knows the correct path to\n&gt;&gt; complexity...but that is simply because they have learned how to\n&gt; teach\n&gt;&gt; (reward) Go players...so using them seems to be cheating a bit.\n&gt; Ironically,\n&gt;&gt; it is because they know the long term goal, and how to get there,\n&gt; that they\n&gt;&gt; can help players take longer routes through many valleys to higher\n&gt; peaks\n&gt;&gt; instead of rushing up the closest peak. So, here, it seems like\n&gt; long-term\n&gt;&gt; targets might actually be one of the reasons IEC is better! Except\n&gt; in humans\n&gt;&gt; it is a knowledge of long term goals *plus* a decent idea of the\n&gt; path to get\n&gt;&gt; there. For example, if an engineer was able to interactively\n&gt; evolve Karl\n&gt;&gt; Sims creature it could, with the right representations, make\n&gt; something like\n&gt;&gt; a ferrari....but the whole point of evolutionary computation to\n&gt; figure out\n&gt;&gt; how nature did it without long-term goals. No? As such, it seems\n&gt; less\n&gt;&gt; natural to me. \n&gt;&gt; \n&gt;&gt; As for why things complexified on Earth and they don&#39;t in EC...my\n&gt; leading\n&gt;&gt; theory (theories?) is that the Earth is just more massive (which\n&gt; leads to\n&gt;&gt; more parallel processing), spatially structured (which allows more\n&gt;&gt; diversity), co-evolving, has been running for a long time (if you\n&gt; chop off\n&gt;&gt; the last 20% of the run you don&#39;t get most higher-order life), and\n&gt;&gt; fine-grained (which increases the possibilities). Much of that\n&gt; does not\n&gt;&gt; exist in EC yet.\n&gt;&gt; \n&gt;&gt; \n&gt;&gt;  \n&gt;&gt;&gt; \n&gt;&gt;&gt; The key to natural evolution was that there were a lot of easy\n&gt; ways\n&gt;&gt;&gt; to do well in the beginning.  So we got a diversity of viable\n&gt; jumping\n&gt;&gt;&gt; off points.  That is also true on Picbreeder:  You can easily\n&gt; get a\n&gt;&gt;&gt; picture that&#39;s good enough to be worth showing others.  So it&#39;s\n&gt; got a\n&gt;&gt;&gt; very natural property: It proliferates jumping-off points too.\n&gt;&gt;&gt; \n&gt;&gt;&gt; If you like, you can think of Picbreeder as an ecology where the\n&gt;&gt;&gt; environment is just the preferences of its myriad users.  The\n&gt;&gt;&gt; environment in nature is just Earth and physics.  These are quite\n&gt;&gt;&gt; different environments, but their effect on the dynamics of\n&gt; selection\n&gt;&gt;&gt; form an analogy.  So at that level, it doesn&#39;t matter if a human\n&gt; is\n&gt;&gt;&gt; in the loop or not.  What humans like is just the environment.\n&gt; And\n&gt;&gt;&gt; the nice things is, humans are very sensitive to regularity and\n&gt;&gt;&gt; organization at all levels: exactly what a good environment\n&gt; should\n&gt;&gt;&gt; reward if we want to build up.\n&gt;&gt;&gt; \n&gt;&gt;&gt; I don&#39;t know where Picbreeder will go because part of it depends\n&gt; on\n&gt;&gt;&gt; how many users we get and how much they persevere.  So it may\n&gt; never\n&gt;&gt;&gt; produce great works of art; I&#39;d be surprised if it did.  Yet it\n&gt; has\n&gt;&gt;&gt; these intriguing ingredients that we have not had before, so it\n&gt; is a\n&gt;&gt;&gt; much more significant experiment than just a bunch of people\n&gt; playing\n&gt;&gt;&gt; with an art toy.\n&gt;&gt;&gt; \n&gt;&gt;&gt; Hopefully this endless message answers the question with some\n&gt; extra\n&gt;&gt;&gt; food for thought to boot.  I know there are a lot of\n&gt; controversial\n&gt;&gt;&gt; ideas here and please forgive me for not reminding you as I went\n&gt; that\n&gt;&gt;&gt; many such claims were merely speculation: I realize that they\n&gt; are,\n&gt;&gt;&gt; but if I acknowledged that every time I speculated this near-\n&gt; novel\n&gt;&gt;&gt; would be twice as long!  You can be sure that I am not trying to\n&gt;&gt;&gt; present these ideas as settled facts by any means.\n&gt;&gt; \n&gt;&gt; I enjoy the conversation. Thanks for starting it. :-)\n&gt;&gt; \n&gt;&gt;&gt; \n&gt;&gt;&gt; ken\n&gt;&gt;&gt; \n&gt;&gt;&gt; --- In neat@yahoogroups.com, &quot;Derek James&quot; &lt;djames@&gt; wrote:\n&gt;&gt;&gt;&gt; \n&gt;&gt;&gt;&gt; Ken wrote:\n&gt;&gt;&gt;&gt; \n&gt;&gt;&gt;&gt;&gt; Of course the reason it was possible is because humans are\n&gt; doing\n&gt;&gt;&gt; the\n&gt;&gt;&gt;&gt;&gt; evaluation- which yields another lesson: The fitness function\n&gt; in\n&gt;&gt;&gt; most\n&gt;&gt;&gt;&gt;&gt; evolutionary computation is a liability against getting to\n&gt; high-\n&gt;&gt;&gt; level\n&gt;&gt;&gt;&gt;&gt; complexity. There are deep reasons that human evaluation is\n&gt;&gt;&gt; actually\n&gt;&gt;&gt;&gt;&gt; more analogous to what happened over natural evolution than any\n&gt;&gt;&gt; other\n&gt;&gt;&gt;&gt;&gt; type of evaluation scheme we run on computers. We are often\n&gt; misled\n&gt;&gt;&gt;&gt;&gt; into believing that interactive evolution is less &quot;natural&quot;\n&gt; than\n&gt;&gt;&gt;&gt;&gt; normal EC. Actually, the opposite is true.\n&gt;&gt;&gt;&gt; \n&gt;&gt;&gt;&gt; Like Jeff, I&#39;d be interested in hearing you expand your\n&gt; thoughts on\n&gt;&gt;&gt; this.  I\n&gt;&gt;&gt;&gt; think the demonstration is no less impressive, but it seems to\n&gt; me\n&gt;&gt;&gt; that the\n&gt;&gt;&gt;&gt; distinction between natural and artificial selection is an\n&gt; important\n&gt;&gt;&gt;&gt; conceptual one.  Natural selection is based on the attributes\n&gt; of the\n&gt;&gt;&gt;&gt; environment, while artificial selection is the result of\n&gt; attributes\n&gt;&gt;&gt; selected\n&gt;&gt;&gt;&gt; by an agent (akin to animal breeding or horticulture).  In\n&gt; fact, in\n&gt;&gt;&gt; The\n&gt;&gt;&gt;&gt; Origin of Species, Darwin used many many examples of rapid\n&gt;&gt;&gt; evolutionary\n&gt;&gt;&gt;&gt; change in domesticated species such as pigeons and dogs to\n&gt; bolster\n&gt;&gt;&gt; his\n&gt;&gt;&gt;&gt; argument for his theory.\n&gt;&gt;&gt;&gt; \n&gt;&gt;&gt;&gt; Maybe you&#39;re taking issue with the terms &quot;natural&quot;\n&gt;&gt;&gt; and &quot;artificial&quot;, and\n&gt;&gt;&gt;&gt; maybe there are better ways to make the distinction (&quot;agent-\n&gt;&gt;&gt; directed&quot; vs.\n&gt;&gt;&gt;&gt; &quot;environment-directed&quot;, &quot;conscious&quot; vs. &quot;unconscious&quot;\n&gt; evolution...I\n&gt;&gt;&gt; don&#39;t\n&gt;&gt;&gt;&gt; know).  But while I don&#39;t think artificial selection is any less\n&gt;&gt;&gt; effective\n&gt;&gt;&gt;&gt; or powerful, probably moreso in some cases, I think it&#39;s useful\n&gt; to\n&gt;&gt;&gt; maintain\n&gt;&gt;&gt;&gt; that distinction.\n&gt;&gt;&gt;&gt; \n&gt;&gt;&gt;&gt; --Derek\n&gt;&gt;&gt;&gt; \n&gt;&gt;&gt; \n&gt;&gt;&gt; \n&gt;&gt; \n&gt; \n&gt; \n\n\n\n"}}