{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[{"name":"READ"}]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"userId":54567749,"authorName":"Kenneth Stanley","from":"&quot;Kenneth Stanley&quot; &lt;kstanley@...&gt;","profile":"kenstanley01","replyTo":"LIST","senderId":"a0LpPs1n5lB1aeP8hpJabIn4wBFB1U4oPDH3tzYs2teI9zo8JfH0r5a9trWhR1Bnu7xFGihFR7lx6lLl222mGyYNV_T7-PSaiDbx90vTPyZH","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Introducing a New Approach to Search: Novelty Search (New Paper)","postDate":"1210895440","msgId":4081,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGcwaWk4ZysxcGtzQGVHcm91cHMuY29tPg==","inReplyToHeader":"PFdvcmxkQ2xpZW50LUYyMDA4MDUxNjAwMTYuQUExNjAyMDEwNUBvY3RhZ2F0ZS5jb20+"},"prevInTopic":4080,"nextInTopic":4082,"prevInTime":4080,"nextInTime":4082,"topicId":4038,"numMessagesInTopic":26,"msgSnippet":"Mattias, Thank you for the thoughtful comments.  These exchanges are very helpful to our thinking about this new method and its promise. I would not want to","rawEmail":"Return-Path: &lt;kstanley@...&gt;\r\nX-Sender: kstanley@...\r\nX-Apparently-To: neat@yahoogroups.com\r\nX-Received: (qmail 19745 invoked from network); 15 May 2008 23:50:42 -0000\r\nX-Received: from unknown (66.218.67.97)\n  by m43.grp.scd.yahoo.com with QMQP; 15 May 2008 23:50:42 -0000\r\nX-Received: from unknown (HELO n10b.bullet.sp1.yahoo.com) (69.147.64.104)\n  by mta18.grp.scd.yahoo.com with SMTP; 15 May 2008 23:50:42 -0000\r\nX-Received: from [216.252.122.218] by n10.bullet.sp1.yahoo.com with NNFMP; 15 May 2008 23:50:42 -0000\r\nX-Received: from [66.218.69.1] by t3.bullet.sp1.yahoo.com with NNFMP; 15 May 2008 23:50:42 -0000\r\nX-Received: from [66.218.67.199] by t1.bullet.scd.yahoo.com with NNFMP; 15 May 2008 23:50:42 -0000\r\nDate: Thu, 15 May 2008 23:50:40 -0000\r\nTo: neat@yahoogroups.com\r\nMessage-ID: &lt;g0ii8g+1pks@...&gt;\r\nIn-Reply-To: &lt;WorldClient-F200805160016.AA16020105@...&gt;\r\nUser-Agent: eGroups-EW/0.82\r\nMIME-Version: 1.0\r\nContent-Type: text/plain; charset=&quot;ISO-8859-1&quot;\r\nContent-Transfer-Encoding: quoted-printable\r\nX-Mailer: Yahoo Groups Message Poster\r\nX-Yahoo-Newman-Property: groups-compose\r\nX-eGroups-Msg-Info: 1:6:0:0:0\r\nFrom: &quot;Kenneth Stanley&quot; &lt;kstanley@...&gt;\r\nSubject: Re: Introducing a New Approach to Search: Novelty Search (New Paper)\r\nX-Yahoo-Group-Post: member; u=54567749; y=5D8aC6ob0iedvQCk8cLcA-yX7zC7HMGV31gTiemtqiciGRiZoNy5\r\nX-Yahoo-Profile: kenstanley01\r\n\r\nMattias,\n\nThank you for the thoughtful comments.  These exchanges are very\n=\r\nhelpful to our thinking about this new method and its promise.\n\nI would not=\r\n want to imply that novelty search is a panacea (i.e. a\nsolution to everyth=\r\ning).  That would be a big mistake and if that is\nwhat we seem to be sugges=\r\nting, we need to refine our language.\n\nWhat we mean to suggest is that nove=\r\nlty search will indeed find\nsolutions (and things that are interesting and =\r\nuseful though perhaps\nnot &quot;solutions&quot; in the typical sense) in many cases w=\r\nhere objective\nfitness is paralyzed.  In other words, it makes more possibl=\r\ne,\nalthough it does not solve everything.\n\nThe concerns you raise are legit=\r\nimate, yet I do not think they are as\ngrave as you suggest for the followin=\r\ng reasons:\n\nProblem 1:  In fact, the &quot;dimensionality&quot; of a problem with res=\r\npect to\nnovelty is a more complicated and nuanced issue than you analysis\ni=\r\nmplies.  The maze domain in fact is very high dimensional, not just\n2-D.  W=\r\nhere are the other dimensions?  They are every single\n(x,y,angle) tuple for=\r\n every tick of the clock that an individual is\nactive.\n\nIt just so happens =\r\nthat in the paper we only measured novelty using\nthe final (x,y).  But that=\r\n was our decision and does not represent the\ndimensionality of the behavior=\r\n itself.\n\nThe interesting thing though is that recently we have been playin=\r\ng\nwith novelty search where *all* the (x,y) pairs are included in the\nbehav=\r\nior characterization and the novelty metric, making it very high\ndimensiona=\r\nl.  The big surprise is that in this domain is has no\neffect!  We are still=\r\n getting our heads around this fact.  In other\nwords, it is aware of the di=\r\nfference between an agent that veers\nslightly left, slightly right, zigzags=\r\n, etc., even if they come to the\nsame endpoint.  And yet, the maze is still=\r\n solved on average in the\nsame amount of evaluations as if we had ignored t=\r\nhis information. \nIt&#39;s really quite interesting.\n\nThis insight shows that &quot;=\r\ndimensionality&quot; is a multifaceted issue.  You\nmight then say that somehow t=\r\nhe dimensionality of the behavior is not\nthe issue, but rather the dimensio=\r\nnality of &quot;physical space&quot; is\nsomehow instrumental in determining the compu=\r\ntational complexity.  And\nthat is possible: If the maze were 8-dimensional,=\r\n it would possibly\nincrease the computation time exponentially.  \n\nYet on t=\r\nhe other hand, what physical-based problem exists in 8\ndimensions?  Real wo=\r\nrld problems generally do not take place in 8\ndimensional space.  Furthermo=\r\nre, even if adding dimensions does make\nthings slower, if we end up taking =\r\na year of exploration to produce\nsomething phenomenal, it isn&#39;t really a pr=\r\noblem that the computation\nwas expensive.  Rather, you might say that it&#39;s =\r\na *good* thing that we\nhave a method that can actually leverage that much c=\r\nomputation to\nproduce a solution, as opposed to fitness, which is lost rega=\r\nrdless of\nhow long we wait.  \n\nThere is obviously some fundamental issue st=\r\nill beyond our\nintellectual grasp here, because the dimensionality of physi=\r\ncal space\nseems to be a superficial concept that is not fundamental to sear=\r\nch. \nYet the dimensionality of the maze domain is hundreds of dimensions if=\r\n\nwe take all points crossed into account, and doing that has no effect\non p=\r\nerformance.  So we need to figure out what really matters and why-\na very i=\r\nnteresting subject.\n\nMy hunch right now is that one of the factors that mak=\r\nes\nhigh-dimension behavior space tractable is complexification and the\nstru=\r\ncture of the behavior space itself, which is a property of the\ngenotype-&gt;ph=\r\nenotype map.  In fact, it is possible the situation is\nsignificantly more p=\r\nalatable than you are guessing because novelty\nsearch with something like N=\r\nEAT moves from simple to complex networks.\n\nWithin the simple space of low-=\r\ndimensional neural networks, in fact,\nthere are not that many novel behavio=\r\nrs after all.  Just because the\nspace of all *conceivable* behaviors is pot=\r\nentially vast does not mean\nthat they all exist in the space of the simple =\r\nnetwork. \n\nThen, when networks complexify, only a few new types of behavior=\r\n open\nup at a time, and these tend to be related to their simpler\npredecess=\r\nor behaviors.  So in other words, we are climbing the ladder\nof complexity,=\r\n which means that, if the desired behavior is not some\nkind of radical irre=\r\ngular high-entropy mess, we are going to cross the\nsolution well before we =\r\nascend too high on the ladder.  Thus, just as\nwith fitness, novelty search =\r\nbenefits from complexification.\n\nIt helps to look at nature this way too.  =\r\nIt would be hard to believe\nif you showed me a single cell in a petri dish =\r\nthat all of nature on\nearth would descend from it, including humanity itsel=\r\nf, if I wait long\nenough.  Yet it would be true.  And you might argue that =\r\nit is simply\nnot possible because the space of phenotypes is so vast and fu=\r\nll of\nendless offshoots that go nowhere.  Yet that argument would be missin=\r\ng\nthe fact that nature complexifies.  We don&#39;t start out in the space of\nal=\r\nl phenotypes.  We start with a few good ones and elaborate on the\ninitial t=\r\nhemes.\n\nNot to mention indirect encoding: it tends to establish useful\nregu=\r\nlarities and then exploit and exploit them.  So novelty search can\ngo down =\r\nsuch paths as well.\n\nThus the situation currently *appears* less grave than=\r\n you suggest,\nyet at the same time, there is so much that is not well under=\r\nstood\nthat I would still hedge my bets.  But certainly it is an exciting\nop=\r\nportunity to explore and learn more.\n\nProblem 2:  Again, technically it cou=\r\nld happen that you walk down a\ntrail a while then get diverted and never ca=\r\nn come back through the\nsame point, but I think in practice that is probabl=\r\ny not a big problem. \n\nI like to think of the population as hot air in a ba=\r\nlloon looking to\nget out.  If it can&#39;t find a hole to escape, it will churn=\r\n and churn.\n And the more it churns, the more inhospitable the balloon beco=\r\nmes,\nbecause points keep getting added to the archive, making it denser and=\r\n\ndenser.  Eventually, some particles will bust through a hole.  It may\nnot =\r\nbe the hole that you are referring to as &quot;blocked,&quot; but it may\nnevertheless=\r\n lead to the same higher place (I would guess in real\nworld problems there =\r\nis rarely only one path to get from A to B).  \n\nEven if there is only one g=\r\nood path, let us say for some reason that\nnovelty search was repelled from =\r\ngoing back through it.  In that case,\nthe balloon is filling up with archiv=\r\ne points and it&#39;s getting more\nand more high-pressure in there.  Eventually=\r\n, the area of the path\nthat was covered is still less dense than the rest o=\r\nf the trapped air,\nand it will suddenly shoot down that path even though it=\r\n was once\nvisited before.  With novelty search, eventually, the path once t=\r\naken\nbecomes the path less taken, and thus becomes an attractor again.\n\nSo =\r\nevolution will not get stuck at a dead end.  Rather, it will slosh\naround g=\r\netting more and more frantic until it breaks free.  \n\nAnother thing to reme=\r\nmber is that these paths in the maze are not hard\nconstraints on where you =\r\ncan go through mutation.  A single mutation\ncan move you from one side of a=\r\n &quot;wall&quot; to another.  Thus there is more\nfreedom than meets the eye because =\r\nof stochasticity.\n\nNone of these arguments proves anything, of course.  The=\r\ny are just\nstories of what may happen.  But they show that the frailty or p=\r\nower\nof the methodology in general is still quite an open question that\nnee=\r\nds to be explored further to be settled.  Of course, I am guessing\nthere wi=\r\nll be some very interesting discoveries, but that&#39;s just my hunch.\n\nFinally=\r\n, by all means please share any criticism or concern that comes\nto mind.  T=\r\nhere&#39;s no harm in this kind of intellectual exchange and\nthere is no need t=\r\no apologize.  In fact, it&#39;s very productive.   I am\nexpecting a great deal =\r\nof dubiousness to novelty search.  After all,\nyou can&#39;t go and tell an audi=\r\nence of evolutionary computation\nscientists to give up fitness functions an=\r\nd expect a standing ovation :)\n\nken\n\n--- In neat@yahoogroups.com, &quot;Mattias =\r\nFagerlund&quot; &lt;mattias@...&gt; wrote:\n&gt;\n&gt; Ken, Joel, unfortunately I am not convi=\r\nnced of the merits of your\n&gt; suggested method,\n&gt; \n&gt; Problem 1, larger dimen=\r\nsionality problems,\n&gt; I must agree with Jeffs early assessment, the novelty=\r\n fitness function\n&gt; (NFF) is exceedingly well suited to solving these mazes=\r\n. That appears to\n&gt; be a strength, but to my mind only because the the dime=\r\nnsionality of the\n&gt; maze is severely limited. If the search was to be condu=\r\ncted in a 8\n&gt; dimensional maze instead, NFF would fill up it&#39;s &quot;previous no=\r\nvel\nsolution&quot;\n&gt; repository real fast but still be getting nowhere.\n&gt; \n&gt; Ken=\r\n, you state that since the agent has a limited amount of time to\nlive,\n&gt; se=\r\narching of dead area will end quickly since evolution will only search\n&gt; fo=\r\nr a limited time in any one direction. This is true, except that if\n&gt; there=\r\n are one more dimension, the area (volume actually) to search is\n&gt; radicall=\r\ny increased. And if there are two more dimensions, the area\n&gt; (what&#39;s the n=\r\name for m^4?) positively explodes. Thus even searching\n&gt; relatively close t=\r\no the starting position will result in vast amounts of\n&gt; tests. And without=\r\n any indication which route is better, searching\nof this\n&gt; hypercube (in th=\r\ne 4 dimension example) would go on for a very long time.\n&gt; Any tangent woul=\r\nd be equally viable, no matter whether they be actually\n&gt; better or not.\n&gt; =\r\n\n&gt; I&#39;m not saying a regular fitness function would perform better, it would=\r\n\n&gt; fail miserably just as well. This simply isn&#39;t a problem that\nevolution =\r\nis\n&gt; well adapted to solving - if there is no series of small incremental\ns=\r\nteps\n&gt; that bring you measurably (measured via fitness) closer to the goal,=\r\n\nthen\n&gt; you&#39;re toast. Small reversals in fitness can be handled by none-eli=\r\ntist\n&gt; methods (speciation etc), but not large ones.\n&gt; \n&gt; Problem 2, closin=\r\ng doorways that cannot be opened;\n&gt; I&#39;d guess that the one time out of 40 t=\r\nhat the NFF failed, it started\n&gt; early to investigate a deep alley in the m=\r\naze that brought it very close\n&gt; to the actual goal, but then the populatio=\r\nn shifted away from that alley\n&gt; and investigated another part of the maze =\r\ninstead. At that point, that\n&gt; particular alley is blocked for further inve=\r\nstigation - there&#39;s a\nbig gulf\n&gt; of no fitness improvements to traverse tha=\r\nt&#39;s simply so deep that\nnothing\n&gt; can make it across (evolve across) withou=\r\nt being killed off due to the\n&gt; fact that that part of the novelty space ha=\r\nd already been investigated\n&gt; (partially, but that&#39;s unknowable to the NFF)=\r\n. \n&gt; \n&gt; To explain it in a simpler scenario. Say you have two corridors, on=\r\ne\n&gt; leading left for 8 units and one leading right for 16 units, where the\n=\r\n&gt; goal actually is. Evolution starts going right (actually towards the\ngoal=\r\n,\n&gt; but that&#39;s invisible to the MFF) and it reaches 10 units, when it\nrando=\r\nmly\n&gt; discovers a nice area to the left to investigate. All resources are\n&gt;=\r\n shifted to the left area but that way lies a dead end. At that\npoint, when=\r\n\n&gt; the dead end is reached, evolution is stuck with the fact that there is\n=\r\n&gt; absolutely NO fitness gradient to climb at all, because further\nevolution=\r\n\n&gt; to the left is penalized because the area has been exhaustively\nsearched=\r\n,\n&gt; and to the right, there&#39;s a great gulf of also searched area, beyond\nwh=\r\nich\n&gt; the goal lies.\n&gt; \n&gt; The larger the maze and the more of these limitin=\r\ng doorways there\nare, the\n&gt; greater the chance that one of them will be blo=\r\ncked off by prematurely\n&gt; shifting focus.\n&gt; \n&gt; Sorry to be such a downer, r=\r\naining on your parade and all that. There\n&gt; might be situations where this =\r\nmethod works wonders, but to be a\npanacea,\n&gt; further thinking is, to my min=\r\nd, required.\n&gt; \n&gt; with regards,\n&gt; mattias\n&gt;\n\n\n\n"}}