{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[{"name":"READ"}]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"userId":54567749,"authorName":"Kenneth Stanley","from":"&quot;Kenneth Stanley&quot; &lt;kstanley@...&gt;","profile":"kenstanley01","replyTo":"LIST","senderId":"0mOJbefsEr-yTDn_VCUujrEF3Ke-yU2IOfDAOWwkCOFBj2St04OyCyFbPHfJeQLGgV2cwjyNTdv4xRxnEM5n17iuRTqQqIwmHZGTHG-s9QVQ","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: Random Complexification","postDate":"1077269284","msgId":412,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGMxNGp2NCtxZmY2QGVHcm91cHMuY29tPg==","inReplyToHeader":"PDIwMDQwMjE4MTYxMjAwLjg3OTczLnFtYWlsQHdlYjYwNTA1Lm1haWwueWFob28uY29tPg=="},"prevInTopic":406,"nextInTopic":413,"prevInTime":411,"nextInTime":413,"topicId":371,"numMessagesInTopic":22,"msgSnippet":"... First, generation champions are quite different from *dominant solutions*.  One generation champion is not guaranteed to be better than another, even if it","rawEmail":"Return-Path: &lt;kstanley@...&gt;\r\nX-Sender: kstanley@...\r\nX-Apparently-To: neat@yahoogroups.com\r\nReceived: (qmail 9660 invoked from network); 20 Feb 2004 09:28:05 -0000\r\nReceived: from unknown (66.218.66.217)\n  by m11.grp.scd.yahoo.com with QMQP; 20 Feb 2004 09:28:05 -0000\r\nReceived: from unknown (HELO n23.grp.scd.yahoo.com) (66.218.66.79)\n  by mta2.grp.scd.yahoo.com with SMTP; 20 Feb 2004 09:28:05 -0000\r\nReceived: from [66.218.67.249] by n23.grp.scd.yahoo.com with NNFMP; 20 Feb 2004 09:28:05 -0000\r\nDate: Fri, 20 Feb 2004 09:28:04 -0000\r\nTo: neat@yahoogroups.com\r\nMessage-ID: &lt;c14jv4+qff6@...&gt;\r\nIn-Reply-To: &lt;20040218161200.87973.qmail@...&gt;\r\nUser-Agent: eGroups-EW/0.82\r\nMIME-Version: 1.0\r\nContent-Type: text/plain; charset=ISO-8859-1\r\nContent-Length: 8241\r\nX-Mailer: Yahoo Groups Message Poster\r\nX-eGroups-Remote-IP: 66.218.66.79\r\nFrom: &quot;Kenneth Stanley&quot; &lt;kstanley@...&gt;\r\nSubject: Re: Random Complexification\r\nX-Yahoo-Group-Post: member; u=54567749\r\nX-Yahoo-Profile: kenstanley01\r\n\r\n--- In neat@yahoogroups.com, Derek James &lt;blue5432@y...&gt; wrote:\n&gt; --- Kenneth Stanley &lt;kstanley@c...&gt; wrote:\n&gt; &gt; The key point that is perhaps not clear is that the\n&gt; &gt; lines\n&gt; &gt; in the middle are *not* graphs of average\n&gt; &gt; complexity, but \n&gt; &gt; rather of *dominant&#39;s complexity*.  \n&gt; \n&gt; Yes, I understand that.\n&gt; \n&gt; That was essentially my criticism.  You&#39;re comparing:\n&gt; \n&gt; --The complexity of generational champions (averaged\n&gt; from 13 separate runs)\n&gt; --The max and min complexity each generation (averaged\n&gt; from 5 random runs)\n&gt; \n&gt; Why not compare:\n&gt; \n&gt; --The complexity of generational champions in\n&gt; fitness-based runs\n&gt; --The average complexity of the entire population in\n&gt; random-fitness runs\n&gt; \n&gt; The question you pose in section 6.1 is: &quot;[D]oes the\n&gt; complexity always increase whether it helps in finding\n&gt; good solutions or not?&quot;\n&gt; \n&gt; Wouldn&#39;t the latter comparison provide better insight\n&gt; into answering this question?\n\nFirst, generation champions are quite different from *dominant\nsolutions*.  One generation champion is not guaranteed to be better\nthan another, even if it came later, while dominant solutions are\n*always* strictly better.  In other words, we are interested in how\ncomplexity correlates to *strict improvement*, not just how it\ncorrelates to the current champion.\n\nBearing this in mind, the average complexity of random fitness runs\ntells us nothing, because we have no interest in what the average\ncomplexity of something that is *not* strictly better would be.  All\nthat would show is that when fitness does not improve, average\ncomplexity goes up.  But the whole point of this experiment is what\ncould happen when strategies *do* strictly improve.\n\nSo we want to know, does complexity *have* to go up when dominance\ngoes up?  That&#39;s the question; is it inevitable that complexity would\ngo up in NEAT?  And the way to know this is to check whether NEAT\nkeeps around solutions of very low complexity.  Because if it does,\nthen those *could* be the most dominant solutions.  The random fitness\nruns show that indeed NEAT does keep around simple solutions.  Yes,\nthe average complexity goes up, but average complexity has absolutely\nnothing to do with dominant complexity.  Average complexity is just a\nmeasure of the midlevel of the complexities kept in the system.  What\nwe want to know is, from what range of complexities could a dominant\nappear?  Because if it can appear from a full range from very simple\nto very complex, then if it actually *does* become complex, it is\nbecause that complexity was beneficial (since, after all, simpler\ntopologies were available in the population).  \n\n&gt; \n&gt; You&#39;re asking if the complexity always increases.  But\n&gt; you don&#39;t say which complexity you&#39;re referring to. \n&gt; If you&#39;re referring to the overall complexity of the\n&gt; evolving population, it seems very clear that yes, the\n&gt; complexity of the population always increases, whether\n&gt; or not a fitness evaluation is used.\n&gt; \n\nWe&#39;re asking about the complexity of *dominant* solutions.  Does it\nhave to go up?  \n\n\n&gt; \n&gt; You said something similar in an earlier thread.  I\n&gt; still don&#39;t see how the concept of &quot;competitive&quot;\n&gt; applies to a population with no selection pressure due\n&gt; to fitness being applied to it.\n&gt; \n\nCompetitive just means that on average you are just as good\nas everyone else.  And when your fitness is random, that\nis true, i.e. with random fitness all solutions are equal.\nIn other words, it simulates the time *between* improvements.\nIt shows that during interim periods, when fitness is not\nimproving on average, NEAT keeps the simplest topologies\naround.  It doesn&#39;t lose them.\n\n&gt; It seems to me that simple topologies probably persist\n&gt; in a random-fitness run of NEAT due to the effects of\n&gt; speciation.\n&gt; \n\nYes that&#39;s why they persist.  That&#39;s the whole point.\nNEAT keeps the simple stuff around as long as it isn&#39;t\ndoing significantly worse.  That&#39;s what&#39;s so nice!\nGP systems suffer bloat because they can&#39;t protect their\nsimplest solutions.  NEAT protects its simple solutions\nin their own species, so they don&#39;t bloat.\n\n&gt; \n&gt; &gt; Rather, the claim is that\n&gt; &gt; increasing\n&gt; &gt; sophistication is a result of increasing complexity,\n&gt; &gt; and\n&gt; &gt; further that the reason increasing complexity pairs\n&gt; &gt; with\n&gt; &gt; increasing sophistication is NOT because of some\n&gt; &gt; nuance of\n&gt; &gt; NEAT; it is because it is fundamentally advantageous\n&gt; &gt; to have \n&gt; &gt; more structure in this domain.\n&gt; \n&gt; But in section 6.3 you go on to demonstrate that both\n&gt; fixed-topology runs and simplification runs show an\n&gt; increase in fitness.\n&gt; \n\nThe point is certainly not that fitness cannot increase when\ntopologies are kept static.  Rather, the point is that when\ntopologies can complexify, that complexification is used to\nadvantage.  In other words, the system uses increases in \ncomplexity to increase fitness even though it doesn&#39;t have to.\n\n&gt; What that demonstrates to me is that complexification\n&gt; is not *necessary* to increase performance in this\n&gt; domain, but that it is a more effective way of\n&gt; increasing performance in this domain.  Right?\n&gt; \n\nYes, agreed.  What we are trying to say is that increasing \ncomplexity helped increase dominance in this domain.\n\n&gt; &gt; But\n&gt; &gt; what about when you are NOT stagnating- that&#39;s\n&gt; &gt; what&#39;s \n&gt; &gt; interesting- in that case, adding structure opens\n&gt; &gt; the door\n&gt; &gt; to more and more sophisticated behavior.\n&gt; &gt; \n&gt; &gt; I don&#39;t think anyone who uses NEAT really finds that\n&gt; &gt; controversial; after all, that&#39;s the whole reason we\n&gt; &gt; are using NEAT isn&#39;t it?  ...because we want to be\n&gt; &gt; able\n&gt; &gt; to find more and more complex solutions, because we \n&gt; &gt; believe that will lead to more and more interesting \n&gt; &gt; behavior.  \n&gt; \n&gt; I certainly believe that NEAT&#39;s approach of starting\n&gt; minimally and complexifying is a very clever and\n&gt; effective way of searching the solution space of a\n&gt; given domain.\n&gt; \n&gt; But I&#39;d probably qualify this last sentence of yours. \n&gt; I don&#39;t necessarily want to find more complex\n&gt; solutions...I want to find the best solutions.  That\n&gt; includes efficiency.  \n&gt; \n\nYes of course, I agree.  But what I mean to say is that\nin a lot of domains, the best solutions are complex.  So\nwe need some way of getting there.\n\n&gt; If I start out with a minimal topology in Tic-Tac-Toe\n&gt; (99 genes--9 input, 9 output, 81 connections), and\n&gt; that topology is sufficient to produce a perfect\n&gt; player, I don&#39;t want to evolve something with twice as\n&gt; many genes.\n&gt; \n&gt; I think this may be a intellectual trap of sorts. \n&gt; We&#39;re evolving neural networks, which control the\n&gt; behavior of a system.  I think it may be misleading to\n&gt; assume that an increase in the complexity of behavior\n&gt; of an individual necessarily leads to an increase in\n&gt; fitness.\n&gt; \n\nI never meant to imply anything like that.   That is\na blanket statement.  Most increases in complexity actually\ndecrease fitness.  However, note that every high dimensional\nspace has a global optimum at least as high if not higher\nthan that of any subspace it completely contains.  \nIn other words, theoretically, you can only win by adding \ndimensions.  Of course that does not mean you *should* always\ndo so...what you should do is only add them if you need to.\nBut in really tough domains, it&#39;s clear that it will be\nnecessary to complexify to some extent.\n\n&gt; [stuff about simple/complex animals]\n&gt; So complex behavior doesn&#39;t necessarily lead to an\n&gt; increase in fitness...wouldn&#39;t you agree?\n&gt; \n\nEmpirical results only apply to the domain of the experiment.  \nOur analysis was of our empirical results.  Of course there\nare always going to be different domains.\n\nYour counterexamples beg the question, do you mean\nto imply that a system that cannot complexify would \ndisplay a better arms race?  If that is not your implication,\nwhat is your counterexample meant to imply?  The paper\ndoesn&#39;t claim that everything more complex is better in\nevery case than everything simple.\n\nVery good discussion- I agree these are important issues to think\nabout.  I apologize for my perhaps overzealous defense of our\nanalysis- I feel it is actually good practice for me to try to respond\nto these kind of questions, especially considering I will eventually\nhave interviews where similar arguments may come up.\n\nken\n\n\n"}}