{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[{"name":"READ"}]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"userId":34004016,"authorName":"Derek James","from":"Derek James &lt;blue5432@...&gt;","profile":"blue5432","replyTo":"LIST","senderId":"eAVbqAUPmFapU1BO4sS0GPbtOvYgfW4Ya56NDTAHSeOmzWi93ZuBi8Y3Ahbv5m-r8etqbe1l9uNUZhwLMNtJTHuc7mSvkR8","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [neat] Re: Random Complexification","postDate":"1077296626","msgId":413,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDIwMDQwMjIwMTcwMzQ2LjMwMTA5LnFtYWlsQHdlYjYwNTAyLm1haWwueWFob28uY29tPg==","inReplyToHeader":"PGMxNGp2NCtxZmY2QGVHcm91cHMuY29tPg=="},"prevInTopic":412,"nextInTopic":0,"prevInTime":412,"nextInTime":414,"topicId":371,"numMessagesInTopic":22,"msgSnippet":"... Ah...okay.  I d skimmed over the fact that you were using a Dominance Tournament approach. ... Yes.  That s what I thought the point of comparing a ","rawEmail":"Return-Path: &lt;blue5432@...&gt;\r\nX-Sender: blue5432@...\r\nX-Apparently-To: neat@yahoogroups.com\r\nReceived: (qmail 40551 invoked from network); 20 Feb 2004 17:03:47 -0000\r\nReceived: from unknown (66.218.66.172)\n  by m6.grp.scd.yahoo.com with QMQP; 20 Feb 2004 17:03:47 -0000\r\nReceived: from unknown (HELO web60502.mail.yahoo.com) (216.109.116.123)\n  by mta4.grp.scd.yahoo.com with SMTP; 20 Feb 2004 17:03:47 -0000\r\nMessage-ID: &lt;20040220170346.30109.qmail@...&gt;\r\nReceived: from [204.146.199.2] by web60502.mail.yahoo.com via HTTP; Fri, 20 Feb 2004 09:03:46 PST\r\nDate: Fri, 20 Feb 2004 09:03:46 -0800 (PST)\r\nTo: neat@yahoogroups.com\r\nIn-Reply-To: &lt;c14jv4+qff6@...&gt;\r\nMIME-Version: 1.0\r\nContent-Type: text/plain; charset=us-ascii\r\nX-eGroups-Remote-IP: 216.109.116.123\r\nFrom: Derek James &lt;blue5432@...&gt;\r\nSubject: Re: [neat] Re: Random Complexification\r\nX-Yahoo-Group-Post: member; u=34004016\r\nX-Yahoo-Profile: blue5432\r\n\r\n--- Kenneth Stanley &lt;kstanley@...&gt; wrote:\n&gt; First, generation champions are quite different from\n&gt; *dominant solutions*.  \n\nAh...okay.  I&#39;d skimmed over the fact that you were\nusing a Dominance Tournament approach.\n\n&gt; Bearing this in mind, the average complexity of\n&gt; random fitness runs\n&gt; tells us nothing, because we have no interest in\n&gt; what the average\n&gt; complexity of something that is *not* strictly\n&gt; better would be.  All\n&gt; that would show is that when fitness does not\n&gt; improve, average\n&gt; complexity goes up.  \n\nYes.  That&#39;s what I thought the point of comparing a\nfitness-based run to a random-fitness run was all\nabout.\n\n&gt; But the whole point of this\n&gt; experiment is what\n&gt; could happen when strategies *do* strictly improve.\n&gt; \n&gt; So we want to know, does complexity *have* to go up\n&gt; when dominance goes up?  That&#39;s the question; is it\n&gt; inevitable that complexity would\n&gt; go up in NEAT?  \n\nThese still seem like two different questions to me.\n\nAnd again, the answer the first question seems, in\ngeneral, to be no.  Your fixed-topology experiment\nalone demonstrates this.  No complexification at all\nis necessary for fitness to improve, so complexity\ndoesn&#39;t have to go up when dominance goes up.\n\nAnd the answer to the second question still seems to\nbe yes. The max complexity, the average complexity,\nand even the minimum complexity all increase in a\nrandom population.  The min complexity doesn&#39;t\nincrease very much, but there&#39;s still complexification\ngoing on. \n\n&gt; The random fitness\n&gt; runs show that indeed NEAT does keep around simple\n&gt; solutions.  \n\nMaybe it is still a quibble over semantics, but I\nwouldn&#39;t refer to any individual in a random run as a\n&quot;solution&quot;.  Simple architectures persist in a random\nrun, alongside other species that are growing\nincreasingly complex.\n\nThis allows NEAT to retain a broad spectrum of\n*potential* solutions if and when a fitness function\nis applied, but I&#39;m not sure that range is really any\ndifferent whether or not selection pressure is being\napplied to the population.\n\nThat&#39;s essentially where I think there&#39;s a mismatch. \nI understood your paper to be asserting that the\ndynamics of a fitness-based run and a random-fitness\nrun were fundamentally different.  But I don&#39;t think\nthey are...and the data as presented doesn&#39;t seem to\ngive enough information to draw that conclusion.\n\n&gt; Yes that&#39;s why they persist.  That&#39;s the whole\n&gt; point.\n&gt; NEAT keeps the simple stuff around as long as it\n&gt; isn&#39;t\n&gt; doing significantly worse.  \n\nWell, it keeps simple architectures around whether or\nnot they&#39;re being judged at all.  In a random run it&#39;s\nnot a matter of doing &quot;better&quot; or &quot;worse&quot;, since there\nis no standard of measurement.\n\n&gt; The point is certainly not that fitness cannot\n&gt; increase when\n&gt; topologies are kept static.  Rather, the point is\n&gt; that when\n&gt; topologies can complexify, that complexification is\n&gt; used to\n&gt; advantage.  In other words, the system uses\n&gt; increases in \n&gt; complexity to increase fitness even though it\n&gt; doesn&#39;t have to.\n\nThe system is good at exploiting complexity, leading\nto proportionally better fitness gains than a\nfixed-topology run.  This makes sense...I thought\nbefore that you might have been asserting that\ncomplexity was necessary for an increase in fitness in\nthis domain.  If so, I misunderstood.\n\n&gt; Yes, agreed.  What we are trying to say is that\n&gt; increasing \n&gt; complexity helped increase dominance in this domain.\n\nProportionally more than fixed-topology or\nsimplification-alone techniques, right?\n\n&gt; Yes of course, I agree.  But what I mean to say is\n&gt; that\n&gt; in a lot of domains, the best solutions are complex.\n&gt;  So\n&gt; we need some way of getting there.\n\nRight...I agree.  All I&#39;ve asserted all along is that\nif solutions become more complex than necessary, it\nmay be a good idea to have a way of scaling back that\ncomplexity.\n\n&gt; I never meant to imply anything like that.   That is\n&gt; a blanket statement.  Most increases in complexity\n&gt; actually\n&gt; decrease fitness.  However, note that every high\n&gt; dimensional\n&gt; space has a global optimum at least as high if not\n&gt; higher\n&gt; than that of any subspace it completely contains.  \n&gt; In other words, theoretically, you can only win by\n&gt; adding \n&gt; dimensions.  Of course that does not mean you\n&gt; *should* always\n&gt; do so...what you should do is only add them if you\n&gt; need to.\n&gt; But in really tough domains, it&#39;s clear that it will\n&gt; be\n&gt; necessary to complexify to some extent.\n\nOkay...then we really aren&#39;t far apart in our\nthinking. :)\n\n&gt; Your counterexamples beg the question, do you mean\n&gt; to imply that a system that cannot complexify would \n&gt; display a better arms race?  \n\nNo, certainly not.  I think incremental\ncomplexification, as you&#39;ve demonstrated, is more\neffective than systems that do not allow\ncomplexification or that start with high random\ncomplexity and prune.  I&#39;m not disputing that.\n\n&gt; If that is not your\n&gt; implication,\n&gt; what is your counterexample meant to imply?  \n\nI mean to imply that in an arms race, populations with\nsimplification in their toolbox (along with\ncomplexification) would probably have a distinct\nadvantage over populations that can only complexify.\n\nLet&#39;s say two hypothetical species, predator and prey,\nhave developed highly sophisticated behavioral\npatterns when confronting one another.  The prey has\nevolved all sorts of evasion heuristics, along with\naccompanying physical attributes, to try to escape the\npredator.  The predator has tried to keep up with the\narms race by evolving its own set of tracking\nheuristics.\n\nNow let&#39;s say the environment has convenient hiding\nplaces.  A predator that simply hunkers down in the\nshadows and waits for one of the prey to walk by can\neasily snatch them up for a meal.\n\nIn fact, this is very much like the evolved behavior\nof one of your dominant bot strategies, isn&#39;t it?  The\nbot waits until it&#39;s opponent scurries around and\ndepletes a lot of its energy, then pounces at the last\nminute.\n\nYou describe this strategy as more sophisticated than\none which actively seeks out food throughout the\nenvironment, but this estimation seems subjective.\n\nWhich strategy really is more complex, behaviorally?\n\nCould the &quot;wait-and-pounce&quot; heuristic be represented\nby a much less complex network?  Can you conclusively\nsay one way or the other?\n\nOne of your best solutions has over 200 connections\nand 11 hidden nodes.  Could the same behavior be\nrepresented by a much less complex network?  How do\nyou know that all of that complexity is necessary?\n\nWhat I&#39;m suggesting is that, NEAT&#39;s approach is to\nincrementally add complexity across a broad range of\narchitectures, and it keeps simple designs around as\nother potential starting points.  But in some cases,\nit may be more beneficial for the dominant strategies\nto simplify.\n\nA marine animal that evolves from an active predator\nto one that hides in a coral nook needs very simple\nheuristics to catch prey--if one appears in front of\nmy nook, snap and grab.  This behavior is much less\ncomplex than an active predator who has to swim around\nlooking for prey, trying to distinguish them from all\nsorts of background noise, and then once finding them\nhaving to chase them down, zigging and zagging after\nthem.  And this has happened in nature.  Complex\nbehavior has given way to the evolution of less\ncomplex behavior...because it made the species more\nfit.\n\nMy view is that simplification is probably an\nextremely effective tool in most arms races.  In\nsituations where both sides have developed elaborate\ninteractions, an individual strategy that is more\nsimple and direct may be much more effective.\n\n&gt; Very good discussion- I agree these are important\n&gt; issues to think\n&gt; about.  I apologize for my perhaps overzealous\n&gt; defense of our\n&gt; analysis- I feel it is actually good practice for me\n&gt; to try to respond\n&gt; to these kind of questions, especially considering I\n&gt; will eventually\n&gt; have interviews where similar arguments may come up.\n\nSure...healthy, direct discussions are a good thing.\n:)\n\nI think you had mentioned that the addition of the\nsimplification-only experiment was at the request of\none of the paper&#39;s reviewers.  Is that right?  Was\nthis second paper reviewed again, by the same\nreviewers as the first?  What kind of feedback did you\nreceive?  I&#39;m just wanting a bit of insight into the\nprocess.\n\nDerek\n\n__________________________________\nDo you Yahoo!?\nYahoo! Mail SpamGuard - Read only the mail you want.\nhttp://antispam.yahoo.com/tools\n\n"}}