{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[{"name":"READ"}]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"userId":115403844,"authorName":"John Arrowwood","from":"&quot;John Arrowwood&quot; &lt;jarrowwx@...&gt;","profile":"jarrowwx","replyTo":"LIST","senderId":"9yFUzCr7DFdpqyiX9QdaLTsVtipDfrUbYVyM6WCe5q8AcKBjRy9MgvPE5nWYNAshBVLYRDmDwQj7hG3893P1i1yrp7wKxWE9ok7s9qTT","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Training/testing subset selection","postDate":"1077757450","msgId":433,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEJBWTItRjI1RDk2ZG9DZWtwOHQwMDAwODFjMUBob3RtYWlsLmNvbT4="},"prevInTopic":0,"nextInTopic":435,"prevInTime":432,"nextInTime":434,"topicId":433,"numMessagesInTopic":9,"msgSnippet":"I wanted to get some feedback on the evolutionary process, and how much evaluation is enough ... I have analyzed 421 pictures so far (out of 3110).  That","rawEmail":"Return-Path: &lt;jarrowwx@...&gt;\r\nX-Sender: jarrowwx@...\r\nX-Apparently-To: neat@yahoogroups.com\r\nReceived: (qmail 52068 invoked from network); 26 Feb 2004 01:04:24 -0000\r\nReceived: from unknown (66.218.66.172)\n  by m14.grp.scd.yahoo.com with QMQP; 26 Feb 2004 01:04:24 -0000\r\nReceived: from unknown (HELO hotmail.com) (65.54.247.25)\n  by mta4.grp.scd.yahoo.com with SMTP; 26 Feb 2004 01:04:11 -0000\r\nReceived: from mail pickup service by hotmail.com with Microsoft SMTPSVC;\n\t Wed, 25 Feb 2004 17:04:11 -0800\r\nReceived: from 64.122.44.102 by by2fd.bay2.hotmail.msn.com with HTTP;\n\tThu, 26 Feb 2004 01:04:10 GMT\r\nX-Originating-Email: [jarrowwx@...]\r\nX-Sender: jarrowwx@...\r\nTo: neat@yahoogroups.com\r\nBcc: \r\nDate: Wed, 25 Feb 2004 17:04:10 -0800\r\nMime-Version: 1.0\r\nContent-Type: text/plain; format=flowed\r\nMessage-ID: &lt;BAY2-F25D96doCekp8t000081c1@...&gt;\r\nX-OriginalArrivalTime: 26 Feb 2004 01:04:11.0141 (UTC) FILETIME=[71897B50:01C3FC04]\r\nX-eGroups-Remote-IP: 65.54.247.25\r\nFrom: &quot;John Arrowwood&quot; &lt;jarrowwx@...&gt;\r\nReply-To: john@...\r\nSubject: Training/testing subset selection\r\nX-Yahoo-Group-Post: member; u=115403844\r\nX-Yahoo-Profile: jarrowwx\r\n\r\nI wanted to get some feedback on the evolutionary process, and how much \nevaluation is &#39;enough&#39;...\n\nI have analyzed 421 pictures so far (out of 3110).  That equates to \n8,357,762,728 samples.  Yes, that&#39;s 8 billion.  I&#39;ve hashed the samples so \nthat each is represented as a 27 bit number, and I rotate and mirror and \ninvert as necessary to get the smallest 27 bit number that is able to be \nrepresented by that sample.  This means that if two samples are almost the \nsame, just rotated, they will have the same hash value.  Now, after only \nsaving one sample per hash value, I find that I only have 8,442,727 samples. \n  As each picture is evaluated, more samples are added, but at a fairly slow \nrate.  I expect the final count to come in under 10 million.  However, each \nof those samples can actually be represented 16 different ways, raising the \ncount to closer to 160 million.\n\nNow, let&#39;s say I had a thousand genomes in a population, and compared each \nto 160 million samples per epoch.  That&#39;s 160 billion evaluations.  I \nwouldn&#39;t live to see my project complete!\n\nWhat I&#39;m contemplating is a fitness evaluation heuristic to limit the amount \nof computation required.  The basic assumptions are these (correct me where \nI am wrong)\n\n1.  Comparing the average fitness of two individuals does not require that \neach be evaluated on the same number of samples (by virtue of the fact that \nit is an average)\n  -- Therefore, it should be possible to have an imbalanced number of \nevaluations per specimen per epoch.\n\n2.  The narrower the standard deviation of the fitness evaluations, the \nhigher the confidence there is in that average\n  -- Therefore, we can stop evaluating the specimen once its statistical \ncurve is well established\n\n3.  Only some specimens will reproduce in a given generation\n  -- Therefore, once a specimen has shown that it is relatively unfit for \npropagation, further evaluations are unnecessary against it\n  -- And as soon as both non-reproducing and elite specimens are identified, \nfurther evaluation is unnecessary for that species\n\nSo the proposed algorithm would be something like this:\n\nEvaluate each member of a species on a sample\nSort the results\nDivide the list into those that will reproduce, and those that won&#39;t.  (If I \ncan do that at this stage...can I?)\nRepeat until the list of those that will not reproduce doesn&#39;t change for N \nevaluations\nWhile doing this, skip re-evaluating any whose fitness evaluation we are \nconfident of\nIf ALL those who will reproduce are also &#39;elites&#39; then we are done...\nOtherwise, continue to evaluate only those that are expected to reproduce \nuntil the elites are identified in the same manner as the non-reproducing \nspecimens were identified.\nThe process for a species completes as soon as we know the genetic make up \nof those that will be propagating.\n\nNow, since the number of offspring that a species can have is a function of \nthe fitness of the average population, the above may be a little difficult, \nsince we can&#39;t know ahead of time how many will reproduce and how many will \nnot, right?  Well, wait, we have an intermediate average species fitness \nvalue, which could be used to make that division.  As the average fitness \nchanges, the number of allotted offspring will change.  That will change the \nlist of which can reproduce and which can not.  And since the algorithm \ndefines the stopping point as when the list remains the same over a period \nof time, then as long as the average is stabalizing, it will continue to \nevaluate.  Though some individual ones might stop evaluating early if the \nconfidence in their fitness evaluation is high.\n\nThat make sense?\n\nNow what concerns me is that what I want from the end result is a network \nthat has a high fitness evaluation for all 160  million samples.  So NOT \nevaluating against them all somewhat scares me.  But on the other hand, I \nknow that I can&#39;t, so I need to rationalize myself out of that unhealthy \ndesire... :)\n\nIf the samples are randomized (which to a degree, they will be), and I only \nhave one sample per hash value (which will be the case), then I don&#39;t have \nto worry too much about statistical skew.  Over the course of many \ngenerations, the best specimens will have been evaluated against more and \nmore samples, with ever increasing fitness.  The chances of the higher \nfitness against the later samples resulting in lower fitness for things that \nwere previously evaluated against are fairly low (I hope).  So evaluating \neach generation against different samples than the generation before should \nbe okay.\n\nHowever, fairness would dictate that all samples in a generation be compared \nagainst the same samples, right?  At least until their low fitness \ndisqualifies them for reproduction and thus further evaluation is \nunnecessary.  Or would it be okay, even potentially valuable, to perform \nevery evaluation against a different sample?  (since there are so many of \nthem available to work with)\n\nOkay, so there are some thoughts.  Anybody have any feedback for me?\n\nThanks!\n\n-- John\n\n_________________________________________________________________\nFind and compare great deals on Broadband access at the MSN High-Speed \nMarketplace. http://click.atdmt.com/AVE/go/onm00200360ave/direct/01/\n\n\n"}}