{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[{"name":"READ"}]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"userId":160378032,"authorName":"Vinod K. Valsalam","from":"&quot;Vinod K. Valsalam&quot; &lt;vkv@...&gt;","profile":"valsalam","replyTo":"LIST","senderId":"eYqs5YhYkbacBVvbb3LYIUrL8Eojc5-LR4UpNhpvEHtkqxzUD4ZKlTTXOQf-6Bt7s1TcVet10tiDvdmM-AJYt0_nKcqZtrId5GUYVbrk","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [neat] New paper investigating HyperNEAT&#39;s sensitivity to different geometric representations of a problem","postDate":"1240810400","msgId":4643,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDg3NG93YWZ5b3Yud2wldmt2QGNzLnV0ZXhhcy5lZHU+","inReplyToHeader":"PEM2MThDMkZCLjJBNjlGJWpjbHVuZUBtc3UuZWR1Pg==","referencesHeader":"PDg3ZnhmemdiczMud2wldmt2QGNzLnV0ZXhhcy5lZHU+CTxDNjE4QzJGQi4yQTY5RiVqY2x1bmVAbXN1LmVkdT4="},"prevInTopic":4642,"nextInTopic":0,"prevInTime":4642,"nextInTime":4644,"topicId":4627,"numMessagesInTopic":14,"msgSnippet":"Hi Jeff, Thanks for your clarifications. Yes, I have tested the evolved controllers for longer durations than the evaluation time.  I evaluate the controllers","rawEmail":"Return-Path: &lt;vkv@...&gt;\r\nX-Sender: vkv@...\r\nX-Apparently-To: neat@yahoogroups.com\r\nX-Received: (qmail 88166 invoked from network); 27 Apr 2009 05:37:19 -0000\r\nX-Received: from unknown (98.137.34.45)\n  by m1.grp.sp2.yahoo.com with QMQP; 27 Apr 2009 05:37:19 -0000\r\nX-Received: from unknown (HELO mail.cs.utexas.edu) (128.83.139.10)\n  by mta2.grp.sp2.yahoo.com with SMTP; 27 Apr 2009 05:37:19 -0000\r\nX-Received: from zaphod. (cpe-66-68-98-66.austin.res.rr.com [66.68.98.66])\n\t(authenticated bits=0)\n\tby mail.cs.utexas.edu (8.14.3/8.14.3) with ESMTP id n3R5X7q7002875\n\t(version=TLSv1/SSLv3 cipher=DHE-RSA-AES256-SHA bits=256 verify=NO)\n\tfor &lt;neat@yahoogroups.com&gt;; Mon, 27 Apr 2009 00:33:09 -0500 (CDT)\r\nDate: Mon, 27 Apr 2009 00:33:20 -0500\r\nMessage-ID: &lt;874owafyov.wl%vkv@...&gt;\r\nTo: neat@yahoogroups.com\r\nIn-Reply-To: &lt;C618C2FB.2A69F%jclune@...&gt;\r\nReferences: &lt;87fxfzgbs3.wl%vkv@...&gt;\n\t&lt;C618C2FB.2A69F%jclune@...&gt;\r\nUser-Agent: Wanderlust/2.15.5 (Almost Unreal) Emacs/22.1 Mule/5.0 (SAKAKI)\r\nMIME-Version: 1.0 (generated by SEMI 1.14.6 - &quot;Maruoka&quot;)\r\nContent-Type: text/plain; charset=US-ASCII\r\nX-eGroups-Msg-Info: 1:12:0:0:0\r\nFrom: &quot;Vinod K. Valsalam&quot; &lt;vkv@...&gt;\r\nSubject: Re: [neat] New paper investigating HyperNEAT&#39;s sensitivity to different geometric representations of a problem\r\nX-Yahoo-Group-Post: member; u=160378032; y=3D-4p9AVS3bqktQKyBZj76ENDkESzgqgxQ9R0bUe5aByYfY\r\nX-Yahoo-Profile: valsalam\r\n\r\n\nHi Jeff,\n\nThanks for your clarifications.\n\nYes, I have tested the evolved controllers for longer durations than\nthe evaluation time.  I evaluate the controllers for 60s of simulated\ntime during evolution.  All the champion controllers I&#39;ve looked at\nare stable and complete the initial 60s seconds without flipping over.\nMoreover, even if they are tested for longer than 60s (I have tried\nfor as long as 180s), they continue the same gaits and remain stable.\nThis stability results from the robustness of the coupled cell system\nto minor perturbations from the environment.\n\nVinod\n\n\nAt Sat, 25 Apr 2009 13:39:07 -0400,\nJeff Clune wrote:\n&gt; \n&gt; &gt;&gt;&gt; -- In the randomized experiments, do you think keeping the PRYS inputs\n&gt; &gt;&gt;&gt;    fixed and randomizing only the other inputs would produce better\n&gt; &gt;&gt;&gt;    results?  It seems to me that including the PRYS inputs in the\n&gt; &gt;&gt;&gt;    randomization may disrupt the geometry more since they do not have\n&gt; &gt;&gt;&gt;    a clear geometric interpretation.\n&gt; &gt;&gt; \n&gt; &gt;&gt; Interesting. I would think the opposite. Since they have no proper geometric\n&gt; &gt;&gt; location, why should it matter one way or the other if they are included in\n&gt; &gt;&gt; the randomization. In a sense, their current position is random. Why do you\n&gt; &gt;&gt; think HyperNEAT will do better with PRYS where it is than in any other\n&gt; &gt;&gt; random location?\n&gt; &gt; \n&gt; &gt; Consider the networks producing the 4-way symmetric gaits in which all\n&gt; &gt; four legs are synchronous.  Since the angular positions of all four\n&gt; &gt; legs are the same at any given instant, the network receives the same\n&gt; &gt; input for all four joints of the same joint type.  For example, in the\n&gt; &gt; 2D substrate configuration, each column in the input layer except the\n&gt; &gt; PRYS column receive the same input values.  Therefore, the network is\n&gt; &gt; invariant to any randomization of the inputs within those columns.\n&gt; &gt; The same reasoning applies to the output layer as well.  So if the\n&gt; &gt; entire input layer is randomized, only permutations of inputs between\n&gt; &gt; columns are likely to disrupt the 4-way symmetric gait.\n&gt; \n&gt; I agree with most of your input here. A few comments\n&gt; \n&gt; 1) In the first paper I do plot the joint angles for one joint for all four\n&gt; legs for one of the gaits that has all legs in unison, and those four joints\n&gt; do move in unison. \n&gt; \n&gt; 2) However, one frequently evolved gait has one leg in opposite phase, which\n&gt; randomizations would greatly affect (the joint angles for that gait are also\n&gt; plotted in the paper). Since this gait was relatively common, and even\n&gt; produced the best fitness in all of my experiments, taking this gait away\n&gt; (or making it harder to evolve) may not be trivial to the algorithm.\n&gt; \n&gt; &gt; Furthermore, observing the videos of the 4-way symmetric gaits you\n&gt; &gt; posted earlier suggests that all joints are moving in phase (we can\n&gt; &gt; confirm this when you have the time to plot the joint angles).  If\n&gt; &gt; that is the case, even permutations of inputs *between* columns\n&gt; &gt; (except PRYS) may not seriously disrupt the 4-way symmetric gait.\n&gt; &gt; However, including PRYS in the randomization is likely to be\n&gt; &gt; disruptive because their behavior in time is different from the\n&gt; &gt; behavior of the joint angles.\n&gt; \n&gt; &gt; It follows that HyperNEAT should be able to produce the 4-way\n&gt; &gt; symmetric gait almost as easily even when the geometry is scrambled.\n&gt; \n&gt; Here I disagree. Your argument only works if the knee joints and HipIO\n&gt; joints and HipFB are all moving similarly to each other (e.g. The HipIO\n&gt; joint cycles from 30 to -30 degrees at the same time points that the knee\n&gt; also moves from 30 to -30). I have not plotted those yet, but that seems\n&gt; very unlikely to me. One reason this seems unlikely is because these gaits\n&gt; are very sensitive to the smallest errors. I have done experiments where I\n&gt; add +/- 2.5 degrees of error into one or four joints (but consistent\n&gt; throughout evolution) and that really throws them off. So, even if the knees\n&gt; and hips are contracting or expanding at the same time, the differences in\n&gt; magnitude of their periods would likely make them not interchangeable.\n&gt; \n&gt; But to see whether they are indeed able to produce the coordinated,\n&gt; all-legs-in-sync gaits even with the randomized geometries, I just went and\n&gt; looked at some of the gaits produced with random geometries. None of them\n&gt; turned out to have all of the legs in coordination. They are for the most\n&gt; part quite uncoordinated. Some of them feature a few of the legs in sync,\n&gt; but in every case at least one leg looked a bit crippled and out of place.\n&gt; In many cases all of the legs seemed to be doing their own thing.\n&gt; \n&gt; &gt; You mentioned above that this gait indeed predominates in randomized\n&gt; &gt; geometry experiments just as they do in engineered geometry\n&gt; &gt; experiments, which seems to support this hypothesis.  It is also a\n&gt; &gt; possible explanation for how HyperNEAT is able to perform well with\n&gt; &gt; random geometric representations (which I think Ken also hinted at).\n&gt; \n&gt; As I noted above, my memory was wrong on that account (my apologies). The\n&gt; randomized geometries do not produce the all-legs-coordinated gait.\n&gt; \n&gt; &gt; In short, performing the following two experiments when you have the\n&gt; &gt; time should shed more light:\n&gt; &gt; \n&gt; &gt;   1. Plotting the joint angles to verify how closely they track each\n&gt; &gt;      other.  It would also be interesting to plot the sine input and\n&gt; &gt;      output angles to see how they are related in phase.\n&gt; \n&gt; I will do this for the randomized gaits when I get a chance, but having just\n&gt; seen those videos, I can nearly guarantee they will be all over the place\n&gt; (i.e. not in unison).\n&gt; \n&gt; &gt; \n&gt; &gt;   2. Not including the PRYS inputs in the randomization to see if it\n&gt; &gt;      gives better results.\n&gt; \n&gt; You have convinced me that this may help them if they were indeed achieving\n&gt; the alli-in-unison gait, but in light of the fact that the gaits are not\n&gt; really in unison, I doubt there would be much improvement, if any.\n&gt; \n&gt; &gt;&gt; Those 6000 seconds correspond to 6 seconds of &#39;real&#39; simulated time. I&#39;m\n&gt; &gt;&gt; nearly sure that the answer to your question is that some of the HyperNEAT\n&gt; &gt;&gt; champs do not fall over in the time allowed and others do. Another\n&gt; &gt;&gt; interesting question is what happens if I take the final HyperNEAT champions\n&gt; &gt;&gt; and run them for more than 6 seconds. This would test whether they have\n&gt; &gt;&gt; evolved a true, general gait. I plan on performing that study when I put\n&gt; &gt;&gt; these results into a journal article.\n&gt; &gt;&gt; \n&gt; &gt; \n&gt; &gt; That would indeed be an interesting experiment, and would answer the\n&gt; &gt; question about the stability of the evolved gaits.\n&gt; \n&gt; I forget, have you tried this yet with your gaits? Were any of them stable\n&gt; to infinity (or a really large number of seconds)? If so, what percent of\n&gt; your evolved gaits were stable?\n&gt; \n&gt; &gt; Thanks for taking the time in your busy schedule to respond!\n&gt; \n&gt; No problem. Thanks for your questions. I wish I could clone myself a few\n&gt; times so I had time to investigate all of these different issues\n&gt; immediately. :-) I guess that&#39;s what happens when you become faculty, and\n&gt; start getting graduate students interested in your work!\n&gt; \n&gt; -jeff\n&gt; \n&gt; \n&gt; \n&gt; \n&gt; ------------------------------------\n&gt; \n&gt; Yahoo! Groups Links\n&gt; \n&gt; \n&gt; \n\n"}}