{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[{"name":"READ"}]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"userId":256087559,"authorName":"Andrei","from":"&quot;Andrei&quot; &lt;andrei.rusu@...&gt;","profile":"andrei.rusu","replyTo":"LIST","senderId":"rp7s0_FIGVLnvLMzl72sCx80x2LJhlXrPuVaPwUCMZlged-9TVFRi4KeRYe42ror9eeUhvsipTnvr3YcrI6xZFgFqKTvWZE","spamInfo":{"isSpam":false,"reason":"6"},"subject":"A reply","postDate":"1299156516","msgId":5481,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGlrbzJuNCs0MDhiQGVHcm91cHMuY29tPg=="},"prevInTopic":0,"nextInTopic":0,"prevInTime":5480,"nextInTime":5482,"topicId":5481,"numMessagesInTopic":1,"msgSnippet":"Hi Colin! I found your post on this group atypical but very interesting, so I m would like to comment on some of the issues you ve raised. I must warn against","rawEmail":"Return-Path: &lt;andrei.rusu@...&gt;\r\nX-Sender: andrei.rusu@...\r\nX-Apparently-To: neat@yahoogroups.com\r\nX-Received: (qmail 64600 invoked from network); 3 Mar 2011 12:48:39 -0000\r\nX-Received: from unknown (98.137.34.44)\n  by m3.grp.sp2.yahoo.com with QMQP; 3 Mar 2011 12:48:39 -0000\r\nX-Received: from unknown (HELO n43d.bullet.mail.sp1.yahoo.com) (66.163.169.157)\n  by mta1.grp.sp2.yahoo.com with SMTP; 3 Mar 2011 12:48:39 -0000\r\nX-Received: from [69.147.65.147] by n43.bullet.mail.sp1.yahoo.com with NNFMP; 03 Mar 2011 12:48:38 -0000\r\nX-Received: from [98.137.34.72] by t10.bullet.mail.sp1.yahoo.com with NNFMP; 03 Mar 2011 12:48:38 -0000\r\nDate: Thu, 03 Mar 2011 12:48:36 -0000\r\nTo: neat@yahoogroups.com\r\nMessage-ID: &lt;iko2n4+408b@...&gt;\r\nUser-Agent: eGroups-EW/0.82\r\nMIME-Version: 1.0\r\nContent-Type: multipart/alternative; boundary=&quot;8-9423582179-7550917640=:4&quot;\r\nX-Mailer: Yahoo Groups Message Poster\r\nX-Yahoo-Newman-Property: groups-compose\r\nX-eGroups-Msg-Info: 1:6:0:0:0\r\nFrom: &quot;Andrei&quot; &lt;andrei.rusu@...&gt;\r\nSubject: A reply\r\nX-Yahoo-Group-Post: member; u=256087559; y=lCUIqedESbHOTTbRNX19NhQiCvH-ws2MgfaZS87bqQRu8gM-KdQ\r\nX-Yahoo-Profile: andrei.rusu\r\n\r\n\r\n--8-9423582179-7550917640=:4\r\nContent-Type: text/plain; charset=&quot;iso-8859-1&quot;\r\nContent-Transfer-Encoding: quoted-printable\r\n\r\nHi Colin!\n\nI found your post on this group atypical but very interesting, s=\r\no I&#39;m\nwould like to comment on some of the issues you&#39;ve raised.\nI must war=\r\nn against reading too much into half-informed speculation on\nthe brain, and=\r\n some popular scientific magazines and especially blogs\nare full of it.  Un=\r\nfortunately, this is also true for some general\naudience books written by s=\r\ncientists. In science, facts must be well\nseparated from fiction and wild s=\r\npeculation. In popular books, it is the\nother way around. Both hold importa=\r\nnt places, but the distinction must\nbe explicitly specified so that people =\r\ncan read both genres accordingly,\nand give them credit for precision (scien=\r\ntific publications) and\ncreativity (in mainstream books), not the other way=\r\n around.\nFrom the academic perspective, the number of papers in neuroscienc=\r\ne\ntoday is huge, about 55.000 publications in 2008, and growing rapidly,\nso=\r\n mining for details and consensus on sensitive issues is also a hard\njob.\nW=\r\nith that being said, I&#39;ll just make a few comments, trying to add\ninformati=\r\non which originates in neuroscience textbooks, courses and\npapers.\n\nLast su=\r\nmmer I read Jeff Hawkins&#39; book On Intelligence. One of the take\naway points=\r\n for me was that the connectivity in real brains has a lot\nof regular struc=\r\nture and order, but also some rather more messy\nconnectivity. I&#39;m going fro=\r\nm memory here but the pictue he paints is\none of cortical columns packed to=\r\ngether vertically, columns have\nlayers (6 or so if memory serves) and intra=\r\n-column connectivity\nappears to be fairly well understood at a *very* broad=\r\n level, that is,\nlayer 1 neurons tend to connect to layers 2 & 3, etc.\n\nAt =\r\nthe top of the columns we then see connections reaching out over\nthe tops o=\r\nf multiple columns, connecting up different regions\nsometimes over very lon=\r\ng distances - perhaps up to several\ncentimeters. It&#39;s interesting to contem=\r\nplate what processes are\ncausing connections to form over such long ranges.=\r\n One explanation I\nquite like is that the early brain (e.g. a newborn baby)=\r\n has a mass of\nconnections that have *not* yet been guided by any learning =\r\nprocess -\nso what is all this mass of connections doing? what arrangement o=\r\nf\nconnectivity does it have and why? I suspect that our DNA describes\nconne=\r\nctivity patterns in the newborn that are primed for learning and\nthat as le=\r\narning progresses some of these pre-existing connections are\nstrengthened (=\r\nand grow new connections locally), and some wither away.\nI&#39;m speculating th=\r\nat this early connectivity pattern includes some\nproportion of long connect=\r\nions acting between distant regions. I\nfurther speculate that this might be=\r\n partly responsible for the\nvarious axon bundles that occur in the brain th=\r\nat broadly follow the\nsame path in all (most?) people (e.g. from the retina=\r\n to the visual\ncortex) - do &#39;primer&#39; fibers grow by following a DNA bluepri=\r\nnt during\nthe early stages of brain development?\n\nNothing in random in the =\r\nconnectivity of an infant&#39;s brain. The\nprecision of the connectivity is abs=\r\nolutely astounding. We are born with\nmany times more connection and during =\r\npuberty we loose most of them,\nremaining with &quot;just&quot; the popularized figure=\r\n (about 100 trillion\nconnections). These connections or synapses  are genet=\r\nically mediated,\nand do not only specify which parts of the brain connect t=\r\no which, but\nalso which parts of the target neuron&#39;s dendrites should a spe=\r\ncific\nfiber connect to. Of course, this process in highly error prone, but\n=\r\nmost of these connection will be lost anyway. The general hypothesis is\ntha=\r\nt as we the circuitry uses some neural pathways, some synapses are\nstrength=\r\nened while others are disengaged. There is a large research\nliterature on s=\r\nynaptic plasticity dealing with just this issue. Be\nadvised, the molecular =\r\nmechanisms underlying plasticity are relatively\nwell understood, but the po=\r\npular learning rule &quot;what fires together,\nwires together&quot; is an over-simpli=\r\nfication. Coming back to connectivity,\nyes, there are axons as long as one =\r\nmeter, yes they connect distant\nparts of the brain with very specific parts=\r\n of the spinal cord. There\nare also across the brain distant connections, e=\r\nither in the same\nhemisphere (called association pathways), across hemisphe=\r\nres\n(commissures, e.g. the corpus callosum) and from lower brain structures=\r\n\nto the cortex (projection pathways, e.g. the thalamus to cortex). The\nconn=\r\nections are very, very precise, down to specialized bunches of cells\n(calle=\r\nd nuclei). For example, neurons in the retina synapse directly to\nthe later=\r\nal geniculate nucleus (LGN) which is just a bunch of cells in\nthe thalamus.=\r\n From there other neurons send axons to the very back of\nthe cortex in the =\r\noccipital lobe to what is know as the primary visual\ncortex (Broadman area =\r\n17). This general brain organization, with this\nlevel of precision, is cons=\r\nistently the same across most human adult\nbrains with no impairments, with =\r\nsome well studied and subtle\ndifferences, for example between males-females=\r\n, etc. The consensus about\nhow this precise organization is possible is tha=\r\nt genetic factors build\nthis organ in the same way they build a heart, i.e.=\r\n very precisely down\nto cellular level, cell-architecture and placement, ce=\r\nll connectivity.\nThen, years of interaction with the environment fine tune =\r\nthe neural\ncircuits by what we call implicit and explicit learning, but to =\r\nput it\nsimply, the fine-tuning is done just by &quot;using&quot; the brain, i.e. seei=\r\nng\nis fine-tuned by seeing, hearing by hearing and so on.... We are talking=\r\n\nabout an &quot;ecosystem&quot; of 100 billion living cells working together in DNA\ns=\r\npecified ways, that incidentally exhibits a self, language, imagination\nand=\r\n the rest of what we call human. This &quot;construction&quot; stemming from\nthe DNA =\r\nblueprint is exact enough to generate many healthy human\nchildren who end u=\r\np with almost identically wired brains, while being\nplastic enough to deal =\r\nwith all the learning, adaptation and even\nmiss-wiring that happens.\n\nAlso =\r\nlast year I came across this article that discusses work\nregarding expressi=\r\non of bits of DNA considered to be junk acquired\nfrom ancient viruses and t=\r\nhe like:\n\n&quot;A special report on the human genome: The soul of an old machine=\r\n&quot;\nhttp://www.economist.com/node/16349410\n&lt;http://www.economist.com/node/163=\r\n49410&gt;\n\n\nI&#39;ve appened some of the salient parts to the end of this post. Th=\r\nis\njunk DNA appears to be expressed more in brain tissue than elsewhere\nin =\r\nthe body, and so there&#39;s a question of why this is and if it has\nany purpos=\r\ne. One suggested purpose is that this DNA is used as a\nsource of complexity=\r\n in brain connectivity growth processes in the\nembryo. It&#39;s possible that t=\r\nhe learning processes/rules in the brain\ndon&#39;t require any specific structu=\r\nre but do requrie some existing\nstructure with sufficient interconnectivity=\r\n and &#39;messiness&#39; to build\nupon, and that these large sequences of &#39;junk&#39; DN=\r\nA (I appreciate junk\nDNA is a loaded term) were a convenient source of mess=\r\niness or\narbitrary complexity that evolution came to utilise over time.\n\nDo=\r\n you think this is possible? Likely? or just another madcap theory? :)\n\nIf =\r\nyou want to what is considered fact and what is informed speculation\n(and w=\r\nhat the evidence behind that speculation is) I wholeheartedly\nrecommend rea=\r\nding an introductory neuroscience textbook, your choice.\nThey are surprisin=\r\ngly accessible and at the end of 300 pages you will\nknow what facts and the=\r\nories are supported by converging evidence and\nwhere a consensus was reache=\r\nd or is growing. The web  is full of \nspeculations which generally show jus=\r\nt one opinion.\n\n\nI personally find conclusions of the article highly specul=\r\native and\ninexact, although they are in line with the general current\nunder=\r\nstanding. I take it a pure confabulation simply because they do not\nexplain=\r\n the characteristics of their proposed evolutionary model. There\nare clearl=\r\ny components of intelligence, and pretty much any aspect of\nbrain activity,=\r\n which are not completely described genetically. The\ngenetics are just a gu=\r\nideline; experience literally shapes the brain.\nIts physiology is built to =\r\nfeature this level of plasticity. The\nmechanisms behind this plasticity, th=\r\ne neural code and how the pieces of\ninformation we know come together to fe=\r\nature &quot;intelligence&quot; are really\njust beginning to be understood. This is la=\r\nrgely why such speculations\nstill make the headlines.\n\nBest regards,\nAndrei=\r\n\n\n\r\n--8-9423582179-7550917640=:4\r\nContent-Type: text/html; charset=&quot;iso-8859-1&quot;\r\nContent-Transfer-Encoding: quoted-printable\r\n\r\n&lt;font color=3D&quot;#00407f&quot;&gt;Hi Colin! &lt;br&gt;&lt;br&gt;I found your post on this group a=\r\ntypical but very interesting, so I&#39;m would like to comment on some of the i=\r\nssues you&#39;ve raised. &lt;br&gt;I must warn against reading too much into half-inf=\r\normed speculation on the brain, and some popular scientific magazines and e=\r\nspecially blogs are full of it.&nbsp; Unfortunately, this is also true for =\r\nsome general audience books written by scientists. In science, facts must b=\r\ne well separated from fiction and wild speculation. In popular books, it is=\r\n the other way around. Both hold important places, but the distinction must=\r\n be explicitly specified so that people can read both genres accordingly, a=\r\nnd give them credit for precision (scientific publications) and creativity =\r\n(in mainstream books), not the other way around.&lt;br&gt;From the academic persp=\r\nective, the number of papers in neuroscience today is huge, about 55.000 pu=\r\nblications in 2008, and growing rapidly, so mining for details and consensu=\r\ns on sensitive issues is also a hard job.&lt;br&gt;With that being said, I&#39;ll jus=\r\nt make a few comments, trying to add information which originates in neuros=\r\ncience textbooks, courses and papers. &lt;/font&gt;&lt;br&gt;&lt;i&gt;&lt;br&gt;Last summer I read =\r\nJeff Hawkins&#39; book On Intelligence. One of the take&lt;br&gt;away points for me w=\r\nas that the connectivity in real brains has a lot&lt;br&gt;of regular structure a=\r\nnd order, but also some rather more messy&lt;br&gt;connectivity. I&#39;m going from m=\r\nemory here but the pictue he paints is&lt;br&gt;one of cortical columns packed to=\r\ngether vertically, columns have&lt;br&gt;layers (6 or so if memory serves) and in=\r\ntra-column connectivity&lt;br&gt;appears to be fairly well understood at a *very*=\r\n broad level, that is,&lt;br&gt;layer 1 neurons tend to connect to layers 2 &amp;=\r\n 3, etc.&lt;br&gt;&lt;br&gt;At the top of the columns we then see connections reaching =\r\nout over&lt;/i&gt;&lt;i&gt;&lt;br&gt;the tops of multiple columns, connecting up different re=\r\ngions&lt;br&gt;sometimes over very long distances - perhaps up to several&lt;br&gt;cent=\r\nimeters. It&#39;s interesting to contemplate what processes are&lt;br&gt;causing conn=\r\nections to form over such long ranges. One explanation I&lt;br&gt;quite like is t=\r\nhat the early brain (e.g. a newborn baby) has a mass of&lt;br&gt;connections that=\r\n have *not* yet been guided by any learning process -&lt;br&gt;so what is all thi=\r\ns mass of connections doing? what arrangement of&lt;br&gt;connectivity does it ha=\r\nve and why? I suspect that our DNA describes&lt;br&gt;connectivity patterns in th=\r\ne newborn that are primed for learning and&lt;br&gt;that as learning progresses s=\r\nome of these pre-existing connections are&lt;br&gt;strengthened (and grow new con=\r\nnections locally), and some wither away.&lt;br&gt;I&#39;m speculating that this early=\r\n connectivity pattern includes some&lt;br&gt;proportion of long connections actin=\r\ng between distant regions. I&lt;br&gt;further speculate that this might be partly=\r\n responsible for the&lt;br&gt;various axon bundles that occur in the brain that b=\r\nroadly follow the&lt;br&gt;same path in all (most?) people (e.g. from the retina =\r\nto the visual&lt;br&gt;cortex) - do &#39;primer&#39; fibers grow by following a DNA bluep=\r\nrint during&lt;br&gt;the early stages of brain development?&lt;br&gt;&lt;br&gt;&lt;/i&gt;&lt;font colo=\r\nr=3D&quot;#00407f&quot;&gt;Nothing in random in the connectivity of an infant&#39;s brain. T=\r\nhe precision of the connectivity is absolutely astounding. We are born with=\r\n many times more connection and during puberty we loose most of them, remai=\r\nning with &quot;just&quot; the popularized figure (about 100 trillion connections). T=\r\nhese connections or synapses&nbsp; are genetically mediated, and do not onl=\r\ny specify which parts of the brain connect to which, but also which parts o=\r\nf the target neuron&#39;s dendrites should a specific fiber connect to. Of cour=\r\nse, this process in highly error prone, but most of these connection will b=\r\ne lost anyway. The general hypothesis is that as we the circuitry uses some=\r\n neural pathways, some synapses are strengthened while others are disengage=\r\nd. There is a large research literature on synaptic plasticity dealing with=\r\n just this issue. Be advised, the molecular mechanisms underlying plasticit=\r\ny are relatively well understood, but the popular learning rule &quot;what fires=\r\n together, wires together&quot; is an over-simplification. Coming back to connec=\r\ntivity, yes, there are axons as long as one meter, yes they connect distant=\r\n parts of the brain with very specific parts of the spinal cord. There are =\r\nalso across the brain distant connections, either in the same hemisphere (c=\r\nalled association pathways), across hemispheres (commissures, e.g. the corp=\r\nus callosum) and from lower brain structures to the cortex (projection path=\r\nways, e.g. the thalamus to cortex). The connections are very, very precise,=\r\n down to specialized bunches of cells (called nuclei). For example, neurons=\r\n in the retina synapse directly to the lateral geniculate nucleus (LGN) whi=\r\nch is just a bunch of cells in the thalamus. From there other neurons send =\r\naxons to the very back of the cortex in the occipital lobe to what is know =\r\nas the primary visual cortex (Broadman area 17). This general brain organiz=\r\nation, with this level of precision, is consistently the same across most h=\r\numan adult brains with no impairments, with some well studied and subtle di=\r\nfferences, for example between males-females, etc. The consensus about how =\r\nthis precise organization is possible is that genetic factors build this or=\r\ngan in the same way they build a heart, i.e. very precisely down to cellula=\r\nr level, cell-architecture and placement, cell connectivity. Then, years of=\r\n interaction with the environment fine tune the neural circuits by what we =\r\ncall implicit and explicit learning, but to put it simply, the fine-tuning =\r\nis done just by &quot;using&quot; the brain, i.e. seeing is fine-tuned by seeing, hea=\r\nring by hearing and so on.... We are talking about an &quot;ecosystem&quot; of 100 bi=\r\nllion living cells working together in DNA specified ways, that incidentall=\r\ny exhibits a self, language, imagination and the rest of what we call human=\r\n. This &quot;construction&quot; stemming from the DNA blueprint is &lt;b&gt;exact enough&lt;/b=\r\n&gt; to generate many healthy human children who end up with almost identicall=\r\ny wired brains, while being &lt;b&gt;plastic enough&lt;/b&gt; to deal with all the lear=\r\nning, adaptation and even miss-wiring that happens. &lt;/font&gt;&lt;br&gt;&lt;i&gt;&lt;br&gt;Also =\r\nlast year I came across this article that discusses work&lt;/i&gt;&lt;i&gt;&lt;br&gt;regardin=\r\ng expression of bits of DNA considered to be junk acquired&lt;br&gt;from ancient =\r\nviruses and the like:&lt;br&gt;&lt;br&gt;&quot;A special report on the human genome: The sou=\r\nl of an old machine&quot;&lt;/i&gt;&lt;i&gt;&lt;br&gt;&lt;a href=3D&quot;http://www.economist.com/node/163=\r\n49410&quot;&gt;http://www.economist.com/node/16349410&lt;/a&gt;&lt;br&gt;&lt;br&gt;&lt;br&gt;I&#39;ve appened s=\r\nome of the salient parts to the end of this post. This&lt;/i&gt;&lt;i&gt;&lt;br&gt;junk DNA a=\r\nppears to be expressed more in brain tissue than elsewhere&lt;br&gt;in the body, =\r\nand so there&#39;s a question of why this is and if it has&lt;br&gt;any purpose. One =\r\nsuggested purpose is that this DNA is used as a&lt;br&gt;source of complexity in =\r\nbrain connectivity growth processes in the&lt;br&gt;embryo. It&#39;s possible that th=\r\ne learning processes/rules in the brain&lt;br&gt;don&#39;t require any specific struc=\r\nture but do requrie some existing&lt;br&gt;structure with sufficient interconnect=\r\nivity and &#39;messiness&#39; to build&lt;br&gt;upon, and that these large sequences of &#39;=\r\njunk&#39; DNA (I appreciate junk&lt;br&gt;DNA is a loaded term) were a convenient sou=\r\nrce of messiness or&lt;br&gt;arbitrary complexity that evolution came to utilise =\r\nover time.&lt;br&gt;&lt;br&gt;Do you think this is possible? Likely? or just another ma=\r\ndcap theory? :)&lt;/i&gt;&lt;br&gt;&lt;br&gt;&lt;font color=3D&quot;#00407f&quot;&gt;If you want to what is c=\r\nonsidered fact and what is informed speculation (and what the evidence behi=\r\nnd that speculation is) I wholeheartedly recommend reading an introductory =\r\nneuroscience textbook, your choice. They are surprisingly accessible and at=\r\n the end of 300 pages you will know what facts and theories are supported b=\r\ny converging evidence and where a consensus was reached or is growing. The =\r\nweb&nbsp; is full of&nbsp; speculations which generally show just one opini=\r\non.&lt;/font&gt;&lt;br&gt;&lt;br&gt;&lt;br&gt;&lt;font color=3D&quot;#00407f&quot;&gt;I personally find conclusions=\r\n of the article highly speculative and inexact, although they are in line w=\r\nith the general current understanding. I take it a pure confabulation simpl=\r\ny because they do not explain the characteristics of their proposed evoluti=\r\nonary model. There are clearly components of intelligence, and pretty much =\r\nany aspect of brain activity, which are not completely described geneticall=\r\ny. The genetics are just a guideline; experience literally shapes the brain=\r\n. Its physiology is built to feature this level of plasticity. The mechanis=\r\nms behind this plasticity, the neural code and how the pieces of informatio=\r\nn we know come together to feature &quot;intelligence&quot; are really just beginning=\r\n to be understood. This is largely why such speculations still make the hea=\r\ndlines. &lt;br&gt;&lt;/font&gt;&lt;br&gt;Best regards,&lt;br&gt;Andrei &lt;br&gt;\n\r\n--8-9423582179-7550917640=:4--\r\n\n"}}