{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[{"name":"READ"}]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"userId":344770077,"authorName":"Colin Green","from":"Colin Green &lt;colin.green1@...&gt;","profile":"alienseedpod","replyTo":"LIST","senderId":"nUnTl3_yZ_Z17XTmiSRwnEU97sh3EXcvAqd0lMnrEdCJECAVwm-_0m9Ung0qOVMNESHgY0112N5a2S9iV1zpPcn4jGHWfbeDvxyx","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [neat] Re: &quot;Survive and Reproduce&quot; as an Objective","postDate":"1302211999","msgId":5532,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEJBTkxrVGk9eE9pck1fS3EybzE2Ri0teWNCNFRBZD1rVzZnQG1haWwuZ21haWwuY29tPg==","inReplyToHeader":"PGluZ21rdStobjVxQGVHcm91cHMuY29tPg==","referencesHeader":"PEJBTkxrVGk9TXBTV3d1UmF5M0Jnd0RNdnpUNFdIaTFKRDBRQG1haWwuZ21haWwuY29tPgk8aW5nbWt1K2huNXFAZUdyb3Vwcy5jb20+"},"prevInTopic":5527,"nextInTopic":5533,"prevInTime":5531,"nextInTime":5533,"topicId":5507,"numMessagesInTopic":25,"msgSnippet":"... Hi Joel, I ll attempt to clarify my position as I don t feel like my argument has been coloured by a complexity is better bias. The natural world has","rawEmail":"Return-Path: &lt;colin.green1@...&gt;\r\nX-Sender: colin.green1@...\r\nX-Apparently-To: neat@yahoogroups.com\r\nX-Received: (qmail 46349 invoked from network); 7 Apr 2011 21:33:21 -0000\r\nX-Received: from unknown (98.137.34.44)\n  by m8.grp.sp2.yahoo.com with QMQP; 7 Apr 2011 21:33:21 -0000\r\nX-Received: from unknown (HELO mail-px0-f174.google.com) (209.85.212.174)\n  by mta1.grp.sp2.yahoo.com with SMTP; 7 Apr 2011 21:33:21 -0000\r\nX-Received: by pxi15 with SMTP id 15so1441576pxi.33\n        for &lt;neat@yahoogroups.com&gt;; Thu, 07 Apr 2011 14:33:20 -0700 (PDT)\r\nMIME-Version: 1.0\r\nX-Received: by 10.142.48.12 with SMTP id v12mr1035973wfv.318.1302212000009; Thu,\n 07 Apr 2011 14:33:20 -0700 (PDT)\r\nX-Received: by 10.142.222.8 with HTTP; Thu, 7 Apr 2011 14:33:19 -0700 (PDT)\r\nIn-Reply-To: &lt;ingmku+hn5q@...&gt;\r\nReferences: &lt;BANLkTi=MpSWwuRay3BgwDMvzT4WHi1JD0Q@...&gt;\n\t&lt;ingmku+hn5q@...&gt;\r\nDate: Thu, 7 Apr 2011 22:33:19 +0100\r\nMessage-ID: &lt;BANLkTi=xOirM_Kq2o16F--ycB4TAd=kW6g@...&gt;\r\nTo: neat@yahoogroups.com\r\nContent-Type: text/plain; charset=ISO-8859-1\r\nX-eGroups-Msg-Info: 1:12:0:0:0\r\nFrom: Colin Green &lt;colin.green1@...&gt;\r\nSubject: Re: [neat] Re: &quot;Survive and Reproduce&quot; as an Objective\r\nX-Yahoo-Group-Post: member; u=344770077; y=hqihcN6XYVqcKSWcOYlB6FEdmGaStQyOyBU8E_hxfyTvUFqBAEtq\r\nX-Yahoo-Profile: alienseedpod\r\n\r\nOn 6 April 2011 04:28, joel278 &lt;lehman.154@...&gt; wrote:\n&gt;\n&gt; Sometimes our view of evolution is colored by our often unquestioned\n&gt; assumption that greater complexity is a good or necessary thing. Instead,\n&gt; generally biological fitness decreases with greater complexity. A vanilla single-\n&gt; celled organism is more optimal in some reproductive sense than a human\n&gt; being. Although we have the ability to think and plan, cockroaches are more\n&gt; robust.\n\nHi Joel, I&#39;ll attempt to clarify my position as I don&#39;t feel like my\nargument has been coloured by a &#39;complexity is better&#39; bias.\n\nThe natural world has many different resources available, some are\ntrivially utilised like molecules or bits of food floating in the\nocean, others though are not immediately available to simple\nstrategies (e.g. anything you need senses and motility to get at). The\nnumber and range of types of resources is vast and ergo so to is the\nrange of strategy complexity required to access them. The tendency\ntowards complexity then is not an innate quality of the evolutionary\nprocess, rather it&#39;s a reflection of the complexity of the natural\nworld.\n\nSo taking as an example a super efficient species of bacteria floating\nin the sea. These bacteria rely on passing molecules in water currents\nand absorb them as they become available. One of the earliest\ndevelopments from this simple strategy was light sensitivity and\nmotility - one of the greatest dangers in the early history of life on\nearth was UV light and it&#39;s tenedency to damage not just DNA/RNA but\njust generally many organic compounds. As such some offspring started\nto fit the niche whereby they detected light and where able to move to\na greater depth of water for protection. The existing non-motile\nspecies were still around but the new species colonised a new region\nof the fitness space that was previoulsy empty. The other simple\nexample would be fish growing legs and thus gainign access to all of\nthe previulsy untapped land based resources. These are just two\nspecific examples to make the point, but there are vastly more smaller\nexamples, e.g. modifications to an enzyme that allows utilisation of\nsome food that wasn&#39;t possible before.\n\nThis process goes all the way to humans figuring out how to use tools\nand fire to access a whole new expanse of resources, ultimately (or\ncurrently) including nuclear fission, deep sea oil reserves and the\nefficiencies of collective effort made possible by language, computers\nand telecommunications.\n\n&gt;  Whatever can reproduce does;\n&gt; different niches, even if they are suboptimal when compared to other niches, still\n&gt; accumulate.\n\nOK so potentially I haven&#39;t gone into detail on this aspect. The\ndifferent niches are often (but not always) spacially distinct, so\ne.g. a fish with legs moves on to land and has this whole new resource\navailable. It not longer has to compete with sharks, etc, so yes it\nonly has to be competetive in that niche, which initially was very\neasy once you figured out how to grow legs and breath air. Each newly\ncomplex strategy potentially put the critter in question into virgin\nterritory - an easy life but one that was only made possible by a new\nand more complex strategy.\n\n&gt; However, in EC, all individuals are generally judged on the same\n&gt; scale of fitness regardless of what strategy they take. I think this is an important\n&gt; difference.\n\nGenerally, yes, but it&#39;s not an inherent quality of EC. If we were\nable to simulate the natural world at the molecular level then we\nwould also have access to a fitness function/landscape with vast\ncomplexity; we don&#39;t, but hopefully we can get enough complexity with\nthe computational resources that we do have.\n\n\n\n\n&gt; I do agree that the kinds of objectives used in EC are generally narrowly defined\n&gt; and do not offer much room for alternative strategies, which is a problem. But\n&gt; this problem may be merely a symptom of the reigning abstraction of natural\n&gt; evolution within EC, that of evolution as an optimizer.\n\nSure.\n\n\n&gt; That is, nearly any objective will just lead to convergence if the reward scheme\n&gt; is strictly optimizing that objective. For example, even in a simple pole-balancing\n&gt; domain, there are likely different incredibly complex and inefficient ways of\n&gt; balancing that pole -- these might be analogous to &#39;human-beings&#39; within that\n&gt; domain, but we would never find them by looking for an efficient pole balancer;\n&gt; instead we might look for many different interesting (but not necessarily optimal)\n&gt; ways of balancing a pole.\n\nNo we would never find human beings in that domain, and nor should we\nexpect to. The essential quality of my above argument is that each\ncomplexification allowed colonisation of a new space that couldn&#39;t be\nreached with simpler strategies. If there is a simple strategy for\npole balancing then we have found a global optimum and there is\nnowhere in teh fitness landscape that leads on from there. It&#39;s a dead\nend. The fitness space is lacking sufficient complexity to evolve\nanything more complex than the domain requires.\n\nNote that this isn&#39;t necessarily an argument against novelty search, I\nsuspect that it still stands as a competetive search strategy for\ncertian classes of domain with the computational resource restrictions\nwe have.\n\nColin\n\n"}}