{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[{"name":"READ"}]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"userId":130984297,"authorName":"joel278","from":"&quot;joel278&quot; &lt;lehman.154@...&gt;","profile":"joel278","replyTo":"LIST","senderId":"uHWFJCvh2M3HZtg6knN2tc3gjwe8DHMHwQ2cXkCe6rEbKMIX8us-q9CeHRCdilOPW6p3Lnolhr995TMcTS0a8u8kRa_b","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: &quot;Survive and Reproduce&quot; as an Objective","postDate":"1302218340","msgId":5533,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGlubGdwNCs2czJ1QGVHcm91cHMuY29tPg==","inReplyToHeader":"PEJBTkxrVGk9eE9pck1fS3EybzE2Ri0teWNCNFRBZD1rVzZnQG1haWwuZ21haWwuY29tPg=="},"prevInTopic":5532,"nextInTopic":5534,"prevInTime":5532,"nextInTime":5534,"topicId":5507,"numMessagesInTopic":25,"msgSnippet":"Colin, I agree with most of what you ve said, and will reply inline. However, if we are still debating whether biological fitness is an objective as typically","rawEmail":"Return-Path: &lt;lehman.154@...&gt;\r\nX-Sender: lehman.154@...\r\nX-Apparently-To: neat@yahoogroups.com\r\nX-Received: (qmail 84140 invoked from network); 7 Apr 2011 23:19:02 -0000\r\nX-Received: from unknown (66.196.94.106)\n  by m11.grp.re1.yahoo.com with QMQP; 7 Apr 2011 23:19:02 -0000\r\nX-Received: from unknown (HELO n40b.bullet.mail.sp1.yahoo.com) (66.163.168.154)\n  by mta2.grp.re1.yahoo.com with SMTP; 7 Apr 2011 23:19:02 -0000\r\nX-Received: from [69.147.65.173] by n40.bullet.mail.sp1.yahoo.com with NNFMP; 07 Apr 2011 23:19:00 -0000\r\nX-Received: from [98.137.34.32] by t15.bullet.mail.sp1.yahoo.com with NNFMP; 07 Apr 2011 23:19:00 -0000\r\nDate: Thu, 07 Apr 2011 23:19:00 -0000\r\nTo: neat@yahoogroups.com\r\nMessage-ID: &lt;inlgp4+6s2u@...&gt;\r\nIn-Reply-To: &lt;BANLkTi=xOirM_Kq2o16F--ycB4TAd=kW6g@...&gt;\r\nUser-Agent: eGroups-EW/0.82\r\nMIME-Version: 1.0\r\nContent-Type: text/plain; charset=&quot;ISO-8859-1&quot;\r\nContent-Transfer-Encoding: quoted-printable\r\nX-Mailer: Yahoo Groups Message Poster\r\nX-Yahoo-Newman-Property: groups-compose\r\nFrom: &quot;joel278&quot; &lt;lehman.154@...&gt;\r\nSubject: Re: &quot;Survive and Reproduce&quot; as an Objective\r\nX-Yahoo-Group-Post: member; u=130984297; y=ruVPz5OfVdFr14ByZEXpXUFTd73UoRySpu991SMMfaceT6MtqnXs\r\nX-Yahoo-Profile: joel278\r\n\r\nColin,\n\nI agree with most of what you&#39;ve said, and will reply inline. Howev=\r\ner, if we are still debating whether biological fitness is an objective as =\r\ntypically considered within EC,  I feel like the central argument I propose=\r\nd wasn&#39;t addressed: The optimal replicator, in terms of fitness, is likely =\r\nsome super-efficient bacteria. If biological fitness is the objective, then=\r\n this super-bacteria is the global optima, this is what evolution should *s=\r\ntop* after it finds (as you propose in pole-balancing) -- anything else is =\r\nworse, regardless of what strategy or resources it utilizes. \n\nPerhaps our =\r\ndiscussion about objectives is merely semantic at this point. It is also in=\r\nteresting to consider whether environmental complexity, like Earth&#39;s richne=\r\nss, is a requirement for creating an open-ended complexifying evolutionary =\r\nsystem.\n\n&gt; The natural world has many different resources available, some a=\r\nre\n&gt; trivially utilised like molecules or bits of food floating in the\n&gt; oc=\r\nean, others though are not immediately available to simple\n&gt; strategies (e.=\r\ng. anything you need senses and motility to get at). The\n&gt; number and range=\r\n of types of resources is vast and ergo so to is the\n&gt; range of strategy co=\r\nmplexity required to access them. The tendency\n&gt; towards complexity then is=\r\n not an innate quality of the evolutionary\n&gt; process, rather it&#39;s a reflect=\r\nion of the complexity of the natural\n&gt; world.\n&gt;\n\nI think it is a leap to go=\r\n from the fact that different resources in natural evolution require differ=\r\nent complexities to exploit, to the more general claim that evolution&#39;s dri=\r\nve in some lineages to complexity is a reflection of the natural world&#39;s co=\r\nmplexity. \n\nMore important than Earth&#39;s complexity is the complexity of exi=\r\nsting organisms; that is, new animals create new niches based upon existing=\r\n animals. Grass leads to herbivores etc. \n\nSo in that sense, some of the co=\r\nmplexity (probably what most people would agree is the most interesting com=\r\nplexity, i.e. complex animals) is not innate in the system but is bootstrap=\r\nped from within the evolutionary algorithm (although admittedly dependent o=\r\nn what is possible within Earth). \n\nWhether an endless supply of niches can=\r\n exist only in very complex domains (like Earth) is an interesting question=\r\n. I would doubt it, and guess that our want to attribute evolution&#39;s majest=\r\ny to Earth&#39;s unique complexity is because we don&#39;t yet understand the under=\r\nlying (perhaps even simple) abstraction that allows natural evolution such =\r\ncreative power. For example, even a simple game like chess (few rules) disp=\r\nlays a remarkable depth. What a self-bootstrapping niche-space within chess=\r\n would require, I don&#39;t know; but I wouldn&#39;t immediately discount that it c=\r\nould exist.\n\n&gt; &gt;  Whatever can reproduce does;\n&gt; &gt; different niches, even i=\r\nf they are suboptimal when compared to other niches, still\n&gt; &gt; accumulate.\n=\r\n&gt; \n&gt; OK so potentially I haven&#39;t gone into detail on this aspect. The\n&gt; dif=\r\nferent niches are often (but not always) spacially distinct, so\n&gt; e.g. a fi=\r\nsh with legs moves on to land and has this whole new resource\n&gt; available. =\r\nIt not longer has to compete with sharks, etc, so yes it\n&gt; only has to be c=\r\nompetetive in that niche, which initially was very\n&gt; easy once you figured =\r\nout how to grow legs and breath air. Each newly\n&gt; complex strategy potentia=\r\nlly put the critter in question into virgin\n&gt; territory - an easy life but =\r\none that was only made possible by a new\n&gt; and more complex strategy.\n&gt; \n\nI=\r\n agree that competition is often localized within and between certain niche=\r\ns, Ken and I have a publication at GECCO this year related to that idea. Bu=\r\nt I think the larger point is that within these niches, a complex strategy =\r\nis being discovered to do something that could ultimately be accomplished i=\r\nn a much simpler way; i.e. if the goal is reproduction, you can do it bette=\r\nr by being a bacteria. \n\nNatural evolution ultimately is a process that fin=\r\nds many ways to do the same thing -- reproduce. So in some sense, the compl=\r\nexity of human beings is like that of a rube-goldberg machine: exceedingly =\r\ncomplex, but ultimately the output (a fertilized egg cell) is the same as t=\r\nhat of a bacteria (one cell). While humans are certainly well-adapted to ou=\r\nr particular niche, the complexity is unwarranted for the task. I think a s=\r\nimilar example in EC would be discovering a pole balancer that juggled pole=\r\ns while doing wheelies and bouncing. While incredibly cool, the level of co=\r\nmplexity is unbalanced with respect to the ultimate product (keeping the po=\r\nles balanced). \n\n&gt; No we would never find human beings in that domain, and =\r\nnor should we\n&gt; expect to. The essential quality of my above argument is th=\r\nat each\n&gt; complexification allowed colonisation of a new space that couldn&#39;=\r\nt be\n&gt; reached with simpler strategies. If there is a simple strategy for\n&gt;=\r\n pole balancing then we have found a global optimum and there is\n&gt; nowhere =\r\nin teh fitness landscape that leads on from there. It&#39;s a dead\n&gt; end. The f=\r\nitness space is lacking sufficient complexity to evolve\n&gt; anything more com=\r\nplex than the domain requires.\n&gt; \n&gt; Note that this isn&#39;t necessarily an arg=\r\nument against novelty search, I\n&gt; suspect that it still stands as a compete=\r\ntive search strategy for\n&gt; certian classes of domain with the computational=\r\n resource restrictions\n&gt; we have.\n&gt; \n\nI think this may be where we most dis=\r\nagree; it seems true that somewhere within the infinite space of NEAT/Hyper=\r\nNEAT encoding schemes, that some sort of sophisticated brain exists (obviou=\r\nsly, finding or reaching it is exceedingly difficult). If this is the case,=\r\n then couldn&#39;t this brain also potentially evolve in any domain, despite it=\r\ns simplicity? Of course, such intelligence may be completely unnecessary; a=\r\ns is human-level intelligence to reproduction. \n\nFor example, a maze-naviga=\r\nting robot traversing a 2d-maze could learn how to navigate the maze by mak=\r\ning turns and motions based on deriving new digits of Pi through some spect=\r\nacular recurrence. The question is if there is a reward scheme that could s=\r\nomehow lead to this (or equally complex) behavior through some process wher=\r\ne various inefficient yet interesting navigators were generated, or if such=\r\n a reward scheme is impossible.\n\nMy argument is that there are simple ways =\r\nto reproduce, just as there are simple ways to navigate mazes. I think we b=\r\noth agree that reaching new niches (utilizing new resources) is only possib=\r\nle because of exploring existing ways of life (existing utilization of reso=\r\nurces). However, our key disagreement is whether the complexity that arises=\r\n in natural evolution really is in some sense rube-goldbergian in the same =\r\nway as a Pi-deriving maze navigator.\n\nJoel\n\n\n"}}