{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[{"name":"READ"}]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"userId":487025037,"authorName":"afcarl2","from":"&quot;afcarl2&quot; &lt;afcarl2@...&gt;","profile":"afcarl2","replyTo":"LIST","senderId":"GA0DdAK9nA_FDDt6tXZ2redOb-2jUNOL8tZUnMlPJ8XZZ9I1ZCIwagsIypH84G_iSHnECy4hURE-B-MACxoekCb010M","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Re : [neat] Musings On Lessons Learned From BlindBuilder Applied To NEAT & Indirect Encoding","postDate":"1321993096","msgId":5707,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGphaDAyOCsybzgwQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDEzMjE5MTk3NTkuMTk0NTAuWWFob29NYWlsTmVvQHdlYjI5NTE1Lm1haWwuaXJkLnlhaG9vLmNvbT4="},"prevInTopic":5700,"nextInTopic":5708,"prevInTime":5706,"nextInTime":5708,"topicId":5697,"numMessagesInTopic":5,"msgSnippet":"Hi, Reviewed the cited sections. Seems indirect encodings could be viewed as a type of user-defined application-specific module. Examples of module sets","rawEmail":"Return-Path: &lt;afcarl2@...&gt;\r\nX-Sender: afcarl2@...\r\nX-Apparently-To: neat@yahoogroups.com\r\nX-Received: (qmail 59862 invoked from network); 22 Nov 2011 20:18:18 -0000\r\nX-Received: from unknown (98.137.34.45)\n  by m8.grp.sp2.yahoo.com with QMQP; 22 Nov 2011 20:18:18 -0000\r\nX-Received: from unknown (HELO ng9-ip1.bullet.mail.ne1.yahoo.com) (98.138.215.180)\n  by mta2.grp.sp2.yahoo.com with SMTP; 22 Nov 2011 20:18:17 -0000\r\nX-Received: from [98.138.217.182] by ng9.bullet.mail.ne1.yahoo.com with NNFMP; 22 Nov 2011 20:18:17 -0000\r\nX-Received: from [69.147.65.149] by tg7.bullet.mail.ne1.yahoo.com with NNFMP; 22 Nov 2011 20:18:17 -0000\r\nX-Received: from [98.137.34.35] by t9.bullet.mail.sp1.yahoo.com with NNFMP; 22 Nov 2011 20:18:17 -0000\r\nDate: Tue, 22 Nov 2011 20:18:16 -0000\r\nTo: neat@yahoogroups.com\r\nMessage-ID: &lt;jah028+2o80@...&gt;\r\nIn-Reply-To: &lt;1321919759.19450.YahooMailNeo@...&gt;\r\nUser-Agent: eGroups-EW/0.82\r\nMIME-Version: 1.0\r\nContent-Type: text/plain; charset=&quot;ISO-8859-1&quot;\r\nContent-Transfer-Encoding: quoted-printable\r\nX-Mailer: Yahoo Groups Message Poster\r\nX-Yahoo-Newman-Property: groups-compose\r\nX-eGroups-Msg-Info: 1:6:0:0:0\r\nFrom: &quot;afcarl2&quot; &lt;afcarl2@...&gt;\r\nSubject: Re: Re : [neat] Musings On Lessons Learned From BlindBuilder Applied To NEAT & Indirect Encoding\r\nX-Yahoo-Group-Post: member; u=487025037; y=uxIhYKUA8Sn1cTyDhN0dtjtNKUJOGjBKOulEktV9p-br3A\r\nX-Yahoo-Profile: afcarl2\r\n\r\n\n\n\n\n\nHi,\nReviewed the cited sections. Seems indirect encodings could be vie=\r\nwed as a type of user-defined application-specific module. Examples of modu=\r\nle sets abound. Alphabet, Vocabulary, standardized bolts, data compression =\r\ntransfer functions... The point being, that the utility of module (or conce=\r\npt) sets, is a reduction in generic task complexity/construction plan size,=\r\n etc. The comfort of the &quot;universal approximator&quot; characteristic, is no mor=\r\ne a rational for evolutionary development from scratch using exclusively NN=\r\n formative elements, than attempting to assemble a car starting from the mo=\r\nlecular level, rather than being constrained to the utilization of standard=\r\nized parts & bolts. Being constrained to a fixed set of modules/concepts, m=\r\nay not enable total global optimization, but often times, &quot;close-enough&quot; is=\r\n just that, close enough. Getting close enough: optimizing based upon a fix=\r\ned size set of modules/concepts, and then tailoring w/ NN formative element=\r\ns. If the vocabulary shows itself to be too limiting, add as justifiably re=\r\nquired. But regardless of the process of how you identify the module/concep=\r\nt, those modules/concepts MUST be held inviolate within the genome, and thu=\r\ns not contribute to the dimensional operator disruption. Otherwise they are=\r\n no longer modules/concepts, but rather effectively only &quot;suggestions&quot;. And=\r\n their utility is lost or diminished as a consequence of their contribution=\r\n to the overall dimensional operator disruption. In other words, the genome=\r\n needs to have the ability to be partitioned into operator and non-operator=\r\n regions. The non-operator regions corresponding to the module/concept inte=\r\nrior functionality, and the operator region corresponding to everything els=\r\ne within the genome. Practically speaking, this requires at a minimum, node=\r\ns with uniquely addressable variable number inputs and outputs, with the at=\r\ntendant infrastructure to handle same. Once the utility of using a given bo=\r\nlt has been justified, you don&#39;t keep evolving the bolt! You shoot the &quot;bol=\r\nt engineer&quot;, and move on with the balance of the task at hand :)\n\nAndy\n\n---=\r\n In neat@yahoogroups.com, Alexandre Devert &lt;marmakoide@...&gt; wrote:\n&gt;\n&gt; Hi,\n=\r\n&gt; =C2=A0Agree, BlindBuilder is a nice case of &quot;compact encoding does not me=\r\nans good encoding&quot;, for the reasons you mentionned. Modules are the way to =\r\ngo, *BUT*... Most of time, when we say modules, it&#39;s some part of the genot=\r\nype which is taken and grafted somewhere else, verbatim. This is the level =\r\n0 of modularity, it makes tons of assumptions. Assumption that your problem=\r\n is nice enough to be trivially decomposible into subproblems solveable by =\r\nsubpart of genotypes. Assumption that your problem is nice enough to pave t=\r\nhe road for you, miraculy making the right modules to appear in the right o=\r\nrder. Yes, with an optimization which is mostly a a biased random walk... I=\r\n can go on long of that, but, well, let&#39;s remove that dust on my PhD thesis=\r\n and link it here (http://www.marmakoide.org/download/publications/adevert-=\r\nphd-thesis.pdf), and invite you to read from page 21, section 1.3.3, to the=\r\n end of Chapter 1, which is a good summary of my views on modularity, with\n=\r\n&gt;  of course credit for my PhD advisors, Vishnu bless them ^^\n&gt; \n&gt; =C2=A0\n&gt;=\r\n Dr. Devert Alexandre\n&gt; Lecturer at School Of Software Engineering of USTC\n=\r\n&gt; 166 Renai Road, Dushu Lake Higher Education Town\n&gt; Suzhou Industrial Park=\r\n,\n&gt; Suzhou, Jiangsu, People Republic of China\n&gt; \n&gt; \n&gt; _____________________=\r\n___________\n&gt;  De=C2=A0: afcarl2 &lt;afcarl2@...&gt;\n&gt; =C3=80=C2=A0: neat@yahoogr=\r\noups.com \n&gt; Envoy=C3=A9 le : Mardi 22 Novembre 2011 3h18\n&gt; Objet=C2=A0: [ne=\r\nat] Musings On Lessons Learned From BlindBuilder Applied To NEAT & Indirect=\r\n Encoding\n&gt;  \n&gt; \n&gt; =C2=A0 \n&gt; Alex,\n&gt; Your prior work associated w/ BlindBui=\r\nlder I believe is informative and applicable to possible updates to NEAT an=\r\nd indirect encodings in general. The growing disruptive impact of construct=\r\nion operators as the size of the construction plan increases, seemly underc=\r\nuts the benefit of compact nature of the approach, and also illustrates a f=\r\nundamental strength and weakness of NEAT. NEAT, starting from minimal size,=\r\n mitigates the disruptive nature of various operators at the beginning allo=\r\nwing for more effective use of computational resources for growing of the o=\r\nrganism in a profitable portion of the design space. But as organism size i=\r\nncreases, the growing disruptive impact of some operators, and where they a=\r\nre applied, increasingly bog down further progress.\n&gt; In the context of Bli=\r\nndBuilder, two examples are useful:\n&gt; 1) Bridge: The concept of a bridge is=\r\n simple and straight forward. From a construction perspective, could be ach=\r\nieved with a single element of appropriate size and orientation. While the =\r\nsize of the construction plan is vastly different based upon the characteri=\r\nstics of the formative elements, though the concept is still simple, the di=\r\nsruptive impact of various operators on form, fit, function and convergence=\r\n is also vastly different.\n&gt; 2) Wall: Also, the concept of a wall is simple=\r\n and straight forward. And again from a construction perspective, could be =\r\nachieved with a single element of appropriate size and orientation. The sam=\r\ne comments also apply regarding construction plan size and associated disru=\r\nptive impact of construction operators.\n&gt; The point being, that the sensiti=\r\nvity of the concept should not be subject to the scale of the formative ele=\r\nments, but rather the suitability of the formulation to the objectives of t=\r\nhe concept. In the construction context, this is more straight forward. The=\r\n overall objective is composed of a relatively few well known concepts take=\r\nn together in some relative orientations WRT each other (i.e. a house can b=\r\ne composed of four orthogonal walls and a roof). The construction operators=\r\n should be confined to refinement of suitability of the formative elements =\r\nand their orientations taken together WRT the individual concept, guided by=\r\n concept specific operator selection criteria (i.e. semi-separable multi-su=\r\nbobjectives).\n&gt; Of course, in the general case, the identification of conce=\r\npts is not as straight forward. But efforts to identify reusable genetic ma=\r\nterial snippets would most likely qualify as identification of concepts, an=\r\nd would thus likely benefit from: a) partitioning of the genome for applica=\r\ntion of operators, and b) application of concept specific operator selectio=\r\nn WRT concept suitability for the current overall objective.\n&gt; \n&gt; Andy\n&gt;\n\n\n=\r\n\n"}}