{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[{"name":"READ"}]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"userId":467342474,"authorName":"Jeff Clune","from":"Jeff Clune &lt;jeffclune@...&gt;","profile":"jeffreyclune","replyTo":"LIST","senderId":"3bCksddRhMKIfKP_z5E02WVbEdZtJuIpBT1kOjvPPv0X_CzjaqjFJxDe9lpujhMRDruZs5rHB4K44SQNtBhhkrcsXE0fmZFFdQ","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [neat] Re: Models of brains, what should we borrow from biology?","postDate":"1341987169","msgId":5826,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEMyRTE3MjVELTNEMUMtNDE1QS05QkNGLUIyOEVDQjAxQzRBRkBjb3JuZWxsLmVkdT4=","inReplyToHeader":"PENBK2R1aW1QWlp3MEJXbjg2Z3hXM2FoSmNVY18yVVhlUkNULWFxMjlpcHpXOWhrUExZQUBtYWlsLmdtYWlsLmNvbT4=","referencesHeader":"PENBK2R1aW1QWlp3MEJXbjg2Z3hXM2FoSmNVY18yVVhlUkNULWFxMjlpcHpXOWhrUExZQUBtYWlsLmdtYWlsLmNvbT4="},"prevInTopic":5810,"nextInTopic":5827,"prevInTime":5825,"nextInTime":5827,"topicId":5801,"numMessagesInTopic":16,"msgSnippet":"Hello Oliver, I m much delayed in reading all of this as I have been insanely busy lately, but I have a few thoughts that might help you out: 1) Be careful","rawEmail":"Return-Path: &lt;jclune@...&gt;\r\nX-Sender: jclune@...\r\nX-Apparently-To: neat@yahoogroups.com\r\nX-Received: (qmail 51342 invoked from network); 11 Jul 2012 15:10:03 -0000\r\nX-Received: from unknown (98.137.34.44)\n  by m1.grp.sp2.yahoo.com with QMQP; 11 Jul 2012 15:10:03 -0000\r\nX-Received: from unknown (HELO mail-pb0-f46.google.com) (209.85.160.46)\n  by mta1.grp.sp2.yahoo.com with SMTP; 11 Jul 2012 15:10:03 -0000\r\nX-Received: by pbbrp8 with SMTP id rp8so2135640pbb.19\n        for &lt;neat@yahoogroups.com&gt;; Wed, 11 Jul 2012 08:10:03 -0700 (PDT)\r\nX-Received: by 10.68.200.232 with SMTP id jv8mr78808656pbc.161.1342019403153;\n        Wed, 11 Jul 2012 08:10:03 -0700 (PDT)\r\nReturn-Path: &lt;jclune@...&gt;\r\nX-Received: from [192.168.1.34] ([125.167.176.25])\n        by mx.google.com with ESMTPS id tj4sm1872439pbc.33.2012.07.11.08.10.00\n        (version=TLSv1/SSLv3 cipher=OTHER);\n        Wed, 11 Jul 2012 08:10:02 -0700 (PDT)\r\nContent-Type: text/plain; charset=windows-1252\r\nMime-Version: 1.0 (Apple Message framework v1084)\r\nIn-Reply-To: &lt;CA+duimPZZw0BWn86gxW3ahJcUc_2UXeRCT-aq29ipzW9hkPLYA@...&gt;\r\nDate: Wed, 11 Jul 2012 13:12:49 +0700\r\nContent-Transfer-Encoding: quoted-printable\r\nMessage-Id: &lt;C2E1725D-3D1C-415A-9BCF-B28ECB01C4AF@...&gt;\r\nReferences: &lt;CA+duimPZZw0BWn86gxW3ahJcUc_2UXeRCT-aq29ipzW9hkPLYA@...&gt;\r\nTo: &lt;neat@yahoogroups.com&gt;\r\nX-Mailer: Apple Mail (2.1084)\r\nX-eGroups-Msg-Info: 1:12:0:0:0\r\nFrom: Jeff Clune &lt;jeffclune@...&gt;\r\nSubject: Re: [neat] Re: Models of brains, what should we borrow from biology?\r\nX-Yahoo-Group-Post: member; u=467342474; y=VUjV3xqzfrN5tYal-BMnSRMhUlPS_-TiXcMtcGaoMcc_WooV67u5\r\nX-Yahoo-Profile: jeffreyclune\r\n\r\nHello Oliver, \n\nI&#39;m much delayed in reading all of this as I have been insa=\r\nnely busy lately, but I have a few thoughts that might help you out:\n\n1) Be=\r\n careful with meta-evolution (evolving the parameters of evolutionary algor=\r\nithms). It sounds good in theory, but can be tricky in practice because evo=\r\nlution is short-sighted and conservative, preferring exploitation over expl=\r\noration, which can be very harmful vis a vis long-term adaptation. Check ou=\r\nt my PLoS Computational Biology paper for a smoking gun on this front (the =\r\nevolution of mutation rates). You may face the exact same problem if you go=\r\n down this road. [Note, however, that using a divergent search algorithm li=\r\nke novelty search may allow you to take better advantage of meta-evolution:=\r\n see Joel and Ken&#39;s 2012 alife review article on that subject.]\n\n2) Another=\r\n reason people do not throw all of the biology into the soup to see what ha=\r\nppens is because scientifically you end up in an impenetrable quagmire wher=\r\ne you can&#39;t figure out what is going on and you end up not learning much/an=\r\nything. The scientific method demands keeping all else equal, and if you ha=\r\nve a lot of variables you don&#39;t perfectly understand, it takes years to fig=\r\nure out what is going on if you are lucky! Even if you keep all else equal,=\r\n if you are doing so against a backdrop that involves a lot of complexity y=\r\nou don&#39;t understand, any difference you see may be due to an interaction ef=\r\nfect with one of the features in your backdrop...and that may invalidate ge=\r\nneralizing your result to other backdrops of interest. In my limited experi=\r\nence, I have found that most new scientists want to throw a million things =\r\ninto their model--especially biologically motivated phenomena--to see what =\r\nhappens, and as they grow older/more jaded/wiser/more experienced/gun shy/e=\r\ntc. they increasingly keep things as simple as possible. In fact, a pretty =\r\ngood heuristic for good hypothesis-testing science is to keep things absolu=\r\ntely as simple as possible while allowing the question to be asked. However=\r\n, that may not be a good heuristic for more exploratory science where you j=\r\nust set out and see what you discover. \n\n3) You should check out Julian Mil=\r\nler&#39;s papers on evolving a checkers player (with his student M. Khan, I bel=\r\nieve). Or, better, email/Skype him (he&#39;s an extremely nice guy and I&#39;m sure=\r\n he would be happy to talk to you). He decided in the last few years that h=\r\ne is running out of time as a scientist and has tenure and he has spent yea=\r\nrs keeping things as simple as possible, and he now just wants to do what h=\r\ne originally wanted to do when he started: throw as much biology in the sou=\r\np as possible and see if a golem crawls out. He has incorporated a ton of b=\r\niologically inspired low-level mechanisms in evolving neural networks. From=\r\n what I recall, however, it did become very difficult to figure out which i=\r\nngredients were essential and exactly what was going on because of all the =\r\ninvolved complexity. He may have updated results since I last checked in, h=\r\nowever. So, you may benefit the actual work that he has done on this front =\r\nand, more generally, from his opinions on the general scientific approach y=\r\nou are proposing. \n\nI hope that helps. Best of luck, and I look forward to =\r\nhearing what you learn!\n\nBest regards,\nJeff Clune\n\nPostdoctoral Fellow\nCorn=\r\nell University\njeffclune@...\njeffclune.com\n\nOn May 11, 2012, at 6:3=\r\n4 AM, Oliver Coleman wrote:\n\n&gt; Hi Ken,\n&gt; \n&gt; \n&gt; Yes, I&#39;m pretty sure that no=\r\nt all of the phenomena I listed are important; and that a good starting poi=\r\nnt in general is to assume that they are not. I also agree with your argume=\r\nnt that a lot of the low-level phenomena we see may be a result of implemen=\r\ntation with particular physical systems (and I would add perhaps as a resul=\r\nt of evolutionary happenstance). The CPPN is a particularly compelling exam=\r\nple of significant abstraction of developmental processes, producing many o=\r\nf the same features of the end result of developmental processes. One thing=\r\n it does abstract away, in the context of plastic networks, is the effect o=\r\nf external input on the developmental process (which may or may not be an i=\r\nssue depending on details of implementation, problem domain, etc...).\n&gt; \n&gt; =\r\nPerhaps we could also assume that, rather than some specific set of functio=\r\nns being the only workable set, what matters is having a workable combinati=\r\non of functions, and that there are many possible combinations that would w=\r\nork equally well. In this framework we could assume that biological neural =\r\nnetworks represent at least a reasonably good combination of low-level func=\r\ntions, and so we could use this combination as a guide (but of course this =\r\ndoesn&#39;t answer what functions in this combination are actually important, o=\r\nr what things can be abstracted away). Also, some combinations may be worka=\r\nble, but are far harder to evolve solutions with, or require much larger ne=\r\ntworks, etc (eg evolving networks incorporating neuromodulation of synaptic=\r\n plasticity can be much easier for some tasks than for those without this t=\r\nype of neuromodulation).\n&gt; \n&gt; I&#39;m intending to run some experiments to expl=\r\nore these questions (which phenomena are important, acceptable level of abs=\r\ntraction, etc), but of course to try and thoroughly explore all of these fu=\r\nnctions in many combinations would be a massive undertaking, and is not my =\r\nmain interest, so at some point I will have to pick a model and run with it=\r\n after only a few, hopefully well chosen, experiments... Perhaps one approa=\r\nch is to create flexible parameterised versions of these functions, and let=\r\n evolution determine what combination is right (like your approach describe=\r\nd in &quot;Evolving adaptive neural networks with and without adaptive synapses&quot;=\r\n, but perhaps more flexible and applied to more functions).\n&gt; \n&gt; Do you min=\r\nd if I post/quote some/all of this discussion in the comments of my blog po=\r\nst?\n&gt; \n&gt; Cheers,\n&gt; Oliver\n&gt; \n&gt; \n\n\n"}}