{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[{"name":"READ"}]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"userId":467342474,"authorName":"Jeff Clune","from":"Jeff Clune &lt;jeffclune@...&gt;","profile":"jeffreyclune","replyTo":"LIST","senderId":"b0JUj6Cj0XBpAVftHM3dCE_6-7u8DCUVnFyNjOY4q8-VTj2OKQLocVO1wJe_AwWIYBg2QuwGaUs0U_gPDKrtUGwaK9oT_r7c7Q","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [neat] New Paper: Ontogeny tends to recapitulate phylogeny in digital organisms","postDate":"1349651499","msgId":5899,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDg4NkEzNzYzLTZFODQtNDJBRi05RkY0LUNFMjNDMjdBNjk3QkBjb3JuZWxsLmVkdT4=","inReplyToHeader":"PGs0bXUwbStpNmk1QGVHcm91cHMuY29tPg==","referencesHeader":"PGs0bXUwbStpNmk1QGVHcm91cHMuY29tPg=="},"prevInTopic":5898,"nextInTopic":5900,"prevInTime":5898,"nextInTime":5900,"topicId":5888,"numMessagesInTopic":14,"msgSnippet":"Hello Ken, I agree with mostly everything you said. If we disagree about anything, I think it is a semantic issue of when to start using an adjective within a","rawEmail":"Return-Path: &lt;jclune@...&gt;\r\nX-Sender: jclune@...\r\nX-Apparently-To: neat@yahoogroups.com\r\nX-Received: (qmail 44357 invoked from network); 7 Oct 2012 23:12:05 -0000\r\nX-Received: from unknown (98.137.35.160)\n  by m8.grp.sp2.yahoo.com with QMQP; 7 Oct 2012 23:12:05 -0000\r\nX-Received: from unknown (HELO mail-wg0-f51.google.com) (74.125.82.51)\n  by mta4.grp.sp2.yahoo.com with SMTP; 7 Oct 2012 23:12:05 -0000\r\nX-Received: by mail-wg0-f51.google.com with SMTP id ed3so1796778wgb.8\n        for &lt;neat@yahoogroups.com&gt;; Sun, 07 Oct 2012 16:12:04 -0700 (PDT)\r\nX-Received: by 10.217.1.79 with SMTP id m57mr8485300wes.121.1349651524417;\n        Sun, 07 Oct 2012 16:12:04 -0700 (PDT)\r\nReturn-Path: &lt;jclune@...&gt;\r\nX-Received: from [192.168.0.2] (02d87e4f.bb.sky.com. [2.216.126.79])\n        by mx.google.com with ESMTPS id k20sm16439947wiv.11.2012.10.07.16.12.02\n        (version=TLSv1/SSLv3 cipher=OTHER);\n        Sun, 07 Oct 2012 16:12:03 -0700 (PDT)\r\nContent-Type: text/plain; charset=windows-1252\r\nMime-Version: 1.0 (Mac OS X Mail 6.1 &#92;(1498&#92;))\r\nIn-Reply-To: &lt;k4mu0m+i6i5@...&gt;\r\nDate: Mon, 8 Oct 2012 00:11:39 +0100\r\nContent-Transfer-Encoding: quoted-printable\r\nMessage-Id: &lt;886A3763-6E84-42AF-9FF4-CE23C27A697B@...&gt;\r\nReferences: &lt;k4mu0m+i6i5@...&gt;\r\nTo: neat users group group &lt;neat@yahoogroups.com&gt;\r\nX-Mailer: Apple Mail (2.1498)\r\nX-eGroups-Msg-Info: 1:12:0:0:0\r\nFrom: Jeff Clune &lt;jeffclune@...&gt;\r\nSubject: Re: [neat] New Paper: Ontogeny tends to recapitulate phylogeny in digital organisms\r\nX-Yahoo-Group-Post: member; u=467342474; y=x7L7VJNKscOlwOKjw6GRGwZuwYKnEwQwSE_bPqI56wd67HS-80aQ\r\nX-Yahoo-Profile: jeffreyclune\r\n\r\nHello Ken,\n\nI agree with mostly everything you said. If we disagree about a=\r\nnything, I think it is a semantic issue of when to start using an adjective=\r\n within a certain dimension. \n\nSee below for details. \n\n&gt; Hi Jeff, congrats=\r\n on another very interesting and thought-provoking paper. \n\nThanks. \n\n&gt; I a=\r\ngree with some of your points from your post but I also wanted to mention a=\r\n couple where I differ. \n&gt; \n&gt; I agree strongly with your conclusion that si=\r\nmply because phenotypic diversity is a good thing does not mean that genoty=\r\npic diversity should be discarded. They play different and complementary ro=\r\nles. I&#39;m glad to hear you drew that conclusion from this work.\n&gt; \n&gt; Where I=\r\n somewhat differ is on the &quot;bolting on&quot; issue. You mentioned that I have po=\r\ninted out that in target-based search evolution &quot;never takes the time to re=\r\ndesign from the ground up&quot; and keeps &quot;hacking in/bolting on new things that=\r\n happen to work.&quot; However, I would like to make a distinction between your =\r\ncharacterization and my view. First, my view is that *all* evolution &quot;never=\r\n takes the time to redesign from the ground up&quot; and keeps &quot;hacking in/bolti=\r\nng on new things that happen to work,&quot; both in non-objective and objective-=\r\nbased evolution. Those are ubiquitous qualities of evolution regardless of =\r\nhow it&#39;s rewarded: Its mutations are inherently ad hoc and it is virtually =\r\nimpossible to &quot;redesign&quot; an ad hoc construction in the middle of a search. =\r\nThat&#39;s true in nature, in Picbreeder, in objective-based algorithms, and pr=\r\nobably true in Avida (though I&#39;m not experienced in Avida).\n&gt; \n&gt; Second, in=\r\n my view the key distinction between non-objective and objective search is =\r\nthat objective search tends to produce representations that are *piecewise*=\r\n. In other words, while both non-object and objective search proceed in an =\r\nad-hoc &quot;bolting on&quot; manner, the bolted-on components in the objective searc=\r\nh tend to be irregular additions that slightly raise fitness at the expense=\r\n of ruining the representation for future generations. \n\nThis makes me thin=\r\nk we do disagree a bit about what happens in natural evolution, and simply =\r\ndisagree about what to call &#39;bolting on&#39;. I think in nature (and certainly =\r\nin Avida) we see exactly these same sort of piecewise, irregular additions =\r\nthat slightly raise fitness at the expense of ruining the representation fo=\r\nr future generations: that is actually what I mean by &#39;bolting on.&#39; Where I=\r\n think we agree is that the problem is worse for target-based search than m=\r\nore open-ended, diversity encouraging search (e.g natural evolution). It so=\r\nunds like we disagree slightly on how bad the bolting on is in nature. \n\n&gt; =\r\nThat is because in objective search there is no reward for establishing any=\r\n regularities. In non-objective search, on the other hand, often a regulari=\r\nty is preserved because it offers something fundamentally new (i.e. neither=\r\n good nor bad) and then later becomes the basis for endless elaboration (li=\r\nke bilateral symmetry).\n&gt;  You can&#39;t establish something like symmetry earl=\r\ny in an objective search because symmetry on its own looks nothing like the=\r\n final objective, even if theoretically it would be helpful in principle in=\r\n finding it. \n&gt; \n\nMy instincts tell me that even in natural evolution, most=\r\n major changes (e.g. bilateral symmetry) are initially bad, and thus select=\r\ned against. For me, it still is an interesting puzzle how such major change=\r\ns were not immediately selected against in nature. You&#39;re right that such m=\r\najor changes may be neutral or positive in novelty search. It sounds like w=\r\ne may differ in how much we think nature has objectives. Even if it has no =\r\noverall objective, there is always a pressure to be fit, which prevents a r=\r\neward for pure exploration and massive changes.   \n\n&gt; I&#39;m also not sure whe=\r\nther it&#39;s really accurate to say Avida is &quot;not target-based.&quot; It&#39;s true tha=\r\nt it&#39;s not as explicit as a single simple objective function, but the fact =\r\nthat there are several logical operations that explicitly give an advantage=\r\n to organisms that execute them actually does create a form of objective-dr=\r\niven pressure. In other words, the creativity of evolution in Avida with su=\r\nch a priori human-defined rewards is to some extent hampered by the need to=\r\n stay competitive on those arbitrary objectives. So I&#39;d expect it to be clo=\r\nser to objective search (when used in that mode) than non-objective search,=\r\n though somewhere on the continuum between them. I also understand that Avi=\r\nda as a platform doesn&#39;t have to be run with those rewards, but if I unders=\r\ntand correctly they are traditional and used in this particular paper as we=\r\nll.\n&gt; \n\nI agree with you. Avida is likely more towards non-objective search=\r\n than target-based search, but probably not by that much. You&#39;d likely get =\r\na stronger argument from Charles Ofria about it being more open-ended, but =\r\nI&#39;ve always thought that Avida (and all alife simulations) are still rather=\r\n target-based. That&#39;s why I don&#39;t put too much stock in the argument that n=\r\not having an explicit fitness function makes some alife simulations more in=\r\nteresting: I usually think they do have an explicit fitness function, it&#39;s =\r\njust a complicated one that we don&#39;t understand as much as others. \n\n&gt; Howe=\r\nver, I think these differences in perspective don&#39;t really detract from the=\r\n main point of the paper regarding ontogeny and phylogeny. But I mention th=\r\nem mainly as a side-conversation on objective vs. non-objective search and =\r\ntheir effects.\n&gt; \n\nI agree. None of these issues relate to the major contri=\r\nbution of the paper. These subjects are more the sort of things I thought a=\r\nbout as implications for my paper for the subjects discussed on this list. =\r\nI&#39;m glad to have the chance to discuss them here. \n\nThanks for letting me k=\r\nnow your thoughts,\nJeff\n\n&gt; ken\n&gt; \n&gt; --- In neat@yahoogroups.com, Jeff Clune=\r\n &lt;jeffclune@...&gt; wrote:\n&gt; &gt;\n&gt; &gt; Hello all,\n&gt; &gt; \n&gt; &gt; I wanted to let you kno=\r\nw about a new paper I recently published. I did not use NEAT, but there are=\r\n messages in the paper that relate to some of the conversations we&#39;ve had o=\r\nn this list.\n&gt; &gt; \n&gt; &gt; Clune J, Pennock RT, Ofria C, Lenski RE\n&gt; &gt; Ontogeny =\r\ntends to recapitulate phylogeny in digital organisms. \n&gt; &gt; The American Nat=\r\nuralist. 2012. 180: E54=96E63.\n&gt; &gt; PDF: http://jeffclune.com/publications/2=\r\n012-CluneEtAl-OntegenyRecapitulatesPhylogeny-AmNat.pdf\n&gt; &gt; Popular press wr=\r\niteup of the paper: http://www.sciencedaily.com/releases/2012/08/1208101331=\r\n55.htm\n&gt; &gt; \n&gt; &gt; The first relevant subject regards evolving good representa=\r\ntions. The work of Joel, Ken, and colleagues has shown some interesting thi=\r\nngs regarding when we can expect bad representations, such as in target-bas=\r\ned search, where evolution keeps hacking in/bolting on new things that happ=\r\nen to work, and never takes the time to redesign from the ground up (or eve=\r\nn at middle levels). Nature, however, does something similar (though perhap=\r\ns to a much lesser degree): vestigial organs and developmental stages hang =\r\naround, including intermediate developmental forms that are built and then =\r\ndissolve entirely. In this paper we looked into whether we could see eviden=\r\nce of that &quot;bolting on&quot; in Avida, a digital evolution platform that is not =\r\ntarget-based in that it does not have an explicit fitness function. We foun=\r\nd evidence for bolting on, just as we would expect from the existence of ve=\r\nstigial developmental stages in biological organisms: new functionality ten=\r\nded to appear later in the development of an organism, because mutations th=\r\nat changed things more fundamentally/deeper in the representation were more=\r\n likely to be deleterious and were more quickly weeded out by selection. I =\r\nthink the lesson is that this bolting on process is largely inevitable, tho=\r\nugh I think it is a fascinating question whether it is less of an issue in =\r\ndivergent search vs. convergent search. \n&gt; &gt; \n&gt; &gt; A second issue related to=\r\n this list is that, because evolution tends to quickly select away mutation=\r\ns that deeply change representations, it is likely a good idea to have some=\r\nthing like the genomic diversity protection in NEAT. Because recent work ha=\r\ns shown that phenotypic/behavioral diversity is more effective than genotyp=\r\nic diversity, many people may be switching to phenotypic diversity and aban=\r\ndoning genomic diversity: this work suggests that both may be important. Fo=\r\nr example, mutations that affect a representation deeply may initially hurt=\r\n the organism&#39;s ability to do something behaviorally different/interesting,=\r\n for the same reason that such mutations hurts fitness (e.g. they cripple t=\r\nhe organism). Protecting that innovation for a while may thus pay off. In o=\r\nther words, because selection will quickly work to eliminate deep changes, =\r\nwe should probably protect them for a while if we want to see better repres=\r\nentations emerge. \n&gt; &gt; \n&gt; &gt; In the paper, we focus on an interesting conseq=\r\nuence of bolting on: if new functionality is added to the end of an organis=\r\nm&#39;s life, then the order that an organism develops will tend to contain inf=\r\normation about the order that traits evolved in its lineage, and vice-versa=\r\n. That helps settle an age old debate by showing that &quot;ontogeny tends to re=\r\ncapitulate phylogeny&quot;. \n&gt; &gt; \n&gt; &gt; Please let me know if you have any questio=\r\nns or comments. \n&gt; &gt; \n&gt; &gt; Best regards,\n&gt; &gt; Jeff Clune\n&gt; &gt; \n&gt; &gt; Visiting Sc=\r\nientist\n&gt; &gt; Cornell University\n&gt; &gt; jeffclune@...\n&gt; &gt; jeffclune.com\n&gt; &gt;\n&gt; \n&gt;=\r\n \n\n\n"}}