{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[{"name":"READ"}]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"userId":331172310,"authorName":"Nicolas Bredeche","from":"Nicolas Bredeche &lt;nekonaute@...&gt;","profile":"nekonaute","replyTo":"LIST","senderId":"UZFiMM5wJ37yIJmNKEnvEEqRnzGZS5ov27UAbtEYJYUGFKYUSyHLGMJVOuZrOQm1zIaelyciVbq_lJ6jYS0FC1HmF7Eq4UuXLZFrzA","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [neat] New Paper: Ontogeny tends to recapitulate phylogeny in digital organisms","postDate":"1350291640","msgId":5916,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PENBTGduK0p6MmowMXctZ1BTdE4xUmNNdHpEQXBiWWRlRUx6WEpPcUQ4M0wrN2ppVjg4d0BtYWlsLmdtYWlsLmNvbT4=","inReplyToHeader":"PDc2MDc5RkExLTlGQzQtNERDOC1BMzAxLUM5QjU3ODBEQkRGNEBjb3JuZWxsLmVkdT4=","referencesHeader":"PGs0bXUwbStpNmk1QGVHcm91cHMuY29tPiA8NTNGNkFGMEEtOTI2Ri00RjJCLUEzNTUtRjQ0RjNFMkE1QkE5QGNvcm5lbGwuZWR1PiA8Q0FMZ24rSnlqa2RHNmVkbXRLWkFjOThUN3g4dl9Kd0FtbXBKZ1NqTERjb3VGQS1hc3N3QG1haWwuZ21haWwuY29tPiA8NzYwNzlGQTEtOUZDNC00REM4LUEzMDEtQzlCNTc4MERCREY0QGNvcm5lbGwuZWR1Pg=="},"prevInTopic":5911,"nextInTopic":0,"prevInTime":5915,"nextInTime":5917,"topicId":5888,"numMessagesInTopic":14,"msgSnippet":"Ken, Jeff, thanks for the feedback! Regarding novelty search as *not* being objective-driven, I (now) agree with both of you that it is misleading to classify","rawEmail":"Return-Path: &lt;nicolas.bredeche@...&gt;\r\nX-Sender: nicolas.bredeche@...\r\nX-Apparently-To: neat@yahoogroups.com\r\nX-Received: (qmail 79905 invoked from network); 15 Oct 2012 09:01:11 -0000\r\nX-Received: from unknown (98.137.34.45)\n  by m5.grp.sp2.yahoo.com with QMQP; 15 Oct 2012 09:01:11 -0000\r\nX-Received: from unknown (HELO mail-lb0-f182.google.com) (209.85.217.182)\n  by mta2.grp.sp2.yahoo.com with SMTP; 15 Oct 2012 09:01:10 -0000\r\nX-Received: by mail-lb0-f182.google.com with SMTP id b5so3134291lbd.41\n        for &lt;neat@yahoogroups.com&gt;; Mon, 15 Oct 2012 02:01:10 -0700 (PDT)\r\nX-Received: by 10.152.104.107 with SMTP id gd11mr9306632lab.25.1350291670232;\n Mon, 15 Oct 2012 02:01:10 -0700 (PDT)\r\nMIME-Version: 1.0\r\nX-Received: by 10.114.17.66 with HTTP; Mon, 15 Oct 2012 02:00:40 -0700 (PDT)\r\nIn-Reply-To: &lt;76079FA1-9FC4-4DC8-A301-C9B5780DBDF4@...&gt;\r\nReferences: &lt;k4mu0m+i6i5@...&gt; &lt;53F6AF0A-926F-4F2B-A355-F44F3E2A5BA9@...&gt;\n &lt;CALgn+JyjkdG6edmtKZAc98T7x8v_JwAmmpJgSjLDcouFA-assw@...&gt; &lt;76079FA1-9FC4-4DC8-A301-C9B5780DBDF4@...&gt;\r\nDate: Mon, 15 Oct 2012 11:00:40 +0200\r\nX-Google-Sender-Auth: GW27XYUs8XB3Rlyh8UspXFD7O00\r\nMessage-ID: &lt;CALgn+Jz2j01w-gPStN1RcMtzDApbYdeELzXJOqD83L+7jiV88w@...&gt;\r\nTo: neat@yahoogroups.com\r\nContent-Type: multipart/alternative; boundary=f46d04088d1158efeb04cc15477a\r\nX-eGroups-Msg-Info: 1:12:0:0:0\r\nFrom: Nicolas Bredeche &lt;nekonaute@...&gt;\r\nSubject: Re: [neat] New Paper: Ontogeny tends to recapitulate phylogeny in\n digital organisms\r\nX-Yahoo-Group-Post: member; u=331172310; y=hapqEy-5_UWQqJH0tO_BB80a-A5Evnc-GH0y21uEDsB6AyFZ\r\nX-Yahoo-Profile: nekonaute\r\n\r\n\r\n--f46d04088d1158efeb04cc15477a\r\nContent-Type: text/plain; charset=ISO-8859-1\r\n\r\nKen, Jeff, thanks for the feedback!\n\nRegarding novelty search as *not* being objective-driven, I (now) agree\nwith both of you that it is misleading to classify it as an implicit\nobjective function, though novelty search is also a user-defined function\nthat can be used during optimization. The difference between explicit and\nimplicit fitness functions is more to be found on the level of details used\nto write the objective function (of course, i agree there is a continuum\nbetween the two), which may depend on the background knowledge available to\nthe designer. Novelty is quite orthogonal to this classification (and\nshould be removed from my table), and could be relevant whether we are\ndealing with an objective-driven or an environment-driven\nlearning/adaptation problem.\n\nThen, I would still defend that the difference between objective-driven and\nenvironment-driven is an essential one, and I would not say that\nenvironment-driven is a synonym of non-objective-driven. The fact that the\nenvironment (rather than a pre-defined objective function) shapes the\nlearning/adaptation process also implies to be able to capture (explicitly\nor not) the possibly dynamic fitness function(s) hidden within the\nenvironment. With an objective-driven problem, you may be already one step\nahead as you get a formulation of the objective from the start, but you may\nalso be misleaded if the ultimate goal is to, say, just survive, and you\nhave few, possibly wrong, assumptions on how to achieve such a goal. In\nthis context, i guess you&#39;d be better starting off with no assumption and\ngradualy improving using feedback directly from the environment. In both\ncases though, you may end up in one particular region of the search space -\nwhich is different from what you expect from a non-objective-driven search.\n\nSurely, it depends on the problem at hand and I guess what I say there is\ninfluenced by my own work about self-adaptive (ie. environment-driven)\nswarm of autonomous agents: in this scope, we used some pretty\nstraight-forward random selection mechanisms (as selection pressure is\nindirectly at work at the swarm level), sometimes slightly biased by, for\nexample, kin-selection and alike. From this perspective, selection pressure\ntowards novelty could be used to maintain some kind of diversity and\npressure towards innovation within the population, which may turn out to be\nan efficient way to survive whenever, say, the environment changes (we did\nnot try it yet, though, and i guess it would require more than a naive\nimplementation to take the full benefit out of it). Hence, novelty would\nstand as a mean to an end, but not as the objective per se.\n\nOf course, as you both said, the true challenge with open-ended evolution\nremains to identify which are the properties and/or mechanisms to truly\nachieve it. Adding a pressure towards novelty may be one part of the\nsolution, as would be considering a pressure towards complexity, niching,\netc. Still, this does not define the problems, as my initial classification\nwas about, but it rather sketches a yet-to-be-completed roadmap towards\nopen-ended evolution.\n\nNicolas\n\nps: for the record, note that the original distinction between implicit and\nexplicit fitness functions is discussed extensively in Nolfi and Floreano&#39;s\nbook on ER from 2000, p. 67.\n\r\n--f46d04088d1158efeb04cc15477a\r\nContent-Type: text/html; charset=ISO-8859-1\r\nContent-Transfer-Encoding: quoted-printable\r\n\r\nKen, Jeff, thanks for the feedback! &lt;br&gt;&lt;br&gt;Regarding novelty search as *no=\r\nt* being objective-driven, I (now) agree with both of you that it is mislea=\r\nding to classify it as an implicit objective function, though novelty searc=\r\nh is also a user-defined function that can be used during optimization. The=\r\n difference between explicit and implicit fitness functions is more to be f=\r\nound on the level of details used to write the objective function (of cours=\r\ne, i agree there is a continuum between the two), which may depend on the b=\r\nackground knowledge available to the designer. Novelty is quite orthogonal =\r\nto this classification (and should be removed from my table), and could be =\r\nrelevant whether we are dealing with an objective-driven or an environment-=\r\ndriven learning/adaptation problem.&lt;br&gt;\n\n&lt;br&gt;Then, I would still defend tha=\r\nt the difference between objective-driven and environment-driven is an esse=\r\nntial one, and I would not say that environment-driven is a synonym of non-=\r\nobjective-driven. The fact that the environment (rather than a pre-defined =\r\nobjective function) shapes the learning/adaptation process also implies to =\r\nbe able to capture (explicitly or not) the possibly dynamic fitness functio=\r\nn(s) hidden within the environment. With an objective-driven problem, you m=\r\nay be already one step ahead as you get a formulation of the objective from=\r\n the start, but you may also be misleaded if the ultimate goal is to, say, =\r\njust survive, and you have few, possibly wrong, assumptions on how to achie=\r\nve such a goal. In this context, i guess you&#39;d be better starting off w=\r\nith no assumption and gradualy improving using feedback directly from the e=\r\nnvironment. In both cases though, you may end up in one particular region o=\r\nf the search space - which is different from what you expect from a non-obj=\r\nective-driven search.&lt;br&gt;\n\n&lt;br&gt;Surely, it depends on the problem at hand an=\r\nd I guess what I say there is influenced by my own work about self-adaptive=\r\n (ie. environment-driven) swarm of autonomous agents: in this scope, we use=\r\nd some pretty straight-forward random selection mechanisms (as selection pr=\r\nessure is indirectly at work at the swarm level), sometimes slightly biased=\r\n by, for example, kin-selection and alike. From this perspective, selection=\r\n pressure towards novelty could be used to maintain some kind of diversity =\r\nand pressure towards innovation within the population, which may turn out t=\r\no be an efficient way to survive whenever, say, the environment changes (we=\r\n did not try it yet, though, and i guess it would require more than a naive=\r\n implementation to take the full benefit out of it). Hence, novelty would s=\r\ntand as a mean to an end, but not as the objective per se.&lt;br&gt;\n\n&lt;br&gt;Of cour=\r\nse, as you both said, the true challenge with open-ended evolution remains =\r\nto identify which are the properties and/or mechanisms to truly achieve it.=\r\n Adding a pressure towards novelty may be one part of the solution, as woul=\r\nd be considering a pressure towards complexity, niching, etc. Still, this d=\r\noes not define the problems, as my initial classification was about, but it=\r\n rather sketches a yet-to-be-completed roadmap towards open-ended evolution=\r\n.&lt;br&gt;\n\n&lt;br&gt;Nicolas&lt;br&gt;&lt;br&gt;ps: for the record, note that the original distin=\r\nction between implicit and explicit fitness functions is discussed extensiv=\r\nely in Nolfi and Floreano&#39;s book on ER from 2000, p. 67.&lt;br&gt;&lt;br&gt;&lt;br&gt;&lt;br=\r\n&gt;\n\r\n--f46d04088d1158efeb04cc15477a--\r\n\n"}}