{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[{"name":"READ"}]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"userId":543004838,"authorName":"martin_pyka","from":"&quot;martin_pyka&quot; &lt;martin.pyka@...&gt;","profile":"martin_pyka","replyTo":"LIST","senderId":"pZeGi6SjCirJhdvfBRO_Cd6dHa717H7Y4T1q1YlNtumZ9dtdUQUvGTqnV5BO11GWGg7IfB9mcqKpp-_Mgrq3U91eYEnt8RiHcrR-XQ","spamInfo":{"isSpam":false,"reason":"3"},"subject":"Re: New paper on why modules evolve, and how to evolve modular artificial neural networks","postDate":"1360878499","msgId":5996,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGtmam0zMys4N3VpQGVHcm91cHMuY29tPg=="},"prevInTopic":5993,"nextInTopic":5997,"prevInTime":5995,"nextInTime":5997,"topicId":5976,"numMessagesInTopic":30,"msgSnippet":"... I might be wrong here but i think - on the physiological level - most parts of the neocortex can t be separated into modules (or areas) by looking for high","rawEmail":"Return-Path: &lt;martin.pyka@...&gt;\r\nX-Sender: martin.pyka@...\r\nX-Apparently-To: neat@yahoogroups.com\r\nX-Received: (qmail 66020 invoked from network); 14 Feb 2013 21:48:20 -0000\r\nX-Received: from unknown (10.193.84.168)\n  by m3.grp.bf1.yahoo.com with QMQP; 14 Feb 2013 21:48:20 -0000\r\nX-Received: from unknown (HELO ng6-vm5.bullet.mail.gq1.yahoo.com) (98.136.219.70)\n  by mta6.grp.bf1.yahoo.com with SMTP; 14 Feb 2013 21:48:20 -0000\r\nX-Received: from [98.137.0.89] by ng6.bullet.mail.gq1.yahoo.com with NNFMP; 14 Feb 2013 21:48:19 -0000\r\nX-Received: from [10.193.94.108] by tg9.bullet.mail.gq1.yahoo.com with NNFMP; 14 Feb 2013 21:48:19 -0000\r\nDate: Thu, 14 Feb 2013 21:48:19 -0000\r\nTo: neat@yahoogroups.com\r\nMessage-ID: &lt;kfjm33+87ui@...&gt;\r\nUser-Agent: eGroups-EW/0.82\r\nMIME-Version: 1.0\r\nContent-Type: text/plain; charset=&quot;ISO-8859-1&quot;\r\nContent-Transfer-Encoding: quoted-printable\r\nX-Mailer: Yahoo Groups Message Poster\r\nX-Yahoo-Newman-Property: groups-compose\r\nX-eGroups-Msg-Info: 2:3:4:0:0\r\nFrom: &quot;martin_pyka&quot; &lt;martin.pyka@...&gt;\r\nSubject: Re: New paper on why modules evolve, and how to evolve modular artificial neural networks\r\nX-Yahoo-Group-Post: member; u=543004838; y=O9jPFJnGzNPdpuJ7UUJfkopQ4QlAUWCS_1FEur0YOJlFcHVOMAZ8Bw29Tv_xhruMrs1_PGihu6RnNsY\r\nX-Yahoo-Profile: martin_pyka\r\n\r\n&gt; Another definition I use is a functionally encapsulated unit, with high i=\r\nntra-modular interactions and few inter-modular interactions. That is consi=\r\nstent with the Kashtan and Alon definition you mention, but it is not speci=\r\nfic to networks. See the Lipson paper we cite for a longer discussion of th=\r\nese definitions. \n&gt; \n&gt; How would using the cytoarchitecture change our meas=\r\nure of modularity? My guess is that you&#39;d end up with roughly the same iden=\r\ntified modules, but that may be because I don&#39;t understand what you are sug=\r\ngesting.\n\nI might be wrong here but i think - on the physiological level - =\r\nmost parts of the neocortex can&#39;t be separated into modules (or areas) by l=\r\nooking for high intra-modul connectivity and low inter-modul connectivity. =\r\nI thought, it&#39;s more the different cell types and their layering (e.g. Brod=\r\nmann Areas) that allow us to define several anatomical areas within the cor=\r\ntex (which can also be related to different functions). But I am not an exp=\r\nert in anatomy.   \n \n&gt; \n&gt; &gt; 2. Emergence of modularity: independent from th=\r\ne definition, I don&#39;t see, why network modules should evolve in different w=\r\nays like other organic structures. To my mind, the same principles that lea=\r\nd to the formation of global patterns in the organism contribute also to th=\r\ne formation of specific brain structures (favoring to my mind the cytoarchi=\r\ntectural perspective).\n&gt; &gt; \n&gt; Did you get the impression from somewhere tha=\r\nt I believe that network modules evolve differently than modules in other s=\r\ntructures? I have not stated that (that I can recall). I think it is possib=\r\nle that this connection cost idea may also apply to many different types of=\r\n structures (e.g. organs and kinematic linkages). \n\nok, I think I misunders=\r\ntood here something. Influenced by the paper of van Ooyen, I regarded the n=\r\number of connections in a network as a property that arises from purely sel=\r\nf-organizing principles (which are only little influenced by the encoding).=\r\n From this perspective, your paper would state that modules can arise witho=\r\nut any definition of modules in the genetic code (arguing against global pa=\r\nttern formation as the driving factor for the evolutionary origin of module=\r\ns). However, I think you regard the number of connections (and possibly the=\r\n targets of connections) as part of the genetic code (as you do it in your =\r\nsimulations). In this case, connection cost influences the genetic code tow=\r\nards lower connections and thereby producing an encoding for modules. \n\nThi=\r\ns leads to the question, how much depends the number of connections in a ne=\r\nural network on the encoding (and how much just on environmental factors / =\r\nphysical laws)?\n\n\n&gt; \n&gt; &gt; Clearly influenced by the cited articles, my humbl=\r\ne and unproven opinion is that modularity emerges as a side-effect of the f=\r\nact that sensors and motors already represent something like modules and th=\r\nat self-organizing mechanisms and mechanisms to evolve and alter global pat=\r\nterns contribute to the elaboration of these modules.\n&gt; &gt; \n&gt; &gt; \n&gt; The brain=\r\n is a huge collection of 100 trillion connections and billions of neurons=\r\n=85very few of those directly connect to external sensors and actuators. Do=\r\n you think that spatial segregation of sensors and actuators drives the evo=\r\nlution of modularity within the brain itself (e.g. in the neo-cortical colu=\r\nmn, a module that is repeated over and over inside the cortex)? \n\nNo, I don=\r\n&#39;t think that :o). I was just refering to the title of your paper and hypot=\r\nhesizing that &quot;the evolutionary origin of modularity&quot; may come from the mod=\r\nularity of the rest of the organism.\n\n&gt; I think it is possible that this co=\r\nnnection cost idea may also apply to many different types of structures (e.=\r\ng. organs and kinematic linkages). \n\nYes, maybe. Have you followed the disc=\r\nussions in the article of your paper over at technologyreview.com? There ar=\r\ne some nice comments relating this work to the second law of thermodynamics=\r\n (and suggesting you for the Nobel Price :)). Indeed, physical limitations =\r\nin the number of connections (in any system) constrain the search space in =\r\nevolution. Still, I don&#39;t see how a factor - like connection cost - could f=\r\nacilitate the emergence of large scale networks (e.g. something like differ=\r\nent cytoarchitectures). Therefore, I am wondering what kind of other factor=\r\ns drive modularization.\n\nAnyway, I really enjoy thinking about these kinds =\r\nof questions and discussing them here with you. This is normally something =\r\nI am looking for when I am visiting conferences. It&#39;s good to have this for=\r\num here to debate these topics without time pressure.\n\nMartin\n\n\n"}}