{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[{"name":"READ"}]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"userId":82117382,"authorName":"Jim O&#39;Flaherty, Jr.","from":"&quot;Jim O&#39;Flaherty, Jr.&quot; &lt;jim_oflaherty_jr@...&gt;","profile":"jim_oflaherty_jr","replyTo":"LIST","senderId":"9JTGtXFGCpnQAOBC9eADBvXydQxzQ0nvLfRTOKGxX1-WSt0jqdkiJnuPnyDOIutfxOjWlnt8j_q99TaeeNSGgcTUe4iIeOUVBtMZ2zh_7upK0F-Gerws3xg","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Introduction...","postDate":"1062906369","msgId":60,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGJqZTltMSsxcHUxQGVHcm91cHMuY29tPg=="},"prevInTopic":0,"nextInTopic":2149,"prevInTime":59,"nextInTime":61,"topicId":60,"numMessagesInTopic":5,"msgSnippet":"Hi All, I am one of the guys meeting every two weeks with Derek and Philip. At present, I have read the papers Derek has sent me on NEAT.  And I have read the","rawEmail":"Return-Path: &lt;jim_oflaherty_jr@...&gt;\r\nX-Sender: jim_oflaherty_jr@...\r\nX-Apparently-To: neat@yahoogroups.com\r\nReceived: (qmail 99275 invoked from network); 7 Sep 2003 03:46:31 -0000\r\nReceived: from unknown (66.218.66.172)\n  by m14.grp.scd.yahoo.com with QMQP; 7 Sep 2003 03:46:31 -0000\r\nReceived: from unknown (HELO n39.grp.scd.yahoo.com) (66.218.66.107)\n  by mta4.grp.scd.yahoo.com with SMTP; 7 Sep 2003 03:46:22 -0000\r\nReceived: from [66.218.67.148] by n39.grp.scd.yahoo.com with NNFMP; 07 Sep 2003 03:46:11 -0000\r\nDate: Sun, 07 Sep 2003 03:46:09 -0000\r\nTo: neat@yahoogroups.com\r\nSubject: Introduction...\r\nMessage-ID: &lt;bje9m1+1pu1@...&gt;\r\nUser-Agent: eGroups-EW/0.82\r\nMIME-Version: 1.0\r\nContent-Type: text/plain; charset=ISO-8859-1\r\nContent-Length: 3984\r\nX-Mailer: Yahoo Groups Message Poster\r\nFrom: &quot;Jim O&#39;Flaherty, Jr.&quot; &lt;jim_oflaherty_jr@...&gt;\r\nX-Yahoo-Group-Post: member; u=82117382\r\nX-Yahoo-Profile: jim_oflaherty_jr\r\n\r\nHi All,\n\nI am one of the guys meeting every two weeks with Derek and Philip.\n\nAt present, I have read the papers Derek has sent me on NEAT.  And I \nhave read the ai_junky book AI Techniques...  I have not done any \nexperimentation with NEAT itself.  I have read several other books, \nbut have not formally studied any of this at any institution.\n\nMy interests at present lie almost exclusively in the domain of \napplying GAs/ANNs to &quot;open perfect information non-random two player \nturned based&quot; games.  Examples would be Checkers (including \nChinese), Chess (including Chinese), Go, Pente, Reversi, Connect 4, \netc.\n\nUltimately, my current &quot;stake in the ground&quot; is Go.  While I have \nnot played in some years, I am an 6k Go player.  I have studied many \ngames of Go and have a pretty good understanding of what makes Go so \ndifficult to &quot;program&quot;.  At present, I personally have been able to \nbest all of the computer Go programs as recently as 2 years ago.  I \nwant to produce a Go playing program that can at least play at the 1 \nDan - Amateur level (6 levels above me).  No one has come even the \nslightest bit close to that goal (all claims to the contrary), even \nin &quot;ideal&quot; circumstances.  And there has been over two decades worth \nof effort.\n\nAt present, I am reproducing all of the work from the book Blondie24 \nby Fogel (I am the person who recommended Derek read it as he \nmentioned in his introduction).  It is my goal to isolate and \nidentify what the influence was for each of the architectual \ndecisions made by Fogel in an attempt to get an &quot;intuitive&quot; \nunderstanding of what kinds of things influenced the &quot;learning \ncurve&quot;, so to speak, he describes in his text.\n\nIn attempting to duplicate Fogel&#39;s work, I have implemented a number \nof infrastructure components in Java (currently 1.3.1).  The first \nwas all the code necessary for FeedForward/Backprop ANNs of n \nlayers.  I have also written a generic/abstract two \nplayer/board/game implementation stucture with a checkers \nimplementation.  I then implemented a full dynamic ply management \nsystem.  I am currently debugging that.  I also implemented my \nown &quot;distributed computing&quot; system via RMI.  It is not as robust as \nI would like.  Derek has been checking into alternatives, but none \nseem to be &quot;better&quot; yet.\n\nI have written everything in Java and intend on Open Sourcing the \nlot of it, but not until I have at least gone through it once to \nmake the code &quot;presentable&quot; (no JavaDocs at this point...only Sun \nsyntactically consistent coding conventions).  I personally want to \nspend very little additional time on &quot;infrastructure&quot; development \nand get to experimental development and data generation for \nstatistical analysis.\n\nWhile I think NEAT is going to be a great component to use in \nsolving my particular focus on the Go problem, I expect that it will \nbe quite some time before I will find it to be genuinely useful on \nthe Go problem.  The way I see it, the computational power needed to \nevolve weights into desirable positions is barely within my \nbudgetary range at the moment (10-20 PII400s).  The idea of evolving \nweights and topologies is going to require several orders of \nmagnitude more processing power (and probably quite a bit more) to \nachieve the goal without some sort of breakthrough in design \napproach (unless there are huge quantities of computational power \nand decades worth of time, neither of which I consider options at \npresent).\n\nSo, I will mostly be listening to the conversation and asking \nprobing and/or leading questions for the most part while I continue \nto focus on completing my &quot;analysis&quot; of the Fogel experiments.\n\n\nAnd Derek, thank you for starting this forum.  I appreciate your \ntaking that on and managing it.  I love the YahooGroups &quot;event&quot; \nstyle of sending me an E-mail.  It is much easier to keep up than it \nis to have to &quot;poll&quot; some site every now and again.  I tend to \nforget to poll, get too far behind and eventually stop using the \nsite.\n\n\n\n"}}