{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[{"name":"READ"}]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"userId":130984297,"authorName":"joel278","from":"&quot;joel278&quot; &lt;lehman.154@...&gt;","profile":"joel278","replyTo":"LIST","senderId":"I_DFAJLdktZ3RQQC9zkdpxXWt6AxiCYDZTdz6XM9B5OF3ViplPRI5Xr4zNBYACnO42mNHeGhy2aI0HLp7JxYluwveZid","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: New Journal Article Explores New Hypothesis for Increasing Evolvability","postDate":"1366948550","msgId":6074,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGtsY3RzNit0NmhwQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGtsY2FmNytvcDdsQGVHcm91cHMuY29tPg=="},"prevInTopic":6072,"nextInTopic":6075,"prevInTime":6073,"nextInTime":6075,"topicId":6070,"numMessagesInTopic":8,"msgSnippet":"Hi Martin, Thanks for the kind words about the paper and for incorporating it into a lecture already! I am happy to try and answer your question, which relates","rawEmail":"Return-Path: &lt;lehman.154@...&gt;\r\nX-Sender: lehman.154@...\r\nX-Apparently-To: neat@yahoogroups.com\r\nX-Received: (qmail 63696 invoked from network); 26 Apr 2013 03:55:52 -0000\r\nX-Received: from unknown (10.193.84.131)\n  by m2.grp.bf1.yahoo.com with QMQP; 26 Apr 2013 03:55:52 -0000\r\nX-Received: from unknown (HELO ng16-ip2.bullet.mail.bf1.yahoo.com) (98.139.165.138)\n  by mta4.grp.bf1.yahoo.com with SMTP; 26 Apr 2013 03:55:52 -0000\r\nX-Received: from [98.139.164.126] by ng16.bullet.mail.bf1.yahoo.com with NNFMP; 26 Apr 2013 03:55:52 -0000\r\nX-Received: from [10.193.94.46] by tg7.bullet.mail.bf1.yahoo.com with NNFMP; 26 Apr 2013 03:55:52 -0000\r\nDate: Fri, 26 Apr 2013 03:55:50 -0000\r\nTo: neat@yahoogroups.com\r\nMessage-ID: &lt;klcts6+t6hp@...&gt;\r\nIn-Reply-To: &lt;klcaf7+op7l@...&gt;\r\nUser-Agent: eGroups-EW/0.82\r\nMIME-Version: 1.0\r\nContent-Type: text/plain; charset=&quot;ISO-8859-1&quot;\r\nContent-Transfer-Encoding: quoted-printable\r\nX-Mailer: Yahoo Groups Message Poster\r\nX-Yahoo-Newman-Property: groups-compose\r\nX-eGroups-Msg-Info: 1:12:0:0:0\r\nFrom: &quot;joel278&quot; &lt;lehman.154@...&gt;\r\nSubject: Re: New Journal Article Explores New Hypothesis for Increasing Evolvability\r\nX-Yahoo-Group-Post: member; u=130984297; y=jvJpYGepXdAxOami4Z22BjBzXEHd1ZjM0J7asPyRFPy2pGIgtFS8\r\nX-Yahoo-Profile: joel278\r\n\r\n\n\n\n\n\nHi Martin,\n\nThanks for the kind words about the paper and for incorpor=\r\nating it into a lecture already!\n\nI am happy to try and answer your questio=\r\nn, which relates to potential bounds on increasing evolvability and/or dive=\r\nrsity. If I understand correctly, the underlying idea is that there may be =\r\na tension between evolvability and robustness; evolvability implies greater=\r\n phenotypic variability among offspring, while mutational robustness implie=\r\ns stability even after genetic perturbation. In particular, evolvability mi=\r\nght be limited because too much of it would interfere with the ability to c=\r\nonserve important features through canalization.\n\nThe way I think about it =\r\ncurrently is that perhaps there is no ultimate tension, and that evolvabili=\r\nty can generally increase without limit. The reason is that canalization of=\r\n low-level mechanisms can act to increase evolvability. For example, many o=\r\nf the mechanisms behind development are heavily conserved, but can generate=\r\n much phenotypic variability through being combined and modulated in variou=\r\ns ways. In other words, modulating conserved features of development gives =\r\nevolution higher-level levers that enable small genetic changes to be ampli=\r\nfied and have a large meaningful phenotypic effect. Thus through continued =\r\nevolution of the genotype/phenotype map, perhaps evolvability can continual=\r\nly increase (through exploiting canalization of lower-level mechanisms to g=\r\nenerate increasingly high-level features). For example, heterochrony in bio=\r\nlogical development facilitates large-scale changes in size of different ev=\r\nolutionary components through relatively small genetic changes (i.e. throug=\r\nh mainly change the relative timing of events and not the mechanisms implem=\r\nenting such events).\n\nOf course, in the particular simulations that are app=\r\nlied in the paper, there may be an ultimate limit to evolvability because w=\r\ne are using a direct encoding and a simple measure of phenotypic distance. =\r\nIn particular, in NEAT the genotype/phenotype mapping is not subject to evo=\r\nlution, and the above argument may not directly apply. \n\nHowever, I still i=\r\nmagine that the most evolvable ANNs in the models might be structured such =\r\nthat low-level behaviors (like avoiding walls) are somewhat canalized, whil=\r\ne certain critical connections, when mutated, cause higher-level changes in=\r\n behavior (i.e. perhaps cause a change from left-handed wall-following to r=\r\night-handed wall-following). Thus mutations in general may cause much great=\r\ner variance in overall behavior. The particular features of the evolved ANN=\r\n architectures that result in greater evolvability in our simulations deser=\r\nves more investigation.\n\nI hope this answer coherently addresses your inqui=\r\nry, I am still thinking through the implications of what you&#39;ve brought up.=\r\n\n\nBest,\nJoel\n\n--- In neat@yahoogroups.com, &quot;martin_pyka&quot; &lt;martin.pyka@...&gt; =\r\nwrote:\n&gt;\n&gt; Hi Joel,\n&gt; \n&gt; Congratulations to this paper. I read it already, =\r\nwhen you put it on arxiv, but great to see that it is now published as a re=\r\nviewed paper. I think you very nicely demonstrated in the abstract and more=\r\n concrete model how evolvability can evolve without following any adaptive =\r\npressure. I really like how Ken and you investigate these fundamental princ=\r\niples in easy to understand simulations. And I am a bit proud to say that t=\r\nhe insights of this paper are already included in my Artificial Development=\r\n lecture. :-) \n&gt; \n&gt; Since you opened a thread for this paper I would like t=\r\no use this opportunity to ask a question that came to my mind, when I read =\r\nit the first time:\n&gt; \n&gt; From your simulations, one could falsely conclude t=\r\nhat evolvability can and will increase infinitely (which is not a criticism=\r\n on your paper, because this was not the focus of your study). However, too=\r\n much evolvability would decrease the robustness in a genotype-phenotype ma=\r\npping (e.g. the ability to canalize), which possibly means that evolvabilit=\r\ny only increases to a certain extent. Following this perspective, I was won=\r\ndering whether in actual fact *diversity* is inevitable while evolvability =\r\nin species will show a ceiling effect?\n&gt; \n&gt; Best,\n&gt; Martin\n&gt; \n&gt; \n&gt; --- In n=\r\neat@yahoogroups.com, &quot;joel278&quot; &lt;lehman.154@&gt; wrote:\n&gt; &gt;\n&gt; &gt; Ken Stanley and=\r\n I are pleased to annouce our new article, &quot;Evolvability is Inevitable: Inc=\r\nreasing Evolvability without the Pressure to Adapt,&quot; which was published to=\r\nday in PLoS ONE. The paper can be viewed at: \n&gt; &gt; \n&gt; &gt; http://dx.plos.org/1=\r\n0.1371/journal.pone.0062186\n&gt; &gt; \n&gt; &gt; The article applies both abstract simu=\r\nlations and neuroevolution to explore a non-adaptive explanation for increa=\r\nsing evolvability in nature. Interestingy, understanding evolvability (the =\r\ncapacity to further evolve) might lead not only to better understanding how=\r\n complex organisms evolve in nature, but may also provide insight into how =\r\nto design evolutionary algorithms that are better able to evolve complex ar=\r\ntifacts.\n&gt; &gt; \n&gt; &gt; Most existing theories for evolvability increase depend u=\r\npon particular selective scenarios, such as a species surviving through con=\r\nstantly changing environments. However, the insight in the article is that =\r\nevolvability can instead arise spontaneously without natural selection acti=\r\nng at all. The main idea is that if evolvability is heritable, then evolvab=\r\nle organisms separate themselves naturally from less evolvable organisms ov=\r\ner time simply by their children becoming increasingly diverse and thereby =\r\nspreading further through the space of possible phenotypes. That is, the sp=\r\nace of phenotypes itself can act like a filter that distinguishes evolvabil=\r\nity.\n&gt; &gt; \n&gt; &gt; In this way, when novel phenotypes appear in the future, they=\r\n are most likely descendents of those that were evolvable in the past. The =\r\nresult is that evolvable species accumulate over time even without selectiv=\r\ne pressure. This idea is supported by a variety of simulations where evolva=\r\nbility increases without any pressure for organisms to out-compete each oth=\r\ner.\n&gt; &gt; \n&gt; &gt; Those familiar with novelty search will notice some conceptual=\r\n parallels with Ken&#39;s and my previous work on searching without objectives.=\r\n Like novelty search, the proposed non-adaptive hypothesis for evolvability=\r\n may invite some controversy because adaptive explanations for evolvability=\r\n are intuitive and widely-held. For example, researchers often worry about =\r\nwhat kind of selective pressure will lead to evolvability, even in discussi=\r\nons in this group. One implication of this work could be that such worrying=\r\n is unwarranted because the best way to get evolvability may sometimes be t=\r\no stop trying to select for it. In any case, despite any potential controve=\r\nrsy, we hope that this alternate perspective leads to constructive discussi=\r\non and demonstrates the need to question the assumption that evolvability r=\r\nequires particular selective scenarios for it to increase.\n&gt; &gt; \n&gt; &gt; Joel\n&gt; =\r\n&gt;\n&gt;\n\n\n"}}