{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[{"name":"READ"}]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"userId":464818732,"authorName":"Jeff Clune","from":"Jeff Clune &lt;jclune@...&gt;","profile":"jeffreyclune","replyTo":"LIST","senderId":"y3d4yxs0Y7ODmQbOuVWJ36PX6rKuEM5_RUUroZCd5GUoA2KllAIMJmSyD2oAEyDP5ed4znaqCB89seA5ArcbMlxKgDo","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [neat] New Journal Article Explores New Hypothesis for Increasing Evolvability","postDate":"1367599324","msgId":6084,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDJDOTdGOTNCLTUwMzEtNDRGNy04NTZBLThFRTM4QjQwRkE5NUBnbWFpbC5jb20+","inReplyToHeader":"PGtsZjg2aytycXU2QGVHcm91cHMuY29tPg==","referencesHeader":"PGtsZjg2aytycXU2QGVHcm91cHMuY29tPg=="},"prevInTopic":6079,"nextInTopic":6091,"prevInTime":6083,"nextInTime":6085,"topicId":6070,"numMessagesInTopic":8,"msgSnippet":"Hello Joel and Ken, Congrats on the excellent paper. I enjoyed it. Congrats also on the nice press coverage. My weekly KurzweilAI.net email this week has your","rawEmail":"Return-Path: &lt;jclune@...&gt;\r\nX-Sender: jclune@...\r\nX-Apparently-To: neat@yahoogroups.com\r\nX-Received: (qmail 82784 invoked by uid 102); 3 May 2013 19:04:54 -0000\r\nX-Received: from unknown (HELO mta2.grp.bf1.yahoo.com) (10.193.84.150)\n  by m5.grp.bf1.yahoo.com with SMTP; 3 May 2013 19:04:54 -0000\r\nX-Received: (qmail 26347 invoked from network); 3 May 2013 19:04:54 -0000\r\nX-Received: from unknown (HELO mail-ie0-f178.google.com) (209.85.223.178)\n  by mta2.grp.bf1.yahoo.com with SMTP; 3 May 2013 19:04:54 -0000\r\nX-Received: by mail-ie0-f178.google.com with SMTP id b11so2240859iee.9\n        for &lt;neat@yahoogroups.com&gt;; Fri, 03 May 2013 12:04:54 -0700 (PDT)\r\nX-Received: by 10.50.50.40 with SMTP id z8mr5720532ign.59.1367607894531;\n        Fri, 03 May 2013 12:04:54 -0700 (PDT)\r\nReturn-Path: &lt;jclune@...&gt;\r\nX-Received: from temp59.cs.uwyo.edu (uwyo-129-72-165-146.uwyo.edu. [129.72.165.146])\n        by mx.google.com with ESMTPSA id wx2sm11463778igb.4.2013.05.03.12.04.52\n        for &lt;neat@yahoogroups.com&gt;\n        (version=TLSv1 cipher=ECDHE-RSA-RC4-SHA bits=128/128);\n        Fri, 03 May 2013 12:04:53 -0700 (PDT)\r\nContent-Type: multipart/alternative; boundary=&quot;Apple-Mail=_84B27BA5-6EE8-4454-A821-7DF45EE2CD1D&quot;\r\nMessage-Id: &lt;2C97F93B-5031-44F7-856A-8EE38B40FA95@...&gt;\r\nMime-Version: 1.0 (Mac OS X Mail 6.3 &#92;(1503&#92;))\r\nDate: Fri, 3 May 2013 10:42:04 -0600\r\nReferences: &lt;klf86k+rqu6@...&gt;\r\nTo: neat@yahoogroups.com\r\nIn-Reply-To: &lt;klf86k+rqu6@...&gt;\r\nX-Mailer: Apple Mail (2.1503)\r\nX-eGroups-Msg-Info: 1:12:0:0:0\r\nFrom: Jeff Clune &lt;jclune@...&gt;\r\nSubject: Re: [neat] New Journal Article Explores New Hypothesis for Increasing Evolvability\r\nX-Yahoo-Group-Post: member; u=464818732; y=BCaU6QJnjfrIxrsY8RrRyHFdXUzfJqRf2LyIeQFBjPijlkwOj4sL\r\nX-Yahoo-Profile: jeffreyclune\r\n\r\n\r\n--Apple-Mail=_84B27BA5-6EE8-4454-A821-7DF45EE2CD1D\r\nContent-Transfer-Encoding: quoted-printable\r\nContent-Type: text/plain;\n\tcharset=windows-1252\r\n\r\nHello Joel and Ken,\n\nCongrats on the excellent paper. I enjoyed it. \n\nCongr=\r\nats also on the nice press coverage. My weekly KurzweilAI.net email this we=\r\nek has your article featured!\n\nhttp://www.kurzweilai.net/a-new-spin-on-orig=\r\nins-of-evolvability-survival-of-the-evolvable?utm_source=3DKurzweilAI+Weekl=\r\ny+Newsletter&utm_campaign=3Df2d8f1bc7d-UA-946742-1&utm_medium=3Demail&utm_t=\r\nerm=3D0_147a5a48c1-f2d8f1bc7d-282027325\n\n(nice office Ken)\n\nI have a three =\r\nquestions, two higher-level and one pedantic.\n\n1) You write: &quot;Thus if the a=\r\nssumption of evolvability=92s heritability holds, then such founder effects=\r\n in establishing new niches may yield a persistent bias towards increasing =\r\nevolvability =96 even in the absence of adaptive competition between organi=\r\nsms.&quot;\n\nMy guess is that this assumption doesn&#39;t hold across many generation=\r\ns in the scenario you outline. Your model, especially the limited capacity =\r\nmodel, awards permanent winner status to the founder (if I understand it co=\r\nrrectly), but obviously that does not happen in nature. In nature, once a n=\r\niche is founded, there is no pressure (for those orgs staying in the niche)=\r\n to retain their evolvability (assuming a relatively static environment). A=\r\ns my mutation rates paper shows (http://goo.gl/I8r40), once a population is=\r\n on a local fitness peak there is a strong pressure to lower the mutation r=\r\nate (which in your model is the same thing as evolvability). Offspring of t=\r\nhe founder with lower mutRates/evolvability would have higher average fitne=\r\nss than offsprings with the original, elevated mutRate/evolvability, thus l=\r\neading to a lowering of mutation rates/evolvability across generations. If =\r\nthat is right, it would erase this founder effect and eliminate the appeara=\r\nnce of evolvability even when averaging across niches, no? In other words, =\r\nyou&#39;d only see this elevation in newly occupied niches, which would be a sm=\r\nall fraction of the total number of niches after millennia. In short, while=\r\n I agree with this clever demonstration that evolvability can increase with=\r\nout selection, it could be the case that selection itself eliminates this s=\r\nort of evolvability effect, leaving us still searching for how nature gener=\r\nates and maintains evolvability. You could test this by trying your same ex=\r\nperiments in the abstract model, but on a rugged fitness landscape (e.g. Ra=\r\nstrigin), and I&#39;m confident you&#39;d see the mutation rate/evolvability go to =\r\nnear zero (that&#39;s effectively the exact experiment I did in my PLoS Comp Bi=\r\no paper). That result would jive with your belief that selection may actual=\r\nly preclude evolvability and be a hinderance to open-ended evolution, but i=\r\nt may also mean that the effect you point out is not a major explanation of=\r\n evolvability in the natural world where selection is a powerful force. I h=\r\nope I don&#39;t come across as someone trying to diminish the importance of you=\r\nr work; instead I am trying to understand how far I can extrapolate it to t=\r\nhe natural world. \n\n2) You repeatedly mention that you are using one of man=\r\ny definitions of evolvability, defining it as synonymous with phenotypic va=\r\nriability. I got the impression that you were arguing for one definition of=\r\n evolvability from a set of common ones, perhaps even a less common one. I =\r\nusually think of evolvability as certain kinds of phenotypic variability (e=\r\n.g. evolution produces the subset of variants that have a higher average fi=\r\ntness than the entire set of possible variants). What would the implication=\r\ns for your paper be if you adopted that (I believe more common) definition =\r\nof evolvability? Are there other major definitions of evolvability that you=\r\n encountered in your literature search? If so, does adopting them change th=\r\ne interpretation of your paper?\n\n3) Here&#39;s the pedantic question. In your a=\r\nbstract model (not the limited capacity model, the unlimited one), I assume=\r\n that mutations can move an org one step in any direction, including back t=\r\noward the center. Given that, shouldn&#39;t a higher mutation rate just mean a =\r\nlarger variance around the origin? Random walks, after all, still have an a=\r\nverage location of their starting point. If so, I agree that the  far-flung=\r\n niches would disproportionately have high evolvability, but I would also e=\r\nxpect to see greater variance in evolvability in the central niches than th=\r\ne distant niches...but that&#39;s the opposite of Fig. 3. If each organism is o=\r\nn a random walk, and higher evolvability means a faster pace, then you woul=\r\nd have lots of these faster organisms traversing back and forth across the =\r\ncenter too, but you don&#39;t see any of those orgs in Fig. 3. I am sure I am m=\r\nisunderstanding something, and it is probably trivial, but I just wanted to=\r\n ask in case my misunderstanding is making me not fully appreciate your wor=\r\nk. \n\nCongratulations again. I&#39;m still thinking about all of the implication=\r\ns of the paper. \n\nBest regards,\nJeff Clune\n\nAssistant Professor\nComputer Sc=\r\nience\nUniversity of Wyoming\njeffclune@...\njeffclune.com\n\nOn Apr 26, 20=\r\n13, at 7:04 PM, joel278 &lt;lehman.154@...&gt; wrote:\n\n&gt; \n&gt; \n&gt; Hi Martin,\n&gt; \n=\r\n&gt; Your illustration (http://www.martinpyka.de/wp-content/uploads/2013/04/ev=\r\nolvability.png) is very helpful in teasing apart how undirected genetic mut=\r\nations (interpreting the isocloud on the left as the genetic space) can yet=\r\n produce structured phenotypic changes (interpreting the image on the right=\r\n as the corresponding changes in the phenotype) through an evolvable genoty=\r\npe-phenotype map. \n&gt; \n&gt; Thanks for taking the effort to create the image, w=\r\nhich also clarifies how canalization can work to potentially enhance evolva=\r\nbility. I am learning much from this discussion too.\n&gt; \n&gt; Joel\n&gt; \n&gt; --- In =\r\nneat@yahoogroups.com, &quot;martin_pyka&quot; &lt;martin.pyka@...&gt; wrote:\n&gt; &gt;\n&gt; &gt; Hi Joe=\r\nl,\n&gt; &gt; \n&gt; &gt; thanks for your fast response which addressed exactly my inquir=\r\ny. \n&gt; &gt; \n&gt; &gt; First, I want to clarify that even if evolvability can reach a=\r\n maximum the conclusion of your paper is correct that it can emerge without=\r\n any pressure for adaptation in the individuals. In this regard, my questio=\r\nn whether a maximum of evolvability exists was more of general nature.\n&gt; &gt; =\r\n\n&gt; &gt; &gt; The way I think about it currently is that perhaps there is no ultim=\r\nate tension, and that evolvability can generally increase without limit. Th=\r\ne reason is that canalization of low-level mechanisms can act to increase e=\r\nvolvability. For example, many of the mechanisms behind development are hea=\r\nvily conserved, but can generate much phenotypic variability through being =\r\ncombined and modulated in various ways. In other words, modulating conserve=\r\nd features of development gives evolution higher-level levers that enable s=\r\nmall genetic changes to be amplified and have a large meaningful phenotypic=\r\n effect. Thus through continued evolution of the genotype/phenotype map, pe=\r\nrhaps evolvability can continually increase (through exploiting canalizatio=\r\nn of lower-level mechanisms to generate increasingly high-level features).\n=\r\n&gt; &gt; \n&gt; &gt; Yep, when I read this I noted that this is actually also my opinio=\r\nn about generative encodings. From this perspective, I would also assume th=\r\nat evolvability can continuously increase in the sense that the genome can =\r\nbecome more powerful (or more flexible) in generating new meaningful phenot=\r\nypes. Maybe my implicit assumption was not correct that evolvability in a p=\r\nhenotype map could be depicted as iso-oriented point-cloud:\n&gt; &gt; \n&gt; &gt; left i=\r\nmage in http://www.martinpyka.de/wp-content/uploads/2013/04/evolvability.pn=\r\ng\n&gt; &gt; \n&gt; &gt; According to this illustration, increased evolvability would inc=\r\nrease the size of the point cloud. I think I had this picture in mind when =\r\nI argued in my previous post that evolvability cannot increase infinitely b=\r\necause genotype-phenotype mappings should become instable when a certain de=\r\ngree of evolvability has been reached. However, maybe a 2d-depiction of the=\r\n evolvable phenotype-space would rather look like in the right image (I am =\r\nsorry for my poor artwork). Through canalization, not all phenotypes in the=\r\n 2d-space are evolvable but evolvability itself can still increase!?\n&gt; &gt; \n&gt;=\r\n &gt; Maybe, both pictures can also illustrate what canalization means. The le=\r\nft picture could depict all possible points in the genotype space that can =\r\nbe reached through mutation and recombination and the right image all possi=\r\nble points in the phenotype space that can be generated from it. While each=\r\n bit in the (2d)-genotype has equal probability of been mutated, in canaliz=\r\ned encodings only a well-ordered subspace of phenotypes can be reached.\n&gt; &gt;=\r\n \n&gt; &gt; Thank you for this inspiring discussion. :-) I enjoy thinking about h=\r\now all this fits together.\n&gt; &gt; \n&gt; &gt; Best,\n&gt; &gt; Martin\n&gt; &gt;\n&gt; \n&gt; \n\n\r\n--Apple-Mail=_84B27BA5-6EE8-4454-A821-7DF45EE2CD1D\r\nContent-Transfer-Encoding: quoted-printable\r\nContent-Type: text/html;\n\tcharset=windows-1252\r\n\r\n&lt;html&gt;&lt;head&gt;&lt;meta http-equiv=3D&quot;Content-Type&quot; content=3D&quot;text/html charset=\r\n=3Dwindows-1252&quot;&gt;&lt;/head&gt;&lt;body style=3D&quot;word-wrap: break-word; -webkit-nbsp-=\r\nmode: space; -webkit-line-break: after-white-space; ; font-family: &#39;Times&#39;;=\r\n font-size: 14px; color: rgb( 0,  0,  0); &quot;&gt;&lt;span style=3D&quot;font-family: &#39;Ti=\r\nmes&#39;; font-size: 14px; color: rgb( 0,  0,  0)&quot;&gt;Hello Joel and Ken,&lt;div&gt;&lt;br&gt;=\r\n&lt;/div&gt;&lt;div&gt;Congrats on the excellent paper. I enjoyed it.&nbsp;&lt;/div&gt;&lt;div&gt;&lt;=\r\nbr&gt;&lt;/div&gt;&lt;div&gt;Congrats also on the nice press coverage. My weekly &lt;a href=\r\n=3D&quot;http://KurzweilAI.net&quot;&gt;KurzweilAI.net&lt;/a&gt; email this week has your arti=\r\ncle featured!&lt;/div&gt;&lt;div&gt;&lt;br&gt;&lt;/div&gt;&lt;div&gt;&lt;a href=3D&quot;http://www.kurzweilai.net=\r\n/a-new-spin-on-origins-of-evolvability-survival-of-the-evolvable?utm_source=\r\n=3DKurzweilAI+Weekly+Newsletter&amp;utm_campaign=3Df2d8f1bc7d-UA-946742-1&a=\r\nmp;utm_medium=3Demail&amp;utm_term=3D0_147a5a48c1-f2d8f1bc7d-282027325&quot;&gt;htt=\r\np://www.kurzweilai.net/a-new-spin-on-origins-of-evolvability-survival-of-th=\r\ne-evolvable?utm_source=3DKurzweilAI+Weekly+Newsletter&amp;utm_campaign=3Df2=\r\nd8f1bc7d-UA-946742-1&amp;utm_medium=3Demail&amp;utm_term=3D0_147a5a48c1-f2d=\r\n8f1bc7d-282027325&lt;/a&gt;&lt;/div&gt;&lt;div&gt;&lt;br&gt;&lt;/div&gt;&lt;div&gt;(nice office Ken)&lt;/div&gt;&lt;div&gt;=\r\n&lt;br&gt;&lt;/div&gt;&lt;div&gt;I have a three questions, two higher-level and one pedantic.=\r\n&lt;/div&gt;&lt;div&gt;&lt;br&gt;&lt;/div&gt;&lt;div&gt;1) You write: &quot;Thus if the assumption of evolvabi=\r\nlity=92s heritability holds, then such founder effects in establishing new =\r\nniches may yield a persistent bias towards increasing evolvability =96 even=\r\n in the absence of&nbsp;adaptive competition between organisms.&quot;&lt;/div&gt;&lt;div&gt;=\r\n&lt;br&gt;&lt;/div&gt;&lt;div&gt;My guess is that this assumption doesn&#39;t hold across many ge=\r\nnerations in the scenario you outline. Your model, especially the limited c=\r\napacity model, awards permanent winner status to the founder (if I understa=\r\nnd it correctly), but obviously that does not happen in nature. In nature, =\r\nonce a niche is founded, there is no pressure (for those orgs staying in th=\r\ne niche) to retain their evolvability (assuming a relatively static environ=\r\nment). As my mutation rates paper shows (&lt;a href=3D&quot;http://goo.gl/I8r40&quot;&gt;ht=\r\ntp://goo.gl/I8r40&lt;/a&gt;), once a population is on a local fitness peak there =\r\nis a strong pressure to lower the mutation rate (which in your model is the=\r\n same thing as evolvability). Offspring of the founder with lower mutRates/=\r\nevolvability would have higher average fitness than offsprings with the ori=\r\nginal, elevated mutRate/evolvability, thus leading to a lowering of mutatio=\r\nn rates/evolvability across generations. If that is right, it would erase t=\r\nhis founder effect and eliminate the appearance of evolvability even when a=\r\nveraging across niches, no? In other words, you&#39;d only see this elevation i=\r\nn newly occupied niches, which would be a small fraction of the total numbe=\r\nr of niches after millennia. In short, while I agree with this clever demon=\r\nstration that evolvability can increase without selection, it could be the =\r\ncase that selection itself eliminates this sort of evolvability effect, lea=\r\nving us still searching for how nature generates and maintains evolvability=\r\n. You could test this by trying your same experiments in the abstract model=\r\n, but on a rugged fitness landscape (e.g. Rastrigin), and I&#39;m confident you=\r\n&#39;d see the mutation rate/evolvability go to near zero (that&#39;s effectively t=\r\nhe exact experiment I did in my PLoS Comp Bio paper). That result would jiv=\r\ne with your belief that selection may actually preclude evolvability and be=\r\n a hinderance to open-ended evolution, but it may also mean that the effect=\r\n you point out is not a major explanation of evolvability in the natural wo=\r\nrld where selection is a powerful force. I hope I don&#39;t come across as some=\r\none trying to diminish the importance of your work; instead I am trying to =\r\nunderstand how far I can extrapolate it to the natural world.&nbsp;&lt;/div&gt;&lt;d=\r\niv&gt;&lt;br&gt;&lt;/div&gt;&lt;div&gt;2) You repeatedly mention that you are using one of many =\r\ndefinitions of evolvability, defining it as synonymous with phenotypic vari=\r\nability. I got the impression that you were arguing for one definition of e=\r\nvolvability from a set of common ones, perhaps even a less common one. I us=\r\nually think of evolvability as certain kinds of phenotypic variability (e.g=\r\n. evolution produces the subset of variants that have a higher average fitn=\r\ness than the entire set of possible variants). What would the implications =\r\nfor your paper be if you adopted that (I believe more common) definition of=\r\n evolvability? Are there other major definitions of evolvability that you e=\r\nncountered in your literature search? If so, does adopting them change the =\r\ninterpretation of your paper?&lt;/div&gt;&lt;div&gt;&lt;br&gt;&lt;/div&gt;&lt;div&gt;3) Here&#39;s the pedant=\r\nic question. In your abstract model (not the limited capacity model, the un=\r\nlimited one), I assume that mutations can move an org one step in any direc=\r\ntion, including back toward the center. Given that, shouldn&#39;t a higher muta=\r\ntion rate just mean a larger variance around the origin? Random walks, afte=\r\nr all, still have an average location of their starting point. If so,&nbsp;=\r\nI agree that the&nbsp;&nbsp;far-flung niches would disproportionately have =\r\nhigh evolvability, but I would also expect to see greater variance in evolv=\r\nability in the central niches than the distant niches...but that&#39;s the&nbsp=\r\n;opposite of Fig. 3. If each organism is on a random walk, and higher evolv=\r\nability means a faster pace, then you would have lots of these faster organ=\r\nisms traversing back and forth across the center too, but you don&#39;t see any=\r\n of those orgs in Fig. 3. I am sure I am misunderstanding something, and it=\r\n is probably trivial, but I just wanted to ask in case my misunderstanding =\r\nis making me not fully appreciate your work.&nbsp;&lt;/div&gt;&lt;div&gt;&lt;br&gt;&lt;/div&gt;&lt;div=\r\n&gt;Congratulations again. I&#39;m still thinking about all of the implications of=\r\n the paper.&nbsp;&lt;/div&gt;&lt;div&gt;&lt;div apple-content-edited=3D&quot;true&quot;&gt;&lt;span style=\r\n=3D&quot;font-family: &#39;Times&#39;; font-size: 14px; color: rgb( 0,  0,  0)&quot;&gt;&lt;div sty=\r\nle=3D&quot;color: rgb(0, 0, 0); font-family: Times; font-style: normal; font-var=\r\niant: normal; font-weight: normal; letter-spacing: normal; line-height: nor=\r\nmal; orphans: 2; text-align: -webkit-auto; text-indent: 0px; text-transform=\r\n: none; white-space: normal; widows: 2; word-spacing: 0px; -webkit-text-siz=\r\ne-adjust: auto; -webkit-text-stroke-width: 0px; word-wrap: break-word; -web=\r\nkit-nbsp-mode: space; -webkit-line-break: after-white-space; &quot;&gt;&lt;div style=\r\n=3D&quot;color: rgb(0, 0, 0); font-family: Times; font-style: normal; font-varia=\r\nnt: normal; font-weight: normal; letter-spacing: normal; line-height: norma=\r\nl; orphans: 2; text-align: -webkit-auto; text-indent: 0px; text-transform: =\r\nnone; white-space: normal; widows: 2; word-spacing: 0px; -webkit-text-size-=\r\nadjust: auto; -webkit-text-stroke-width: 0px; word-wrap: break-word; -webki=\r\nt-nbsp-mode: space; -webkit-line-break: after-white-space; &quot;&gt;&lt;span style=3D=\r\n&quot;font-family: Times; color: rgb(0, 0, 0); &quot;&gt;&lt;div style=3D&quot;color: rgb(0, 0, =\r\n0); font-family: Times; font-style: normal; font-variant: normal; font-weig=\r\nht: normal; letter-spacing: normal; line-height: normal; orphans: 2; text-a=\r\nlign: -webkit-auto; text-indent: 0px; text-transform: none; white-space: no=\r\nrmal; widows: 2; word-spacing: 0px; -webkit-text-size-adjust: auto; -webkit=\r\n-text-stroke-width: 0px; word-wrap: break-word; -webkit-nbsp-mode: space; -=\r\nwebkit-line-break: after-white-space; &quot;&gt;&lt;span style=3D&quot;font-family: Times; =\r\ncolor: rgb(0, 0, 0); &quot;&gt;&lt;div style=3D&quot;color: rgb(0, 0, 0); font-family: Time=\r\ns; font-style: normal; font-variant: normal; font-weight: normal; letter-sp=\r\nacing: normal; line-height: normal; orphans: 2; text-align: -webkit-auto; t=\r\next-indent: 0px; text-transform: none; white-space: normal; widows: 2; word=\r\n-spacing: 0px; -webkit-text-size-adjust: auto; -webkit-text-stroke-width: 0=\r\npx; word-wrap: break-word; -webkit-nbsp-mode: space; -webkit-line-break: af=\r\nter-white-space; &quot;&gt;&lt;span style=3D&quot;font-family: Times; color: rgb(0, 0, 0); =\r\n&quot;&gt;&lt;div style=3D&quot;color: rgb(0, 0, 0); font-family: Times; font-style: normal=\r\n; font-variant: normal; font-weight: normal; letter-spacing: normal; line-h=\r\neight: normal; orphans: 2; text-align: -webkit-auto; text-indent: 0px; text=\r\n-transform: none; white-space: normal; widows: 2; word-spacing: 0px; -webki=\r\nt-text-size-adjust: auto; -webkit-text-stroke-width: 0px; word-wrap: break-=\r\nword; -webkit-nbsp-mode: space; -webkit-line-break: after-white-space; &quot;&gt;&lt;s=\r\npan style=3D&quot;font-family: Times; color: rgb(0, 0, 0); &quot;&gt;&lt;div style=3D&quot;color=\r\n: rgb(0, 0, 0); font-family: Times; font-style: normal; font-variant: norma=\r\nl; font-weight: normal; letter-spacing: normal; line-height: normal; orphan=\r\ns: 2; text-align: -webkit-auto; text-indent: 0px; text-transform: none; whi=\r\nte-space: normal; widows: 2; word-spacing: 0px; -webkit-text-size-adjust: a=\r\nuto; -webkit-text-stroke-width: 0px; word-wrap: break-word; -webkit-nbsp-mo=\r\nde: space; -webkit-line-break: after-white-space; &quot;&gt;&lt;span style=3D&quot;font-fam=\r\nily: Times; color: rgb(0, 0, 0); &quot;&gt;&lt;div style=3D&quot;color: rgb(0, 0, 0); font-=\r\nfamily: Times; font-style: normal; font-variant: normal; font-weight: norma=\r\nl; letter-spacing: normal; line-height: normal; orphans: 2; text-align: -we=\r\nbkit-auto; text-indent: 0px; text-transform: none; white-space: normal; wid=\r\nows: 2; word-spacing: 0px; -webkit-text-size-adjust: auto; -webkit-text-str=\r\noke-width: 0px; word-wrap: break-word; -webkit-nbsp-mode: space; -webkit-li=\r\nne-break: after-white-space; &quot;&gt;&lt;div style=3D&quot;color: rgb(0, 0, 0); font-fami=\r\nly: Times; font-style: normal; font-variant: normal; font-weight: normal; l=\r\netter-spacing: normal; line-height: normal; orphans: 2; text-align: -webkit=\r\n-auto; text-indent: 0px; text-transform: none; white-space: normal; widows:=\r\n 2; word-spacing: 0px; -webkit-text-size-adjust: auto; -webkit-text-stroke-=\r\nwidth: 0px; word-wrap: break-word; -webkit-nbsp-mode: space; -webkit-line-b=\r\nreak: after-white-space; &quot;&gt;&lt;div style=3D&quot;color: rgb(0, 0, 0); font-family: =\r\nTimes; font-style: normal; font-variant: normal; font-weight: normal; lette=\r\nr-spacing: normal; line-height: normal; orphans: 2; text-align: -webkit-aut=\r\no; text-indent: 0px; text-transform: none; white-space: normal; widows: 2; =\r\nword-spacing: 0px; -webkit-text-size-adjust: auto; -webkit-text-stroke-widt=\r\nh: 0px; word-wrap: break-word; -webkit-nbsp-mode: space; -webkit-line-break=\r\n: after-white-space; &quot;&gt;&lt;span class=3D&quot;Apple-style-span&quot; style=3D&quot;border-col=\r\nlapse: separate; border-spacing: 0px; &quot;&gt;&lt;div style=3D&quot;word-wrap: break-word=\r\n; -webkit-nbsp-mode: space; -webkit-line-break: after-white-space; &quot;&gt;&lt;span =\r\nclass=3D&quot;Apple-style-span&quot; style=3D&quot;border-collapse: separate; color: rgb(0=\r\n, 0, 0); font-family: Times; font-style: normal; font-variant: normal; font=\r\n-weight: normal; letter-spacing: normal; line-height: normal; orphans: 2; t=\r\next-align: -webkit-auto; text-indent: 0px; text-transform: none; white-spac=\r\ne: normal; widows: 2; word-spacing: 0px; border-spacing: 0px; -webkit-text-=\r\ndecorations-in-effect: none; -webkit-text-size-adjust: auto; -webkit-text-s=\r\ntroke-width: 0px; &quot;&gt;&lt;div style=3D&quot;word-wrap: break-word; -webkit-nbsp-mode:=\r\n space; -webkit-line-break: after-white-space; &quot;&gt;&lt;span class=3D&quot;Apple-style=\r\n-span&quot; style=3D&quot;border-collapse: separate; color: rgb(0, 0, 0); font-varian=\r\nt: normal; letter-spacing: normal; line-height: normal; orphans: 2; text-al=\r\nign: -webkit-auto; text-indent: 0px; text-transform: none; white-space: nor=\r\nmal; widows: 2; word-spacing: 0px; border-spacing: 0px; -webkit-text-decora=\r\ntions-in-effect: none; -webkit-text-size-adjust: auto; -webkit-text-stroke-=\r\nwidth: 0px; &quot;&gt;&lt;div style=3D&quot;word-wrap: break-word; -webkit-nbsp-mode: space=\r\n; -webkit-line-break: after-white-space; &quot;&gt;&lt;span class=3D&quot;Apple-style-span&quot;=\r\n style=3D&quot;border-collapse: separate; color: rgb(0, 0, 0); font-variant: nor=\r\nmal; letter-spacing: normal; line-height: normal; orphans: 2; text-align: -=\r\nwebkit-auto; text-indent: 0px; text-transform: none; white-space: normal; w=\r\nidows: 2; word-spacing: 0px; border-spacing: 0px; -webkit-text-decorations-=\r\nin-effect: none; -webkit-text-size-adjust: auto; -webkit-text-stroke-width:=\r\n 0px; &quot;&gt;&lt;div style=3D&quot;word-wrap: break-word; -webkit-nbsp-mode: space; -web=\r\nkit-line-break: after-white-space; &quot;&gt;&lt;br&gt;&lt;/div&gt;&lt;div style=3D&quot;font-weight: n=\r\normal; font-style: normal; word-wrap: break-word; -webkit-nbsp-mode: space;=\r\n -webkit-line-break: after-white-space; &quot;&gt;Best regards,&lt;br&gt;&lt;font class=3D&quot;A=\r\npple-style-span&quot; color=3D&quot;#0a5d19&quot;&gt;&lt;b&gt;Jeff Clune&lt;/b&gt;&lt;/font&gt;&lt;br&gt;&lt;br&gt;Assistan=\r\nt Professor&lt;br&gt;Computer Science&lt;/div&gt;&lt;div style=3D&quot;font-weight: normal; fon=\r\nt-style: normal; word-wrap: break-word; -webkit-nbsp-mode: space; -webkit-l=\r\nine-break: after-white-space; &quot;&gt;University of Wyoming&lt;br&gt;&lt;a href=3D&quot;mailto:=\r\njeffclune@...&quot;&gt;jeffclune@...&lt;/a&gt;&lt;br&gt;jeffclune.com&lt;/div&gt;&lt;/span&gt;&lt;/d=\r\niv&gt;&lt;/span&gt;&lt;/div&gt;&lt;/span&gt;&lt;/div&gt;&lt;/span&gt;&lt;/div&gt;&lt;/div&gt;&lt;/div&gt;&lt;/span&gt;&lt;/div&gt;&lt;/span&gt;&lt;=\r\n/div&gt;&lt;/span&gt;&lt;/div&gt;&lt;/span&gt;&lt;/div&gt;&lt;/span&gt;&lt;/div&gt;&lt;/div&gt;&lt;/span&gt;\n&lt;/div&gt;\n&lt;br&gt;&lt;div&gt;&lt;=\r\ndiv&gt;On Apr 26, 2013, at 7:04 PM, joel278 &lt;&lt;a href=3D&quot;mailto:lehman.154@o=\r\nsu.edu&quot;&gt;lehman.154@...&lt;/a&gt;&gt; wrote:&lt;/div&gt;&lt;br class=3D&quot;Apple-interchan=\r\nge-newline&quot;&gt;&lt;blockquote type=3D&quot;cite&quot;&gt;\n\n\n\n\n\n\n\n\n\n\n\n\n\n&lt;div style=3D&quot;backgroun=\r\nd-color: #fff;&quot;&gt;\n&lt;span style=3D&quot;display:none&quot;&gt;&nbsp;&lt;/span&gt;\n\n\n\n    &lt;div id=\r\n=3D&quot;ygrp-text&quot;&gt;&lt;p&gt;&lt;br&gt;\n&lt;br&gt;\nHi Martin,&lt;br&gt;\n&lt;br&gt;\nYour illustration (&lt;a href=\r\n=3D&quot;http://www.martinpyka.de/wp-content/uploads/2013/04/evolvability.png&quot;&gt;h=\r\nttp://www.martinpyka.de/wp-content/uploads/2013/04/evolvability.png&lt;/a&gt;) is=\r\n very helpful in teasing apart how undirected genetic mutations (interpreti=\r\nng the isocloud on the left as the genetic space) can yet produce structure=\r\nd phenotypic changes (interpreting the image on the right as the correspond=\r\ning changes in the phenotype) through an evolvable genotype-phenotype map. =\r\n&lt;br&gt;\n&lt;br&gt;\nThanks for taking the effort to create the image, which also clar=\r\nifies how canalization can work to potentially enhance evolvability. I am l=\r\nearning much from this discussion too.&lt;br&gt;\n&lt;br&gt;\nJoel&lt;br&gt;\n&lt;br&gt;\n--- In &lt;a hre=\r\nf=3D&quot;mailto:neat%40yahoogroups.com&quot;&gt;neat@yahoogroups.com&lt;/a&gt;, &quot;martin_pyka&quot;=\r\n &lt;martin.pyka@...&gt; wrote:&lt;br&gt;\n&gt;&lt;br&gt;\n&gt; Hi Joel,&lt;br&gt;\n&gt; &lt;br&gt;\n&g=\r\nt; thanks for your fast response which addressed exactly my inquiry. &lt;br&gt;\n&=\r\ngt; &lt;br&gt;\n&gt; First, I want to clarify that even if evolvability can reach =\r\na maximum the conclusion of your paper is correct that it can emerge withou=\r\nt any pressure for adaptation in the individuals. In this regard, my questi=\r\non whether a maximum of evolvability exists was more of general nature.&lt;br&gt;=\r\n\n&gt; &lt;br&gt;\n&gt; &gt; The way I think about it currently is that perhaps the=\r\nre is no ultimate tension, and that evolvability can generally increase wit=\r\nhout limit. The reason is that canalization of low-level mechanisms can act=\r\n to increase evolvability. For example, many of the mechanisms behind devel=\r\nopment are heavily conserved, but can generate much phenotypic variability =\r\nthrough being combined and modulated in various ways. In other words, modul=\r\nating conserved features of development gives evolution higher-level levers=\r\n that enable small genetic changes to be amplified and have a large meaning=\r\nful phenotypic effect. Thus through continued evolution of the genotype/phe=\r\nnotype map, perhaps evolvability can continually increase (through exploiti=\r\nng canalization of lower-level mechanisms to generate increasingly high-lev=\r\nel features).&lt;br&gt;\n&gt; &lt;br&gt;\n&gt; Yep, when I read this I noted that this is=\r\n actually also my opinion about generative encodings. From this perspective=\r\n, I would also assume that evolvability can continuously increase in the se=\r\nnse that the genome can become more powerful (or more flexible) in generati=\r\nng new meaningful phenotypes. Maybe my implicit assumption was not correct =\r\nthat evolvability in a phenotype map could be depicted as iso-oriented poin=\r\nt-cloud:&lt;br&gt;\n&gt; &lt;br&gt;\n&gt; left image in &lt;a href=3D&quot;http://www.martinpyka.=\r\nde/wp-content/uploads/2013/04/evolvability.png&quot;&gt;http://www.martinpyka.de/wp=\r\n-content/uploads/2013/04/evolvability.png&lt;/a&gt;&lt;br&gt;\n&gt; &lt;br&gt;\n&gt; According =\r\nto this illustration, increased evolvability would increase the size of the=\r\n point cloud. I think I had this picture in mind when I argued in my previo=\r\nus post that evolvability cannot increase infinitely because genotype-pheno=\r\ntype mappings should become instable when a certain degree of evolvability =\r\nhas been reached. However, maybe a 2d-depiction of the evolvable phenotype-=\r\nspace would rather look like in the right image (I am sorry for my poor art=\r\nwork). Through canalization, not all phenotypes in the 2d-space are evolvab=\r\nle but evolvability itself can still increase!?&lt;br&gt;\n&gt; &lt;br&gt;\n&gt; Maybe, b=\r\noth pictures can also illustrate what canalization means. The left picture =\r\ncould depict all possible points in the genotype space that can be reached =\r\nthrough mutation and recombination and the right image all possible points =\r\nin the phenotype space that can be generated from it. While each bit in the=\r\n (2d)-genotype has equal probability of been mutated, in canalized encoding=\r\ns only a well-ordered subspace of phenotypes can be reached.&lt;br&gt;\n&gt; &lt;br&gt;\n=\r\n&gt; Thank you for this inspiring discussion. :-) I enjoy thinking about ho=\r\nw all this fits together.&lt;br&gt;\n&gt; &lt;br&gt;\n&gt; Best,&lt;br&gt;\n&gt; Martin&lt;br&gt;\n&gt;=\r\n&lt;br&gt;\n&lt;br&gt;\n&lt;/p&gt;\n\n    &lt;/div&gt;\n     \n\n    \n\n&lt;/div&gt;\n\n\n\n&lt;!-- end group email --&gt;\n=\r\n\n&lt;/blockquote&gt;&lt;/div&gt;&lt;br&gt;&lt;/div&gt;&lt;/span&gt;&lt;/body&gt;&lt;/html&gt;\n\r\n--Apple-Mail=_84B27BA5-6EE8-4454-A821-7DF45EE2CD1D--\r\n\n"}}