{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[{"name":"READ"}]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"userId":464818732,"authorName":"Jeff Clune","from":"Jeff Clune &lt;jclune@...&gt;","profile":"jeffreyclune","replyTo":"LIST","senderId":"_BQKClLKvg6ZZ0Z6ZffgqetAgz-ktD_HJybQOLl_4TDA5C73ldB40hlWEe_U-Z0gLsl5SQQ8MlrUGswUHovYJXuv924","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [neat] Quantitative vs. Qualitative Results","postDate":"1370202236","msgId":6111,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDg5N0IwNzIwLTlGMjktNDQwMi04NUMzLUEwNDUzMkIyRDE3QkBnbWFpbC5jb20+","inReplyToHeader":"PGtvZGZsaCs5OHA5QGVHcm91cHMuY29tPg==","referencesHeader":"PGtvZGZsaCs5OHA5QGVHcm91cHMuY29tPg=="},"prevInTopic":6109,"nextInTopic":6112,"prevInTime":6110,"nextInTime":6112,"topicId":6038,"numMessagesInTopic":46,"msgSnippet":"Hello Randy, Please see below. ... That s only true if you can quantitatively measure the phenomenon. **If** you can do that, then of course you should report","rawEmail":"Return-Path: &lt;jclune@...&gt;\r\nX-Sender: jclune@...\r\nX-Apparently-To: neat@yahoogroups.com\r\nX-Received: (qmail 19809 invoked by uid 102); 2 Jun 2013 19:44:01 -0000\r\nX-Received: from unknown (HELO mtaq1.grp.bf1.yahoo.com) (10.193.84.32)\n  by m6.grp.bf1.yahoo.com with SMTP; 2 Jun 2013 19:44:01 -0000\r\nX-Received: (qmail 32079 invoked from network); 2 Jun 2013 19:44:01 -0000\r\nX-Received: from unknown (HELO mail-wg0-f41.google.com) (74.125.82.41)\n  by mtaq1.grp.bf1.yahoo.com with SMTP; 2 Jun 2013 19:44:01 -0000\r\nX-Received: by mail-wg0-f41.google.com with SMTP id k13so2095974wgh.2\n        for &lt;neat@yahoogroups.com&gt;; Sun, 02 Jun 2013 12:44:00 -0700 (PDT)\r\nX-Received: by 10.180.9.35 with SMTP id w3mr10001403wia.46.1370202240807;\n        Sun, 02 Jun 2013 12:44:00 -0700 (PDT)\r\nReturn-Path: &lt;jclune@...&gt;\r\nX-Received: from [192.168.0.2] ([90.208.61.134])\n        by mx.google.com with ESMTPSA id fv11sm18715135wic.11.2013.06.02.12.43.57\n        for &lt;neat@yahoogroups.com&gt;\n        (version=TLSv1 cipher=ECDHE-RSA-RC4-SHA bits=128/128);\n        Sun, 02 Jun 2013 12:43:59 -0700 (PDT)\r\nContent-Type: multipart/alternative; boundary=&quot;Apple-Mail=_FC631B49-9DF7-402D-990C-BF721EEE2192&quot;\r\nMessage-Id: &lt;897B0720-9F29-4402-85C3-A04532B2D17B@...&gt;\r\nMime-Version: 1.0 (Mac OS X Mail 6.3 &#92;(1503&#92;))\r\nDate: Sun, 2 Jun 2013 20:43:56 +0100\r\nReferences: &lt;kodflh+98p9@...&gt;\r\nTo: neat@yahoogroups.com\r\nIn-Reply-To: &lt;kodflh+98p9@...&gt;\r\nX-Mailer: Apple Mail (2.1503)\r\nX-eGroups-Msg-Info: 1:12:0:0:0\r\nFrom: Jeff Clune &lt;jclune@...&gt;\r\nSubject: Re: [neat] Quantitative vs. Qualitative Results\r\nX-Yahoo-Group-Post: member; u=464818732; y=VLj9RMtTtwQFzz--Ygq0TQ8ZrxA3NZywI9RSwRC3uieIBQ49pWJN\r\nX-Yahoo-Profile: jeffreyclune\r\n\r\n\r\n--Apple-Mail=_FC631B49-9DF7-402D-990C-BF721EEE2192\r\nContent-Transfer-Encoding: quoted-printable\r\nContent-Type: text/plain;\n\tcharset=windows-1252\r\n\r\nHello Randy,\n\nPlease see below. \n\n&gt; What if we show qualitative results of =\r\nmultiple evolutionary runs? At that point, if the phenomenon is truly repro=\r\nducible across replicate evolutionary runs (w/ different seeds), then we al=\r\nready have a simple qualitative metric: How many replicates reproduced the =\r\nphenomenon. Of course, that is a weak qualitative analysis, but if other me=\r\nasures are lacking, it would still be more informative than saying, &quot;this t=\r\nechnique worked once (here&#39;s a video).&quot;\n&gt; \n&gt; \n\nThat&#39;s only true if you can =\r\nquantitatively measure the phenomenon. **If** you can do that, then of cour=\r\nse you should report quantitative metrics on it (with p-values, effect size=\r\ns, etc.). But my point is about results that you can&#39;t quantify. Should the=\r\ny be categorically excluded because they resist quantification? \n\nFor examp=\r\nle, are the 3D shapes produced by CPPNs on EndlessForms interestingly diffe=\r\nrent from those produced by L-Systems? Are the images on Picbreeder.com mor=\r\ne complex and nuanced than--or at least, interestingly different from--the =\r\nimages from Dawkins&#39; Biomorphs? I think the answer is clearly yes, but any =\r\nattempt to quantify that would be a wasted exercise: the quantification wou=\r\nld be full of problems, and you&#39;d spend a lot of time forcing a quantitativ=\r\ne assessment of something that is patently obvious to every human being. Wh=\r\ny force ourselves to jump through that wasteful, and unhelpful, hoop?\n\n&gt; Le=\r\nt&#39;s ground this idea with a concrete example. Last year at ALife, one of th=\r\ne presenters in the Artificial Life track presented work where (they openly=\r\n admitted) that the phenomenon only occurred 1 out of 100 replicates. IOW, =\r\nthe researcher had N=3D1. They went on to talk about how the environment sh=\r\naped the observed phenomenon in that single replicate. Would this ever pass=\r\n in any other field? Would *you* believe that the environment had any effec=\r\nt with N=3D1? Effectively, that is what showing a qualitative result is.\n&gt; =\r\n\n&gt; \nI am not going to defend that practice unless it was just a proof of co=\r\nncept that the phenomenon can happen (as Julian points out). Something occu=\r\nrring once is only a demonstration that it *can* happen, but of course if i=\r\nt happens only once then very little else can be concluded. \n\n&gt; In science,=\r\n it is vital to show that our results are reproducible and measurable. Thus=\r\n, by that very nature, we must provide a quantitative analysis of our resul=\r\nts. However, in my (and many others&#39;) view, I do not think that how the res=\r\nults are presented is the core problem. Rather, the problem lies in how the=\r\n experiments are designed and the hypotheses addressed (or lack thereof).\n&gt;=\r\n \n&gt; ### Hypothesis testing ###\n&gt; \n&gt; This is an argument that was huge in th=\r\ne biology community some 50 years ago. I refer to, e.g., &quot;Strong Inference&quot;=\r\n by J Platt (1964). What is the best (or, most expedient) way to do science=\r\n? Platt&#39;s paper has some great quotes, and he eloquently touches on some re=\r\nlevant subjects for the very conversation we are having here.\n&gt; \n&gt; First, l=\r\net&#39;s touch on the culture of method development. Too much research focuses =\r\non method development rather than testing a hypothesis that actually advanc=\r\nes the field. I&#39;ve read too many papers that say, &quot;we hypothesize that our =\r\nmethod will work in task A.&quot; That&#39;s technically a testable hypothesis, but =\r\nwhat does testing that hypothesis really tell us? Has anyone outside of you=\r\nr work group actually wondered about that question? Testing that hypothesis=\r\n just shows that our method works on task A, but like JBM said, the field a=\r\ns a whole doesn&#39;t actually learn much from it.\n&gt; \n&gt; Instead of showing that=\r\n our method works on task A, we can address broader hypotheses with the met=\r\nhod. What is it about our method that allows it to work on task A? For exam=\r\nple, what fundamental body plan does a robot need for an evolved ANN to con=\r\ntrol it? [&quot;Morphological change in machines accelerates the evolution of ro=\r\nbust behavior&quot;, Bongard (2011)] Or, how does using a generative encoding vs=\r\n. a direct encoding affect mutation effect size? [&quot;Evolving Coordinated Qua=\r\ndruped Gaits with the HyperNEAT Generative Encoding&quot;, Clune et al. (2009)] =\r\nThese papers demonstrated new methods while also answering questions that a=\r\nre broadly interesting beyond that method. Method development should occur =\r\n*alongside* the science, but it should not be the focus of the science itse=\r\nlf.\n&gt; \n&gt; \nI completely agree with you. \n\n&gt; What&#39;s worse, this culture of me=\r\nthod development has led to a culture of method comparison, e.g., &quot;our meth=\r\nod outperforms method X on benchmark A.&quot; In this kind of work, method devel=\r\nopment really is the focus of the research. As Ken attests, after spending =\r\nmonths reading this kind of literature, it leaves you knowing little more t=\r\nhan &quot;method X is better than method Y on tasks A, B, and C.&quot; This kind of w=\r\nork has no lasting effect because the hypotheses it addresses are weak.\n&gt; \n=\r\n&gt; As such, the field would benefit from researchers focusing more on what b=\r\nroader hypotheses they want to address with their work, rather than what me=\r\nthod will produce a phenomenon. What broadly interesting questions can we a=\r\nnswer with our method?\n&gt; \n&gt; \nAmen! But I don&#39;t think that agreeing with you=\r\n also means that we should rule out hard-to-quantify results if they are in=\r\nteresting for testing broader hypotheses. \n\nBest regards,\nJeff Clune\n\nAssis=\r\ntant Professor\nComputer Science\nUniversity of Wyoming\njeffclune@...\nje=\r\nffclune.com\n\n\n&gt; --- In neat@yahoogroups.com, &quot;Ken&quot; &lt;kstanley@...&gt; wrote:\n&gt; =\r\n&gt;\n&gt; &gt; \n&gt; &gt; \n&gt; &gt; Hi JBM, thanks for getting deeper into this fascinating iss=\r\nue of how we can be confident that a paper has strong results. I hope you d=\r\non&#39;t mind that I changed the subject line to make this thread easier to fin=\r\nd in the future.\n&gt; &gt; \n&gt; &gt; I think we all broadly agree that there is no sin=\r\ngle formula for a good paper and you and Jeff are arguing more about matter=\r\ns of degree. I am very interested in this subject as you know and I think i=\r\nt merits a lot more attention than it usually gets, which is one reason I&#39;m=\r\n glad you got deeper into it. So here I want to add some more weight to the=\r\n case for qualitative papers. I should warn everyone up front that I took t=\r\nhis opportunity basically to write an essay, so this is a long post full of=\r\n my thoughts on this issue.\n&gt; &gt; \n&gt; &gt; I believe most people in our field wou=\r\nld agree with JBM&#39;s assertion that there is &quot;a strong correlation between w=\r\neak papers and papers without strong quantitative results.&quot;\n&gt; &gt; \n&gt; &gt; I want=\r\n to question that assumption because I do not believe it is true even thoug=\r\nh it is widely assumed to be true and in fact is perhaps the engine behind =\r\nthe entire reviewing philosophy in AI. In fact, this issue of how science s=\r\nhould progress is ultimately not a scientific issue but a philosophical iss=\r\nue. That is, when you begin to discuss which kinds of results are most usef=\r\nul for future progress, it is a meta-discussion about how science progresse=\r\ns. Paul Feyerabend, who was a kind of radical philosopher of science, has a=\r\n really nice quote on this issue that I find inspirational: \n&gt; &gt; \n&gt; &gt; &quot;To t=\r\nhose who look at the rich material provided by history, and who are not int=\r\nent on impoverishing it in order to please their lower instincts, their cra=\r\nving for intellectual security in the form of clarity, precision, &#39;objectiv=\r\nity&#39;, &#39;truth&#39;, it will become clear that there is only one principle that c=\r\nan be defended under all circumstances and in all stages of human developme=\r\nnt. It is the principle: anything goes.&quot; \n&gt; &gt; Against Method: Outline of an=\r\n Anarchistic Theory of Knowledge (1975)\n&gt; &gt; \n&gt; &gt; My personal experience fit=\r\ns very well with this idea. There will be times in history where quantifica=\r\ntion is what we need, and other times when it is the last thing we need. An=\r\nd I believe the worship of quantification has recently, at this point in th=\r\ne history of our field, been mostly an obstacle to progress put in place by=\r\n those &quot;craving for intellectual security,&quot; as Feyerabend puts it. But inse=\r\ncurity is not a good foundation for the building of wisdom because explorat=\r\nion requires courage and a willingness to confront ambiguity. Quantificatio=\r\nn at this time in AI is largely an attempt to escape from ambiguity, and th=\r\nereby becomes a form of deception.\n&gt; &gt; \n&gt; &gt; Consider what I have called the=\r\n &quot;objective paradox&quot;: often if you measure the ability of a method or encod=\r\ning in EC to achieve a specific objective, your conclusions about what that=\r\n method can achieve in general will be entirely skewed and misleading. Targ=\r\net-based benchmarks, rather than giving confidence, are causing us to miss =\r\nthe forest for the trees. Think how in my paper with Brian Woolley (http://=\r\neplex.cs.ucf.edu/publications/2011/woolley-gecco11) we could not re-evolve =\r\nmany images on Picbreeder with NEAT and CPPNs (which are the very methods b=\r\nehind Picbreeder). So in the quantitative world we would conclude that CPPN=\r\ns cannot evolve such images. And in fact results of this sort (showing meth=\r\nod X cannot solve problem A) are published all the time, and almost entirel=\r\ny misleading. \n&gt; &gt; \n&gt; &gt; They are also the basis of highly deceptive compari=\r\nsons between method X and Y. We like to say if method X &quot;performs significa=\r\nntly better&quot; than method Y on task A then method X is somehow &quot;better.&quot; But=\r\n the truth is that often the ability of an encoding to evolve to a specific=\r\n target is a bad sign for its ability to ever produce anything interesting.=\r\n Think about direct encodings: they will always win on low-dimensional targ=\r\net-matching problems but are a dead end for evolving anything truly complex=\r\n. We are fooling ourselves with quantification.\n&gt; &gt; \n&gt; &gt; Even people who ar=\r\ne aware of Woolley&#39;s result and agree with our conclusions *still* publish =\r\nthis kind of result because our culture is so deeply entrenched in this kin=\r\nd of quantification that we simply have no idea what else to do. If we were=\r\n willing to truly embrace the absurdity of this kind of analysis, someone w=\r\nould have the courage to proclaim that DNA is incapable of evolving humans =\r\n(which were of course never set as the objective of evolution). After all, =\r\nif humans were set as objective targets for evolution from the start, there=\r\n would be no humans. \n&gt; &gt; \n&gt; &gt; How many of us have tried to test method X o=\r\nn objective A and found method X wanting and then published the result? And=\r\n how many such papers would you consider &quot;strong?&quot; Our culture of worshippi=\r\nng quantification has often led us astray on the real power of evolution an=\r\nd the potential of different encodings. If intuition trumped quantification=\r\n (a heretical suggestion) this fundamental confusion would not have arisen =\r\nso severely.\n&gt; &gt; \n&gt; &gt; Now I want to look at this issue from the opposite di=\r\nrection, where my own experience has been much more positive: how qualitati=\r\nve observations often lead to unexpected leaps of insight in a way quantita=\r\ntive results rarely have for me. In fact, almost every idea in which I have=\r\n been involved is the result of a qualitative observation, exactly the kind=\r\n that worshipers of quantification seem to want to prevent us from publishi=\r\nng and sharing with each other. \n&gt; &gt; \n&gt; &gt; For example, before I thought of =\r\nNEAT I read dozens of neuroevolution papers (this was in the Fall of 1999).=\r\n There were tons of quantitative results and comparisons, but at the end of=\r\n four months of reading all this literature, I did not remember any of the =\r\nquantitative results. Instead, what was left with me was a &quot;feeling&quot; that s=\r\nomething qualitative was missing: Regardless of performance, none of these =\r\nmethods had the feel of nature when it came to the tendency for complexity =\r\nto increase elegantly and indefinitely. And that is where the inspiration f=\r\nor NEAT began, by ignoring quantitative results. If I had followed them, I =\r\nwould simply have built upon the &quot;best&quot; neuroevolution method of the time, =\r\nwhich had been my original plan, having been brought up too in the culture =\r\nof quantification. So then there would be no NEAT.\n&gt; &gt; \n&gt; &gt; My idea for CPP=\r\nNs was also from an entirely qualitative observation. It actually came befo=\r\nre Picbreeder. The main insight was actually from evolving a spaceship imag=\r\ne in Mattias Fagerlund&#39;s old NEAT-based Genetic Art program. The experience=\r\n of evolving the spaceship was so exciting to me at the time that I put up =\r\na whole website on it: http://www.cs.utexas.edu/users/kstanley/rocket.html =\r\n\n&gt; &gt; \n&gt; &gt; There was not a single quantitative result, but I was convinced t=\r\nhat I had seen something, qualitatively, that resonated with nature. It was=\r\n that qualitative feeling, that recognition of something deep in the result=\r\ns, that led to CPPNs. It was a couple years later that the whole theory sol=\r\nidified and I wrote the journal article on CPPNS: http://eplex.cs.ucf.edu/p=\r\nublications/2007/stanley-gpem07\n&gt; &gt; \n&gt; &gt; One interesting thing about that C=\r\nPPN journal article is that it is almost entirely qualitative. As you can i=\r\nmagine, that posed problems for review, but I was determined not to pollute=\r\n it with meaningless quantification. For me, the images speak for themselve=\r\ns.\n&gt; &gt; \n&gt; &gt; Those observations on CPPNs and their resulting symmetries and =\r\nregularities are also what led to David D&#39;Ambrosio, Jason Gauci and myself =\r\ncreating HyperNEAT - again, the inspiration for the idea was not any quanti=\r\ntative demonstration of anything. \n&gt; &gt; \n&gt; &gt; And finally, as some of you kno=\r\nw, novelty search itself was not inspired by a quantitative result. Rather,=\r\n it comes *again* from evolving pictures - in this case it was my experienc=\r\ne of evolving the Picbreeder Car: picbreeder.org/search/showgenome.php?sid=\r\n=3D464\n&gt; &gt; What shocked me from the experience of evolving the car was that=\r\n I had not been trying to evolve a car. I could not stop thinking about tha=\r\nt, about how I did something really hard (from a qualitative perspective) b=\r\ny not trying to do it. I later noticed that almost every interesting image =\r\non the site has the same strange story. I discussed the implications of the=\r\nse observations with Joel Lehman, which led us both to novelty search.\n&gt; &gt; =\r\n\n&gt; &gt; Now someone could argue that these ideas may all turn out &quot;weak&quot; in th=\r\ne end. But that would be a strange philosophy of science; it would suggest =\r\nthat we should never have explored down these roads in the first place. Of =\r\ncourse we cannot know where any road leads until we take it - and I think a=\r\nt least it&#39;s clear these were roads worth exploring though no one can say t=\r\nhey lead ultimately to the greatest truths. But it&#39;s still worth the lesson=\r\ns along the way. \n&gt; &gt; \n&gt; &gt; Someone might also think, okay, your inspiration=\r\ns may have been qualitative but your *results* were mainly quantitative, an=\r\nd somehow that&#39;s what matters (though recall the CPPN paper does not have q=\r\nuantitative results). As JBM points out, our novelty search paper did have =\r\nquantitative results that ultimately convinced him something interesting wa=\r\ns going on. But I think again the focus here on &quot;results&quot; misses the forest=\r\n for the trees. What is more important for the progress of science than the=\r\n results is the *inspiration* that leads to the ideas that produced the res=\r\nults. If the inspiration is withheld, if I cannot share with you the analog=\r\nue of the spaceship or the car in the future, then you can never draw from =\r\nthose inspirations to find new roads for us to travel. The kind of science =\r\nthat I believe JBM and many others idealize cuts out all the inspiration fr=\r\nom the public sphere and leaves us only to share its fruits when someone is=\r\n lucky enough in private to see something interesting (and try to quantify =\r\nit then).\n&gt; &gt; \n&gt; &gt; Nevertheless, JBM says, &quot;I think that it is much harder =\r\nto write a convincing paper without any quantitative test than with the hel=\r\np of measures/comparisons/etc.&quot; Again, many would share this sentiment. But=\r\n if you think about it, what exactly do we need to be &quot;convinced&quot; of? Why d=\r\no we think science (or AI especially) is about convincing someone of someth=\r\ning? Why do we need e.g. 30 strangers to validate an intuition we already f=\r\neel deeply that something is interesting? The links in the chain of progres=\r\ns are from inspiration, not from convincing. There are many ideas that are =\r\nneither right nor wrong anyway, but worth exploring because they will lead =\r\nus to new revelations. To me, capturing the essence of nature is as much ab=\r\nout a feeling as it is about a result. And my experience in practice bears =\r\nthat out.\n&gt; &gt; \n&gt; &gt; Here is where I want to return to the intellectual insec=\r\nurity that Feyerabend raises. I think our quantitative culture all boils do=\r\nwn to this problem of insecurity. We do not trust ourselves to have valid i=\r\nntuitions. We dismiss our own ability to think, as with JBM&#39;s tongue-in-che=\r\neck parody, &quot;look, cool simulated robots.&quot; But I want to question why we ar=\r\ne so insecure in our own qualitative judgments? \n&gt; &gt; \n&gt; &gt; For those of us w=\r\nith PhDs, our countries invested something like 25 years into our education=\r\n. Shouldn&#39;t someone who supposedly succeeded in jumping through intellectua=\r\nl hoop after hoop after hoop - eventually impressing their peers enough to =\r\nbe hired, even eventually to be tenured or promoted - be able to think for =\r\nthemselves sufficiently to decide whether the &quot;cool robots&quot; are worth shari=\r\nng with other scientists because they might inspire new ideas? If we are re=\r\nally entirely unqualified after all those years of supposedly learning to b=\r\ne a scientist, then what was the use of all that public investment? Was it =\r\nsimply to validate that we are able to check p-values that someone else rep=\r\norts in an X vs. Y quantitative comparison? That&#39;s all we&#39;re qualified to d=\r\no? Why do we deny our intellectual curiosity and ability to think for ourse=\r\nlves? \n&gt; &gt; \n&gt; &gt; You may think it can&#39;t be done. Maybe you think my personal=\r\n experience with NEAT, CPPNs, HyperNEAT, novelty search, etc. is some kind =\r\nof fluke that doesn&#39;t really represent science and how it works. Maybe you =\r\nthink that kind of qualitative approach may work for Ken for some reason bu=\r\nt it can&#39;t work in general. But why would that be? Isn&#39;t it possible that w=\r\ne are all prematurely discrediting our intellectual potential to think for =\r\nourselves? We have created a culture in which the spaceships and cars of sc=\r\nience must be hidden, buried until their discoverers figure out (or give up=\r\n figuring out) their deeper implications. I do not support publishing a pap=\r\ner simply because of some &quot;cool robots,&quot; but I do support qualified scienti=\r\nsts deciding for themselves, from their experience and intuitions, whether =\r\nthose cool robots might be the seed of an important chain of ideas. And I d=\r\no not want those cool robots hidden from me as a reader of scientific liter=\r\nature if they might be such a seed. When I looked at Jeff&#39;s recent video of=\r\n his cool robots, I could feel those wheels of intuition turning in my mind=\r\n. I still don&#39;t know if it leads to anything, but I don&#39;t need any quantifi=\r\ncation to know that that feeling is more than enough to justify publishing =\r\nthat paper, and I&#39;m grateful he and his coauthors did not try to obfuscate =\r\nit with a veil of needless quantification.\n&gt; &gt; \n&gt; &gt; Best,\n&gt; &gt; \n&gt; &gt; ken\n&gt; \n&gt;=\r\n \n\n\r\n--Apple-Mail=_FC631B49-9DF7-402D-990C-BF721EEE2192\r\nContent-Transfer-Encoding: quoted-printable\r\nContent-Type: text/html;\n\tcharset=windows-1252\r\n\r\n&lt;html&gt;&lt;head&gt;&lt;meta http-equiv=3D&quot;Content-Type&quot; content=3D&quot;text/html charset=\r\n=3Dwindows-1252&quot;&gt;&lt;/head&gt;&lt;body style=3D&quot;word-wrap: break-word; -webkit-nbsp-=\r\nmode: space; -webkit-line-break: after-white-space; ; font-family: &#39;Times&#39;;=\r\n font-size: 14px; color: rgb( 0,  0,  0); &quot;&gt;&lt;span style=3D&quot;font-family: &#39;Ti=\r\nmes&#39;; font-size: 14px; color: rgb( 0,  0,  0)&quot;&gt;&lt;div&gt;Hello Randy,&lt;/div&gt;&lt;div&gt;=\r\n&lt;br&gt;&lt;/div&gt;&lt;div&gt;Please see below.&nbsp;&lt;/div&gt;&lt;div&gt;&lt;br&gt;&lt;blockquote type=3D&quot;ci=\r\nte&quot;&gt;&lt;div style=3D&quot;background-color: rgb(255, 255, 255); position: static; z=\r\n-index: auto; &quot;&gt;&lt;div id=3D&quot;ygrp-mlmsg&quot; style=3D&quot;position:relative;&quot;&gt;&lt;div id=\r\n=3D&quot;ygrp-msg&quot; style=3D&quot;z-index: 1;&quot;&gt;&lt;div id=3D&quot;ygrp-text&quot;&gt;&lt;p&gt;What if we sho=\r\nw qualitative results of multiple evolutionary runs? At that point, if the =\r\nphenomenon is truly reproducible across replicate evolutionary runs (w/ dif=\r\nferent seeds), then we already have a simple qualitative metric: How many r=\r\neplicates reproduced the phenomenon. Of course, that is a weak qualitative =\r\nanalysis, but if other measures are lacking, it would still be more informa=\r\ntive than saying, &quot;this technique worked once (here&#39;s a video).&quot;&lt;br&gt;\n&lt;br&gt;&lt;/=\r\np&gt;&lt;/div&gt;&lt;/div&gt;&lt;/div&gt;&lt;/div&gt;&lt;/blockquote&gt;&lt;div&gt;&lt;br&gt;&lt;/div&gt;&lt;div&gt;That&#39;s only true=\r\n if you can quantitatively measure the phenomenon. **If** you can do that, =\r\nthen of course you should report quantitative metrics on it (with p-values,=\r\n effect sizes, etc.). But my point is about results that you can&#39;t quantify=\r\n. Should they be categorically excluded because they resist quantification?=\r\n&nbsp;&lt;/div&gt;&lt;div&gt;&lt;br&gt;&lt;/div&gt;&lt;div&gt;For example, are the 3D shapes produced by =\r\nCPPNs on EndlessForms interestingly different from those produced by L-Syst=\r\nems? Are the images on &lt;a href=3D&quot;http://Picbreeder.com&quot;&gt;Picbreeder.com&lt;/a&gt;=\r\n more complex and nuanced than--or at least, interestingly different from--=\r\nthe images from Dawkins&#39; Biomorphs? I think the answer is clearly yes, but =\r\nany attempt to quantify that would be a wasted exercise: the quantification=\r\n would be full of problems, and you&#39;d spend a lot of time forcing a quantit=\r\native assessment of something that is patently obvious to every human being=\r\n. Why force ourselves to jump through that wasteful, and unhelpful, hoop?&lt;/=\r\ndiv&gt;&lt;br&gt;&lt;blockquote type=3D&quot;cite&quot;&gt;&lt;div style=3D&quot;background-color: rgb(255, =\r\n255, 255); position: static; z-index: auto; &quot;&gt;&lt;div id=3D&quot;ygrp-mlmsg&quot; style=\r\n=3D&quot;position:relative;&quot;&gt;&lt;div id=3D&quot;ygrp-msg&quot; style=3D&quot;z-index: 1;&quot;&gt;&lt;div id=\r\n=3D&quot;ygrp-text&quot;&gt;&lt;p&gt;\nLet&#39;s ground this idea with a concrete example. Last yea=\r\nr at ALife, one of the presenters in the Artificial Life track presented wo=\r\nrk where (they openly admitted) that the phenomenon only occurred 1 out of =\r\n100 replicates. IOW, the researcher had N=3D1. They went on to talk about h=\r\now the environment shaped the observed phenomenon in that single replicate.=\r\n Would this ever pass in any other field? Would *you* believe that the envi=\r\nronment had any effect with N=3D1? Effectively, that is what showing a qual=\r\nitative result is.&lt;br&gt;\n&lt;br&gt;&lt;/p&gt;&lt;/div&gt;&lt;/div&gt;&lt;/div&gt;&lt;/div&gt;&lt;/blockquote&gt;&lt;div&gt;I =\r\nam not going to defend that practice unless it was just a proof of concept =\r\nthat the phenomenon can happen (as Julian points out). Something occurring =\r\nonce is only a demonstration that it *can* happen, but of course if it happ=\r\nens only once then very little else can be concluded.&nbsp;&lt;/div&gt;&lt;div&gt;&lt;br&gt;&lt;=\r\n/div&gt;&lt;blockquote type=3D&quot;cite&quot;&gt;&lt;div style=3D&quot;background-color: rgb(255, 255=\r\n, 255); position: static; z-index: auto; &quot;&gt;&lt;div id=3D&quot;ygrp-mlmsg&quot; style=3D&quot;=\r\nposition:relative;&quot;&gt;&lt;div id=3D&quot;ygrp-msg&quot; style=3D&quot;z-index: 1;&quot;&gt;&lt;div id=3D&quot;y=\r\ngrp-text&quot;&gt;&lt;p&gt;\nIn science, it is vital to show that our results are reproduc=\r\nible and measurable. Thus, by that very nature, we must provide a quantitat=\r\nive analysis of our results. However, in my (and many others&#39;) view, I do n=\r\not think that how the results are presented is the core problem. Rather, th=\r\ne problem lies in how the experiments are designed and the hypotheses addre=\r\nssed (or lack thereof).&lt;br&gt;\n&lt;br&gt;\n### Hypothesis testing ###&lt;br&gt;\n&lt;br&gt;\nThis i=\r\ns an argument that was huge in the biology community some 50 years ago. I r=\r\nefer to, e.g., &quot;Strong Inference&quot; by J Platt (1964). What is the best (or, =\r\nmost expedient) way to do science? Platt&#39;s paper has some great quotes, and=\r\n he eloquently touches on some relevant subjects for the very conversation =\r\nwe are having here.&lt;br&gt;\n&lt;br&gt;\nFirst, let&#39;s touch on the culture of method de=\r\nvelopment. Too much research focuses on method development rather than test=\r\ning a hypothesis that actually advances the field. I&#39;ve read too many paper=\r\ns that say, &quot;we hypothesize that our method will work in task A.&quot; That&#39;s te=\r\nchnically a testable hypothesis, but what does testing that hypothesis real=\r\nly tell us? Has anyone outside of your work group actually wondered about t=\r\nhat question? Testing that hypothesis just shows that our method works on t=\r\nask A, but like JBM said, the field as a whole doesn&#39;t actually learn much =\r\nfrom it.&lt;br&gt;\n&lt;br&gt;\nInstead of showing that our method works on task A, we ca=\r\nn address broader hypotheses with the method. What is it about our method t=\r\nhat allows it to work on task A? For example, what fundamental body plan do=\r\nes a robot need for an evolved ANN to control it? [&quot;Morphological change in=\r\n machines accelerates the evolution of robust behavior&quot;, Bongard (2011)] Or=\r\n, how does using a generative encoding vs. a direct encoding affect mutatio=\r\nn effect size? [&quot;Evolving Coordinated Quadruped Gaits with the HyperNEAT Ge=\r\nnerative Encoding&quot;, Clune et al. (2009)] These papers demonstrated new meth=\r\nods while also answering questions that are broadly interesting beyond that=\r\n method. Method development should occur *alongside* the science, but it sh=\r\nould not be the focus of the science itself.&lt;br&gt;\n&lt;br&gt;&lt;/p&gt;&lt;/div&gt;&lt;/div&gt;&lt;/div&gt;=\r\n&lt;/div&gt;&lt;/blockquote&gt;&lt;div&gt;I completely agree with you.&nbsp;&lt;/div&gt;&lt;div&gt;&lt;br&gt;&lt;/=\r\ndiv&gt;&lt;blockquote type=3D&quot;cite&quot;&gt;&lt;div style=3D&quot;background-color: rgb(255, 255,=\r\n 255); position: static; z-index: auto; &quot;&gt;&lt;div id=3D&quot;ygrp-mlmsg&quot; style=3D&quot;p=\r\nosition:relative;&quot;&gt;&lt;div id=3D&quot;ygrp-msg&quot; style=3D&quot;z-index: 1;&quot;&gt;&lt;div id=3D&quot;yg=\r\nrp-text&quot;&gt;&lt;p&gt;\nWhat&#39;s worse, this culture of method development has led to a =\r\nculture of method comparison, e.g., &quot;our method outperforms method X on ben=\r\nchmark A.&quot; In this kind of work, method development really is the focus of =\r\nthe research. As Ken attests, after spending months reading this kind of li=\r\nterature, it leaves you knowing little more than &quot;method X is better than m=\r\nethod Y on tasks A, B, and C.&quot; This kind of work has no lasting effect beca=\r\nuse the hypotheses it addresses are weak.&lt;br&gt;\n&lt;br&gt;\nAs such, the field would=\r\n benefit from researchers focusing more on what broader hypotheses they wan=\r\nt to address with their work, rather than what method will produce a phenom=\r\nenon. What broadly interesting questions can we answer with our method?&lt;br&gt;=\r\n\n&lt;br&gt;&lt;/p&gt;&lt;/div&gt;&lt;/div&gt;&lt;/div&gt;&lt;/div&gt;&lt;/blockquote&gt;&lt;div&gt;Amen! But I don&#39;t think =\r\nthat agreeing with you also means that we should rule out hard-to-quantify =\r\nresults if they are interesting for testing broader hypotheses.&nbsp;&lt;/div&gt;=\r\n&lt;div&gt;&lt;br&gt;&lt;/div&gt;&lt;div&gt;&lt;div&gt;&lt;span style=3D&quot;font-size: 14px; &quot;&gt;&lt;div style=3D&quot;wo=\r\nrd-wrap: break-word; -webkit-nbsp-mode: space; -webkit-line-break: after-wh=\r\nite-space; &quot;&gt;&lt;div style=3D&quot;word-wrap: break-word; -webkit-nbsp-mode: space;=\r\n -webkit-line-break: after-white-space; &quot;&gt;&lt;div style=3D&quot;word-wrap: break-wo=\r\nrd; -webkit-nbsp-mode: space; -webkit-line-break: after-white-space; &quot;&gt;&lt;div=\r\n style=3D&quot;word-wrap: break-word; -webkit-nbsp-mode: space; -webkit-line-bre=\r\nak: after-white-space; &quot;&gt;&lt;div style=3D&quot;word-wrap: break-word; -webkit-nbsp-=\r\nmode: space; -webkit-line-break: after-white-space; &quot;&gt;&lt;div style=3D&quot;word-wr=\r\nap: break-word; -webkit-nbsp-mode: space; -webkit-line-break: after-white-s=\r\npace; &quot;&gt;&lt;div style=3D&quot;word-wrap: break-word; -webkit-nbsp-mode: space; -web=\r\nkit-line-break: after-white-space; &quot;&gt;&lt;div style=3D&quot;word-wrap: break-word; -=\r\nwebkit-nbsp-mode: space; -webkit-line-break: after-white-space; &quot;&gt;&lt;div styl=\r\ne=3D&quot;word-wrap: break-word; -webkit-nbsp-mode: space; -webkit-line-break: a=\r\nfter-white-space; &quot;&gt;&lt;div style=3D&quot;word-wrap: break-word; -webkit-nbsp-mode:=\r\n space; -webkit-line-break: after-white-space; &quot;&gt;&lt;span class=3D&quot;Apple-style=\r\n-span&quot; style=3D&quot;border-collapse: separate; border-spacing: 0px; &quot;&gt;&lt;div styl=\r\ne=3D&quot;word-wrap: break-word; -webkit-nbsp-mode: space; -webkit-line-break: a=\r\nfter-white-space; &quot;&gt;&lt;span class=3D&quot;Apple-style-span&quot; style=3D&quot;border-collap=\r\nse: separate; border-spacing: 0px; &quot;&gt;&lt;div style=3D&quot;word-wrap: break-word; -=\r\nwebkit-nbsp-mode: space; -webkit-line-break: after-white-space; &quot;&gt;&lt;span cla=\r\nss=3D&quot;Apple-style-span&quot; style=3D&quot;border-collapse: separate; border-spacing:=\r\n 0px; &quot;&gt;&lt;div style=3D&quot;word-wrap: break-word; -webkit-nbsp-mode: space; -web=\r\nkit-line-break: after-white-space; &quot;&gt;&lt;span class=3D&quot;Apple-style-span&quot; style=\r\n=3D&quot;border-collapse: separate; border-spacing: 0px; &quot;&gt;&lt;div style=3D&quot;word-wr=\r\nap: break-word; -webkit-nbsp-mode: space; -webkit-line-break: after-white-s=\r\npace; &quot;&gt;Best regards,&lt;br&gt;&lt;font class=3D&quot;Apple-style-span&quot; color=3D&quot;#0a5d19&quot;=\r\n&gt;&lt;b&gt;Jeff Clune&lt;/b&gt;&lt;/font&gt;&lt;br&gt;&lt;br&gt;Assistant Professor&lt;br&gt;Computer Science&lt;/d=\r\niv&gt;&lt;div style=3D&quot;word-wrap: break-word; -webkit-nbsp-mode: space; -webkit-l=\r\nine-break: after-white-space; &quot;&gt;University of Wyoming&lt;br&gt;&lt;a href=3D&quot;mailto:=\r\njeffclune@...&quot;&gt;jeffclune@...&lt;/a&gt;&lt;br&gt;jeffclune.com&lt;/div&gt;&lt;div&gt;&lt;br&gt;&lt;=\r\n/div&gt;&lt;/span&gt;&lt;/div&gt;&lt;/span&gt;&lt;/div&gt;&lt;/span&gt;&lt;/div&gt;&lt;/span&gt;&lt;/div&gt;&lt;/div&gt;&lt;/div&gt;&lt;/div&gt;=\r\n&lt;/div&gt;&lt;/div&gt;&lt;/div&gt;&lt;/div&gt;&lt;/div&gt;&lt;/div&gt;&lt;/span&gt;&lt;/div&gt;&lt;/div&gt;&lt;br&gt;&lt;blockquote type=\r\n=3D&quot;cite&quot;&gt;&lt;div style=3D&quot;background-color: rgb(255, 255, 255); position: sta=\r\ntic; z-index: auto; &quot;&gt;&lt;div id=3D&quot;ygrp-mlmsg&quot; style=3D&quot;position:relative;&quot;&gt;&lt;=\r\ndiv id=3D&quot;ygrp-msg&quot; style=3D&quot;z-index: 1;&quot;&gt;&lt;div id=3D&quot;ygrp-text&quot;&gt;&lt;p&gt;\n--- In =\r\n&lt;a href=3D&quot;mailto:neat%40yahoogroups.com&quot;&gt;neat@yahoogroups.com&lt;/a&gt;, &quot;Ken&quot; &=\r\nlt;kstanley@...&gt; wrote:&lt;br&gt;\n&gt;&lt;br&gt;\n&gt; &lt;br&gt;\n&gt; &lt;br&gt;\n&gt; Hi JBM, th=\r\nanks for getting deeper into this fascinating issue of how we can be confid=\r\nent that a paper has strong results.  I hope you don&#39;t mind that I changed =\r\nthe subject line to make this thread easier to find in the future.&lt;br&gt;\n&gt;=\r\n &lt;br&gt;\n&gt; I think we all broadly agree that there is no single formula for=\r\n a good paper and you and Jeff are arguing more about matters of degree.  I=\r\n am very interested in this subject as you know and I think it merits a lot=\r\n more attention than it usually gets, which is one reason I&#39;m glad you got =\r\ndeeper into it.  So here I want to add some more weight to the case for qua=\r\nlitative papers.  I should warn everyone up front that I took this opportun=\r\nity basically to write an essay, so this is a long post full of my thoughts=\r\n on this issue.&lt;br&gt;\n&gt; &lt;br&gt;\n&gt; I believe most people in our field would=\r\n agree with JBM&#39;s assertion that there is &quot;a strong correlation between wea=\r\nk papers and papers without strong quantitative results.&quot;&lt;br&gt;\n&gt; &lt;br&gt;\n&gt=\r\n; I want to question that assumption because I do not believe it is true ev=\r\nen though it is widely assumed to be true and in fact is perhaps the engine=\r\n behind the entire reviewing philosophy in AI.  In fact, this issue of how =\r\nscience should progress is ultimately not a scientific issue but a philosop=\r\nhical issue.  That is, when you begin to discuss which kinds of results are=\r\n most useful for future progress, it is a meta-discussion about how science=\r\n progresses.  Paul Feyerabend, who was a kind of radical philosopher of sci=\r\nence, has a really nice quote on this issue that I find inspirational: &lt;br&gt;=\r\n\n&gt; &lt;br&gt;\n&gt; &quot;To those who look at the rich material provided by history=\r\n, and who are not intent on impoverishing it in order to please their lower=\r\n instincts, their craving for intellectual security in the form of clarity,=\r\n precision, &#39;objectivity&#39;, &#39;truth&#39;, it will become clear that there is only=\r\n one principle that can be defended under all circumstances and in all stag=\r\nes of human development. It is the principle: anything goes.&quot; &lt;br&gt;\n&gt; Aga=\r\ninst Method: Outline of an Anarchistic Theory of Knowledge (1975)&lt;br&gt;\n&gt; =\r\n&lt;br&gt;\n&gt; My personal experience fits very well with this idea.  There will=\r\n be times in history where quantification is what we need, and other times =\r\nwhen it is the last thing we need.  And I believe the worship of quantifica=\r\ntion has recently, at this point in the history of our field, been mostly a=\r\nn obstacle to progress put in place by those &quot;craving for intellectual secu=\r\nrity,&quot; as Feyerabend puts it.  But insecurity is not a good foundation for =\r\nthe building of wisdom because exploration requires courage and a willingne=\r\nss to confront ambiguity.  Quantification at this time in AI is largely an =\r\nattempt to escape from ambiguity, and thereby becomes a form of deception.&lt;=\r\nbr&gt;\n&gt; &lt;br&gt;\n&gt; Consider what I have called the &quot;objective paradox&quot;: oft=\r\nen if you measure the ability of a method or encoding in EC to achieve a sp=\r\necific objective, your conclusions about what that method can achieve in ge=\r\nneral will be entirely skewed and misleading.  Target-based benchmarks, rat=\r\nher than giving confidence, are causing us to miss the forest for the trees=\r\n.  Think how in my paper with Brian Woolley (&lt;a href=3D&quot;http://eplex.cs.ucf=\r\n.edu/publications/2011/woolley-gecco11&quot;&gt;http://eplex.cs.ucf.edu/publication=\r\ns/2011/woolley-gecco11&lt;/a&gt;) we could not re-evolve many images on Picbreede=\r\nr with NEAT and CPPNs (which are the very methods behind Picbreeder).  So i=\r\nn the quantitative world we would conclude that CPPNs cannot evolve such im=\r\nages.  And in fact results of this sort (showing method X cannot solve prob=\r\nlem A) are published all the time, and almost entirely misleading.  &lt;br&gt;\n&g=\r\nt; \t&lt;br&gt;\n&gt; They are also the basis of highly deceptive comparisons betwe=\r\nen method X and Y.  We like to say if method X &quot;performs significantly bett=\r\ner&quot; than method Y on task A then method X is somehow &quot;better.&quot;  But the tru=\r\nth is that often the ability of an encoding to evolve to a specific target =\r\nis a bad sign for its ability to ever produce anything interesting.  Think =\r\nabout direct encodings:  they will always win on low-dimensional target-mat=\r\nching problems but are a dead end for evolving anything truly complex.  We =\r\nare fooling ourselves with quantification.&lt;br&gt;\n&gt; &lt;br&gt;\n&gt; Even people w=\r\nho are aware of Woolley&#39;s result and agree with our conclusions *still* pub=\r\nlish this kind of result because our culture is so deeply entrenched in thi=\r\ns kind of quantification that we simply have no idea what else to do.  If w=\r\ne were willing to truly embrace the absurdity of this kind of analysis, som=\r\neone would have the courage to proclaim that DNA is incapable of evolving h=\r\numans (which were of course never set as the objective of evolution).  Afte=\r\nr all, if humans were set as objective targets for evolution from the start=\r\n, there would be no humans.  &lt;br&gt;\n&gt; &lt;br&gt;\n&gt; How many of us have tried =\r\nto test method X on objective A and found method X wanting and then publish=\r\ned the result?  And how many such papers would you consider &quot;strong?&quot;  Our =\r\nculture of worshipping quantification has often led us astray on the real p=\r\nower of evolution and the potential of different encodings.  If intuition t=\r\nrumped quantification (a heretical suggestion) this fundamental confusion w=\r\nould not have arisen so severely.&lt;br&gt;\n&gt; &lt;br&gt;\n&gt; Now I want to look at =\r\nthis issue from the opposite direction, where my own experience has been mu=\r\nch more positive: how qualitative observations often lead to unexpected lea=\r\nps of insight in a way quantitative results rarely have for me.  In fact, a=\r\nlmost every idea in which I have been involved is the result of a qualitati=\r\nve observation, exactly the kind that worshipers of quantification seem to =\r\nwant to prevent us from publishing and sharing with each other.  &lt;br&gt;\n&gt; =\r\n&lt;br&gt;\n&gt; For example, before I thought of NEAT I read dozens of neuroevolu=\r\ntion papers (this was in the Fall of 1999).  There were tons of quantitativ=\r\ne results and comparisons, but at the end of four months of reading all thi=\r\ns literature, I did not remember any of the quantitative results.  Instead,=\r\n what was left with me was a &quot;feeling&quot; that something qualitative was missi=\r\nng:  Regardless of performance, none of these methods had the feel of natur=\r\ne when it came to the tendency for complexity to increase elegantly and ind=\r\nefinitely.  And that is where the inspiration for NEAT began, by ignoring q=\r\nuantitative results.  If I had followed them, I would simply have built upo=\r\nn the &quot;best&quot; neuroevolution method of the time, which had been my original =\r\nplan, having been brought up too in the culture of quantification.  So then=\r\n there would be no NEAT.&lt;br&gt;\n&gt; &lt;br&gt;\n&gt; My idea for CPPNs was also from=\r\n an entirely qualitative observation.  It actually came before Picbreeder. =\r\n The main insight was actually from evolving a spaceship image in Mattias F=\r\nagerlund&#39;s old NEAT-based Genetic Art program.  The experience of evolving =\r\nthe spaceship was so exciting to me at the time that I put up a whole websi=\r\nte on it: &lt;a href=3D&quot;http://www.cs.utexas.edu/users/kstanley/rocket.html&quot;&gt;h=\r\nttp://www.cs.utexas.edu/users/kstanley/rocket.html&lt;/a&gt;  &lt;br&gt;\n&gt; &lt;br&gt;\n&gt;=\r\n There was not a single quantitative result, but I was convinced that I had=\r\n seen something, qualitatively, that resonated with nature.  It was that qu=\r\nalitative feeling, that recognition of something deep in the results, that =\r\nled to CPPNs.  It was a couple years later that the whole theory solidified=\r\n and I wrote the journal article on CPPNS: &lt;a href=3D&quot;http://eplex.cs.ucf.e=\r\ndu/publications/2007/stanley-gpem07&quot;&gt;http://eplex.cs.ucf.edu/publications/2=\r\n007/stanley-gpem07&lt;/a&gt;&lt;br&gt;\n&gt; &lt;br&gt;\n&gt; One interesting thing about that =\r\nCPPN journal article is that it is almost entirely qualitative.  As you can=\r\n imagine, that posed problems for review, but I was determined not to pollu=\r\nte it with meaningless quantification. For me, the images speak for themsel=\r\nves.&lt;br&gt;\n&gt; &lt;br&gt;\n&gt; Those observations on CPPNs and their resulting sym=\r\nmetries and regularities are also what led to David D&#39;Ambrosio, Jason Gauci=\r\n and myself creating HyperNEAT - again, the inspiration for the idea was no=\r\nt any quantitative demonstration of anything.  &lt;br&gt;\n&gt; &lt;br&gt;\n&gt; And fina=\r\nlly, as some of you know, novelty search itself was not inspired by a quant=\r\nitative result.  Rather, it comes *again* from evolving pictures - in this =\r\ncase it was my experience of evolving the Picbreeder Car: &lt;a href=3D&quot;http:/=\r\n/picbreeder.org/search/showgenome.php?sid=3D464&quot;&gt;picbreeder.org/search/show=\r\ngenome.php?sid=3D464&lt;/a&gt;&lt;br&gt;\n&gt; What shocked me from the experience of ev=\r\nolving the car was that I had not been trying to evolve a car.  I could not=\r\n stop thinking about that, about how I did something really hard (from a qu=\r\nalitative perspective) by not trying to do it.  I later noticed that almost=\r\n every interesting image on the site has the same strange story.  I discuss=\r\ned the implications of these observations with Joel Lehman, which led us bo=\r\nth to novelty search.&lt;br&gt;\n&gt; &lt;br&gt;\n&gt; Now someone could argue that these=\r\n ideas may all turn out &quot;weak&quot; in the end.  But that would be a strange phi=\r\nlosophy of science; it would suggest that we should never have explored dow=\r\nn these roads in the first place.  Of course we cannot know where any road =\r\nleads until we take it - and I think at least it&#39;s clear these were roads w=\r\north exploring though no one can say they lead ultimately to the greatest t=\r\nruths.  But it&#39;s still worth the lessons along the way.  &lt;br&gt;\n&gt; &lt;br&gt;\n&gt=\r\n; Someone might also think, okay, your inspirations may have been qualitati=\r\nve but your *results* were mainly quantitative, and somehow that&#39;s what mat=\r\nters (though recall the CPPN paper does not have quantitative results).  As=\r\n JBM points out, our novelty search paper did have quantitative results tha=\r\nt ultimately convinced him something interesting was going on.  But I think=\r\n again the focus here on &quot;results&quot; misses the forest for the trees.  What i=\r\ns more important for the progress of science than the results is the *inspi=\r\nration* that leads to the ideas that produced the results.  If the inspirat=\r\nion is withheld, if I cannot share with you the analogue of the spaceship o=\r\nr the car in the future, then you can never draw from those inspirations to=\r\n find new roads for us to travel.  The kind of science that I believe JBM a=\r\nnd many others idealize cuts out all the inspiration from the public sphere=\r\n and leaves us only to share its fruits when someone is lucky enough in pri=\r\nvate to see something interesting (and try to quantify it then).&lt;br&gt;\n&gt; &lt;=\r\nbr&gt;\n&gt; Nevertheless, JBM says, &quot;I think that it is much harder to write a=\r\n convincing paper without any quantitative test than with the help of measu=\r\nres/comparisons/etc.&quot;  Again, many would share this sentiment.  But if you =\r\nthink about it, what exactly do we need to be &quot;convinced&quot; of?  Why do we th=\r\nink science (or AI especially) is about convincing someone of something?  W=\r\nhy do we need e.g. 30 strangers to validate an intuition we already feel de=\r\neply that something is interesting?  The links in the chain of progress are=\r\n from inspiration, not from convincing.  There are many ideas that are neit=\r\nher right nor wrong anyway, but worth exploring because they will lead us t=\r\no new revelations.  To me, capturing the essence of nature is as much about=\r\n a feeling as it is about a result.  And my experience in practice bears th=\r\nat out.&lt;br&gt;\n&gt; &lt;br&gt;\n&gt; Here is where I want to return to the intellectu=\r\nal insecurity that Feyerabend raises.  I think our quantitative culture all=\r\n boils down to this problem of insecurity.  We do not trust ourselves to ha=\r\nve valid intuitions.  We dismiss our own ability to think, as with JBM&#39;s to=\r\nngue-in-cheeck parody, &quot;look, cool simulated robots.&quot;  But I want to questi=\r\non why we are so insecure in our own qualitative judgments?  &lt;br&gt;\n&gt; &lt;br&gt;=\r\n\n&gt; For those of us with PhDs, our countries invested something like 25 y=\r\nears into our education.  Shouldn&#39;t someone who supposedly succeeded in jum=\r\nping through intellectual hoop after hoop after hoop - eventually impressin=\r\ng their peers enough to be hired, even eventually to be tenured or promoted=\r\n - be able to think for themselves sufficiently to decide whether the &quot;cool=\r\n robots&quot; are worth sharing with other scientists because they might inspire=\r\n new ideas?  If we are really entirely unqualified after all those years of=\r\n supposedly learning to be a scientist, then what was the use of all that p=\r\nublic investment?  Was it simply to validate that we are able to check p-va=\r\nlues that someone else reports in an X vs. Y quantitative comparison?  That=\r\n&#39;s all we&#39;re qualified to do?  Why do we deny our intellectual curiosity an=\r\nd ability to think for ourselves?  &lt;br&gt;\n&gt; &lt;br&gt;\n&gt; You may think it can=\r\n&#39;t be done.  Maybe you think my personal experience with NEAT, CPPNs, Hyper=\r\nNEAT, novelty search, etc. is some kind of fluke that doesn&#39;t really repres=\r\nent science and how it works.  Maybe you think that kind of qualitative app=\r\nroach may work for Ken for some reason but it can&#39;t work in general.  But w=\r\nhy would that be?  Isn&#39;t it possible that we are all prematurely discrediti=\r\nng our intellectual potential to think for ourselves?  We have created a cu=\r\nlture in which the spaceships and cars of science must be hidden, buried un=\r\ntil their discoverers figure out (or give up figuring out) their deeper imp=\r\nlications.  I do not support publishing a paper simply because of some &quot;coo=\r\nl robots,&quot; but I do support qualified scientists deciding for themselves, f=\r\nrom their experience and intuitions, whether those cool robots might be the=\r\n seed of an important chain of ideas.  And I do not want those cool robots =\r\nhidden from me as a reader of scientific literature if they might be such a=\r\n seed.  When I looked at Jeff&#39;s recent video of his cool robots, I could fe=\r\nel those wheels of intuition turning in my mind.  I still don&#39;t know if it =\r\nleads to anything, but I don&#39;t need any quantification to know that that fe=\r\neling is more than enough to justify publishing that paper, and I&#39;m gratefu=\r\nl he and his coauthors did not try to obfuscate it with a veil of needless =\r\nquantification.&lt;br&gt;\n&gt; &lt;br&gt;\n&gt; Best,&lt;br&gt;\n&gt; &lt;br&gt;\n&gt; ken&lt;br&gt;\n&lt;br&gt;\n&lt;/=\r\np&gt;\n\n    &lt;/div&gt;\n     \n\n    \n\n&lt;/div&gt;\n\n\n\n&lt;!-- end group email --&gt;\n\n&lt;/blockquot=\r\ne&gt;&lt;/div&gt;&lt;br&gt;&lt;/span&gt;&lt;/body&gt;&lt;/html&gt;\n\r\n--Apple-Mail=_FC631B49-9DF7-402D-990C-BF721EEE2192--\r\n\n"}}