{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[{"name":"READ"}]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"userId":464818732,"authorName":"Jeff Clune","from":"Jeff Clune &lt;jclune@...&gt;","profile":"jeffreyclune","replyTo":"LIST","senderId":"uR5BAM5OH9M8DyIU4W9MzRDc7J4M9wpi3EZ8DUdHXPV6UJQhkg4NP89yT_xHKkI1twCFmO2BDrmvw_g9p1rJghAc0_o","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [neat] Quantitative vs. Qualitative Results","postDate":"1370274259","msgId":6120,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDA4RTczRTAxLThBQjAtNEQzMy05MTRCLUY2RjAzQTEwMjcyM0BnbWFpbC5jb20+","inReplyToHeader":"PGtvZ2pyZys2c3JwQGVHcm91cHMuY29tPg==","referencesHeader":"PGtvZ2pyZys2c3JwQGVHcm91cHMuY29tPg=="},"prevInTopic":6119,"nextInTopic":6121,"prevInTime":6119,"nextInTime":6121,"topicId":6038,"numMessagesInTopic":46,"msgSnippet":"Hi Randy, ... I m not sure why you are assuming that all qualitative results are proof-of-concepts. I do think many proof-of-concepts are interesting (Ken","rawEmail":"Return-Path: &lt;jclune@...&gt;\r\nX-Sender: jclune@...\r\nX-Apparently-To: neat@yahoogroups.com\r\nX-Received: (qmail 14138 invoked by uid 102); 3 Jun 2013 15:47:21 -0000\r\nX-Received: from unknown (HELO mtaq3.grp.bf1.yahoo.com) (10.193.84.142)\n  by m1.grp.bf1.yahoo.com with SMTP; 3 Jun 2013 15:47:21 -0000\r\nX-Received: (qmail 13321 invoked from network); 3 Jun 2013 15:47:21 -0000\r\nX-Received: from unknown (HELO mail-wg0-f54.google.com) (74.125.82.54)\n  by mtaq3.grp.bf1.yahoo.com with SMTP; 3 Jun 2013 15:47:21 -0000\r\nX-Received: by mail-wg0-f54.google.com with SMTP id j13so3339175wgh.33\n        for &lt;neat@yahoogroups.com&gt;; Mon, 03 Jun 2013 08:47:21 -0700 (PDT)\r\nX-Received: by 10.180.89.140 with SMTP id bo12mr13671760wib.22.1370274441011;\n        Mon, 03 Jun 2013 08:47:21 -0700 (PDT)\r\nReturn-Path: &lt;jclune@...&gt;\r\nX-Received: from [10.128.155.52] ([94.116.222.92])\n        by mx.google.com with ESMTPSA id ca19sm24283231wib.3.2013.06.03.08.47.14\n        for &lt;neat@yahoogroups.com&gt;\n        (version=TLSv1 cipher=ECDHE-RSA-RC4-SHA bits=128/128);\n        Mon, 03 Jun 2013 08:47:16 -0700 (PDT)\r\nContent-Type: multipart/alternative; boundary=&quot;Apple-Mail=_AA8AE529-53AE-4091-8367-751C7E7CBE57&quot;\r\nMessage-Id: &lt;08E73E01-8AB0-4D33-914B-F6F03A102723@...&gt;\r\nMime-Version: 1.0 (Mac OS X Mail 6.3 &#92;(1503&#92;))\r\nDate: Mon, 3 Jun 2013 16:44:19 +0100\r\nReferences: &lt;kogjrg+6srp@...&gt;\r\nTo: neat@yahoogroups.com\r\nIn-Reply-To: &lt;kogjrg+6srp@...&gt;\r\nX-Mailer: Apple Mail (2.1503)\r\nX-eGroups-Msg-Info: 1:12:0:0:0\r\nFrom: Jeff Clune &lt;jclune@...&gt;\r\nSubject: Re: [neat] Quantitative vs. Qualitative Results\r\nX-Yahoo-Group-Post: member; u=464818732; y=vP04MhXdOLhzkL1a5noKGsM9_WbdNSHk5jh2XuHQ9gh7ZTTICbR8\r\nX-Yahoo-Profile: jeffreyclune\r\n\r\n\r\n--Apple-Mail=_AA8AE529-53AE-4091-8367-751C7E7CBE57\r\nContent-Transfer-Encoding: quoted-printable\r\nContent-Type: text/plain;\n\tcharset=windows-1252\r\n\r\nHi Randy,\n\n&gt; If we can&#39;t quantify what we&#39;re trying to show, then what are =\r\nwe really showing? At that point, it&#39;s more of a proof of concept (&quot;hey loo=\r\nk! this works in my model!&quot;) than a contribution to scientific knowledge. P=\r\nroofs of concept are great to see so people know we have it working, and ar=\r\ne best presented as a poster or late-breaking abstract. A proof of concept =\r\nby itself probably won&#39;t be enough content to properly fill a full-length p=\r\naper.\n&gt; \n&gt; \nI&#39;m not sure why you are assuming that all qualitative results =\r\nare proof-of-concepts. I do think many proof-of-concepts are interesting (K=\r\nen points out a great example in his reply to you), but the two are not equ=\r\nivalent. If I had a neural network that could paint in the style of Monet, =\r\nreliably and repeatedly, and then I changed the model in some way and it pa=\r\ninted in the style of Jackson Pollack repeatedly=85and then I changed it ag=\r\nain and it painted in the style of Van Gogh repeatedly, it wouldn&#39;t be a pr=\r\noof of concept, but it would be interesting! Likely such an experiment woul=\r\nd reveal interesting things about the model and what produces vast differen=\r\nces in artistic style. But I might not be able to quantify the &quot;monet-ness&quot;=\r\n, &quot;van gogh-ness&quot;, or &quot;pollack-ness&quot; of the output=85or even that they are =\r\ninterestingly different...I&#39;d have to rely on my human judgement to sense t=\r\nhat there is a meaningful difference between the three different outputs. \n=\r\n\n\n&gt; In the example you bring up, what does the statement, &quot;the 3D shapes pr=\r\noduced by CPPNs on EndlessForms [are] interestingly different from those pr=\r\noduced by L-Systems,&quot; actually tell us? I agree that such a statement would=\r\n be difficult to quantify because it is a hollow statement (which touches o=\r\nn my section about hypothesis construction). What about the shapes makes th=\r\nem interestingly different? What is it about the underlying architecture th=\r\nat made the shapes interestingly different? Answering those questions would=\r\n lead to a quantitative measure out of necessity.\n&gt; \n&gt; \n\nI completely disag=\r\nree with you. EndlessForms objects and Picbreeder images are less blocky an=\r\nd have more subtle, nuanced regularities than L-Systems artifacts. They als=\r\no look more natural, at least with respect to producing animal forms.  How =\r\nthe two mutate differently also reveals the evolvability of the encoding (C=\r\nPPNs accommodate more small, subtle changes while mutations to L-systems te=\r\nnd to produce huge effects cascading throughout the phenotype and dramatica=\r\nlly changing it). All of these observations tell us interesting things abou=\r\nt the difference between the encodings and their evolvability, and suggest =\r\nthat the CPPN encoding likely captures some of the power of natural encodin=\r\ngs (at least animal encodings).  \n\nWe could have an interesting conversatio=\r\nn about these observation, and someone could even defend that L-systems are=\r\n more natural (e.g. they better resemble plants), but it&#39;s not the case tha=\r\nt that conversation would be better had with numbers, or would be best sett=\r\nled by a quantitative metric. The point is that until we invent true AI wit=\r\nh similar pattern-recognition to humans, we don&#39;t have the ability to quant=\r\nify the recognition of interestingly different types of patterns even thoug=\r\nh those differences are obvious to humans. This is the same reason why &quot;mon=\r\net-ness&quot; is pretty clear to us when we see it, but we can&#39;t quantify it wel=\r\nl/easily. I should point out that I&#39;m not saying that phenomena like &quot;monet=\r\n-ness&quot; are not quantifiable in principle=85.eventually we will invent AI th=\r\nat can &quot;see&quot; the world and recognize high-dimnsional clusters (like &quot;monet-=\r\nness&quot; and &quot;pollack-ness&quot; as different things, as well as quantify &quot;naturaln=\r\ness&quot;) and at that point we probably can quantify these traits, but at prese=\r\nnt we can&#39;t do that in a way that is ultimately helpful. If you are a revie=\r\nwer and you force someone to try to quantify properties like &quot;naturalness&quot;,=\r\n &quot;monet-ness&quot;, etc., you are making things worse only in the name of claimi=\r\nng it&#39;s objective because it is quantitative. Your brain is simply better a=\r\nt some things than our algorithms, and for those domains we should use our =\r\nbrains to evaluate the results, not numbers. Doing so doesn&#39;t make the stat=\r\nements &quot;hollow&quot;, uninteresting, or unscientific. You will of course object =\r\nthat they are &quot;subjective&quot; judgements, and they are, but they are the best =\r\nwe&#39;ve got and they can still be helpful. I will agree (in line with JBM) th=\r\nat we should only accept such results when they are &quot;obvious to us&quot;, so may=\r\nbe the claim &quot;CPPNs are more natural than L-Systems&quot; should be curbed by a =\r\nreviewer, but something as obvious as &quot;they are different&quot; should not. \n\n&gt; =\r\nIn short, if a statement can&#39;t be quantified, then it probably hasn&#39;t been =\r\nrefined enough.\n&gt; \nDo you still agree with this statement after my above ex=\r\namples? Surely you agree that Jackson Pollack paints in a different style t=\r\nhan Monet, but I&#39;m guessing you also wouldn&#39;t insist on a quantitative meas=\r\nure before making that claim in a scientific publication. If you would insi=\r\nst on that, then I think you are forgetting that quantitative measures are =\r\nsupposed to be tools that help advance scientific progress, not chains that=\r\n should bind us and slow us down. \n\n&gt; &gt; But we already know the result of t=\r\nhat experiment. Ken has shown that target-based evolution doesn&#39;t work, so =\r\nthe error for target-based evolution will be non-zero (and likely large). B=\r\nut (as we mention in the paper) the error in our method can be tuned toward=\r\n zero by increasing the resolution of the workspace, so the error for the S=\r\needed-CPPN technique effectively is zero. Thus, we know ahead of time that =\r\nour method won&#39;t produce error. The only uncertainty is how bad target base=\r\nd evolution would be, but that is not the focus of this paper, so the exper=\r\niment would be off-topic. In other words, we introduce a technique that eli=\r\nminates the issue of error, since it skips right to the correct shape=85to =\r\ncompare it against an obviously bad technique that we know produces error w=\r\nould only be to satisfy reviewers that insist on quantification; it does no=\r\nt address a broader hypothesis, no?\n&gt; \n&gt; Sure, but those statements are a b=\r\nit &quot;cowboy science-y.&quot; Let me show you how those statements can (and likely=\r\n will) be translated:\n&gt; \n&gt; &quot;A single (non-reproduced?) study has suggested =\r\nthat targeted evolution does not work very well (with Picbreeder?). Our met=\r\nhod can achieve an error of zero (data not shown).\n\nWhy do you say &quot;(data n=\r\not shown)&quot;? Our paper does show with arguments and images that the error ca=\r\nn be tuned toward zero by increasing the resolution. See the Super Mario fi=\r\ngure and related text. \n\n&gt; Thus, comparing our method with targeted evoluti=\r\non is pointless.&quot;\n&gt; \n&gt; Performing such a quantitative comparison would kill=\r\n two birds with one stone: (1) it reproduces the findings that Ken made* in=\r\n a 3D domain, and (2) it would address the readers&#39; concerns related to the=\r\n goal of the paper, particularly by directly showing that your method produ=\r\nces more accurate CPPN-based representations of 3D objects than the &quot;leadin=\r\ng&quot; (only) method. For a methods paper, that is an important statement to ma=\r\nke. Thus, there is value in making a quantitative comparison here, and it&#39;s=\r\n not an arbitrary checkbox.\n&gt; \n\nIf I invented a algorithm that provided the=\r\n optimal solution to any traveling salesmen problem every time, I wouldn&#39;t =\r\nneed to spend a huge chunk of the paper comparing it to every bad optimizat=\r\nion algorithm that has been thrown at the TSP over the years because the pr=\r\noblem would be solved. It would be enough to cite those papers and say that=\r\n they don&#39;t work well, especially as the difficulty (number of cities) incr=\r\neases, and then say &quot;but now we have an entirely new method that doesn&#39;t re=\r\nquire optimization and error: you can just skip right to the solution.&quot;\n\n&gt; =\r\nIt&#39;s a really bad assumption (that many of us make) that someone will want =\r\nto follow up on our work. Yes, it&#39;s good to point out future research direc=\r\ntions from the work, but the mindset that everyone will want to follow up o=\r\nn our work can be damaging to the research field. Everyone wants to be the =\r\nthought leader and establish a &quot;new&quot; research path, and that&#39;s why we see s=\r\no many people establishing new research platforms and whatnot every year an=\r\nd talking about all the cool research that it enables. Then by the next yea=\r\nr, that platform has fallen into obscurity because no one wanted to actuall=\r\ny do that future work, and thus no one really learned anything from the pap=\r\ner introducing that research platform.\n&gt; \n\nI agree with Ken that it is fine=\r\n to talk about the exciting future work that a paper enables/suggests. But =\r\neven if you don&#39;t agree with that, what makes you conclude that I assume th=\r\nat anyone else will follow up on the work? The future work section is about=\r\n work that could be done. If those possibilities are interesting, they rema=\r\nin so even if no one follows up on them. In fact, if they are so  uninteres=\r\nting that no one would want to do them, then they certainly shouldn&#39;t be do=\r\nne and included in the original paper! It is only the work that you assume/=\r\nbelieve someone would want to do that you should talk about! Moreover, I of=\r\nten write future work sections describing the work that I find interesting =\r\nprecisely because I plan to do it. Thus, I&#39;m not assuming that someone else=\r\n will do it because I plan to do it myself. \n\n&gt; That&#39;s a big reason why I t=\r\nhink qualitative/methods/proof of concept  papers (whatever you want to cal=\r\nl them -- they&#39;re the same) are not very useful to publish as full papers, =\r\nand are better suited as a poster or late-breaking abstract.\n&gt; \n\nBy that ra=\r\ntionale you don&#39;t think the Picbreeder paper should have been published, or=\r\n Karl Sims work, is that right? The Picbreeder papers collectively have ove=\r\nr 100 citations, and Sims&#39; work arguably kickstarted/inspired the entire fi=\r\neld of artificial life and has thousands of citations. Picbreeder also visu=\r\nally demonstrates the power of CPPNs, provides an intuitive testbed for lea=\r\nrning how they work, but also taught us lessons about Evolutionary Computat=\r\nion in general; the entire idea for novelty search emerged as a result of t=\r\nhe Picbreeder system! If your attitudes for what merits a publication were =\r\nuniversal, no one would pursue this type of work because of the low value y=\r\nou place on it would mean that doing so would not help one&#39;s career, and th=\r\nus such important work would not be done. I don&#39;t really get why we would w=\r\nant to eliminate such valuable work. So much crap gets published just becau=\r\nse it has a few quantitative comparisons: I think we can spare a few paper =\r\nslots for work that is interesting, yet not quantifiable. \n\n&gt; \n&gt; &gt; I&#39;m sorr=\r\ny we didn&#39;t make it clear to you. Of course, that issue is also orthogonal =\r\nto the quantitative vs. qualitative conversation, but it is something I wou=\r\nld like to address. Can you tell me what questions you have? I&#39;d be happy t=\r\no try to answer them in this thread. If anyone reading this also has questi=\r\nons about the technique, please let me know. \n&gt; \n&gt; I think my main confusio=\r\nn is the significance of the ds input to the CPPN. How does the CPPN end up=\r\n using that input? Why is that input useful for training a CPPN to reproduc=\r\ne a predetermined 3D object?\n&gt; \n\n\nThanks for your question. \n\nThis comment =\r\nreveals that we did fail to communicate the technique, because with the See=\r\nded-CPPN technique CPPNs are not trained in any way. It&#39;s possible that thi=\r\ns misunderstanding contributes to your belief that the Seeded-CPPN techniqu=\r\ne should be compared to target-based evolution, because if we were indeed w=\r\nere *training* CPPNs to reproduce an object then it would be more reasonabl=\r\ne to require a comparison to alternate methods of training them to reproduc=\r\ne the same object (i.e. target-based evolution). Note: the technique does a=\r\nllow for *further* evolution of an arbitrary shape=85so evolutionary &quot;train=\r\ning&quot; does occur, but only after starting from the seed shape. \n\nWith the Se=\r\neded-CPPN technique, you don&#39;t train the CPPN: you inject the geometry of t=\r\nhe seed object into the CPPN via the ds (distanceToSurface) input. For each=\r\n voxel, that ds input conveys the distance between that voxel and the surfa=\r\nce of the surface (outer shell) of the target object (along with a sign ind=\r\nicating if that voxel is inside or outside the object). A CPPN recreates th=\r\ne shape by filling in all voxels inside the shape, but the technique also a=\r\nllows for warping of the object. For example, for a CPPN to increase the si=\r\nze of the target output similarly in all dimensions, it could find all voxe=\r\nls that are x centimeters away from, and outside of, the target object and =\r\nfill them (and everything inside of them) in.&quot; For a CPPN to increase the w=\r\nidth, but not the height, of an object, it could fill in the original objec=\r\nt plus any voxels x cm away in the width-dimension, etc. Or it could do mor=\r\ne complicated things based on the shape&#39;s geometry. Thus the CPPN can immed=\r\niately start from a desired pattern (in this case the shape of the object) =\r\nand then elaborate on that shape by adding/subtracting from the original de=\r\nsign, or by warping the original design. \n\nDoes that make things clear? Ple=\r\nase let me know if you still have questions. \n\nThanks again for the interes=\r\nting conversation,\nJeff\n\n\n&gt; \n&gt; Cheers,\n&gt; Randy\n&gt; \n&gt; \n\n\r\n--Apple-Mail=_AA8AE529-53AE-4091-8367-751C7E7CBE57\r\nContent-Transfer-Encoding: quoted-printable\r\nContent-Type: text/html;\n\tcharset=windows-1252\r\n\r\n&lt;html&gt;&lt;head&gt;&lt;meta http-equiv=3D&quot;Content-Type&quot; content=3D&quot;text/html charset=\r\n=3Dwindows-1252&quot;&gt;&lt;/head&gt;&lt;body style=3D&quot;word-wrap: break-word; -webkit-nbsp-=\r\nmode: space; -webkit-line-break: after-white-space; ; font-family: &#39;Times&#39;;=\r\n font-size: 14px; color: rgb( 0,  0,  0); &quot;&gt;&lt;span style=3D&quot;font-family: &#39;Ti=\r\nmes&#39;; font-size: 14px; color: rgb( 0,  0,  0)&quot;&gt;&lt;div&gt;Hi Randy,&lt;/div&gt;&lt;div&gt;&lt;br=\r\n&gt;&lt;blockquote type=3D&quot;cite&quot;&gt;&lt;div style=3D&quot;background-color: rgb(255, 255, 25=\r\n5); position: static; z-index: auto; &quot;&gt;&lt;div id=3D&quot;ygrp-mlmsg&quot; style=3D&quot;posi=\r\ntion:relative;&quot;&gt;&lt;div id=3D&quot;ygrp-msg&quot; style=3D&quot;z-index: 1;&quot;&gt;&lt;div id=3D&quot;ygrp-=\r\ntext&quot;&gt;&lt;p&gt;If we can&#39;t quantify what we&#39;re trying to show, then what are we r=\r\neally showing? At that point, it&#39;s more of a proof of concept (&quot;hey look! t=\r\nhis works in my model!&quot;) than a contribution to scientific knowledge. Proof=\r\ns of concept are great to see so people know we have it working, and are be=\r\nst presented as a poster or late-breaking abstract. A proof of concept by i=\r\ntself probably won&#39;t be enough content to properly fill a full-length paper=\r\n.&lt;br&gt;\n&lt;br&gt;&lt;/p&gt;&lt;/div&gt;&lt;/div&gt;&lt;/div&gt;&lt;/div&gt;&lt;/blockquote&gt;&lt;div&gt;I&#39;m not sure why yo=\r\nu are assuming that all qualitative results are proof-of-concepts. I do thi=\r\nnk many proof-of-concepts are interesting (Ken points out a great example i=\r\nn his reply to you), but the two are not equivalent.&nbsp;If I had a neural=\r\n network that could paint in the style of Monet, reliably and repeatedly, a=\r\nnd then I changed the model in some way and it painted in the style of Jack=\r\nson Pollack repeatedly=85and then I changed it again and it painted in the =\r\nstyle of Van Gogh repeatedly, it wouldn&#39;t be a proof of concept, but it wou=\r\nld be interesting! Likely such an experiment would reveal interesting thing=\r\ns about the model and what produces vast differences in artistic style. But=\r\n I might not be able to quantify the &quot;monet-ness&quot;, &quot;van gogh-ness&quot;, or &quot;pol=\r\nlack-ness&quot; of the output=85or even that they are interestingly different...=\r\nI&#39;d have to rely on my human judgement to sense that there is a meaningful =\r\ndifference between the three different outputs.&nbsp;&lt;/div&gt;&lt;div&gt;&lt;br&gt;&lt;/div&gt;&lt;=\r\ndiv&gt;&lt;br&gt;&lt;/div&gt;&lt;blockquote type=3D&quot;cite&quot;&gt;&lt;div style=3D&quot;background-color: rgb=\r\n(255, 255, 255); position: static; z-index: auto; &quot;&gt;&lt;div id=3D&quot;ygrp-mlmsg&quot; =\r\nstyle=3D&quot;position:relative;&quot;&gt;&lt;div id=3D&quot;ygrp-msg&quot; style=3D&quot;z-index: 1;&quot;&gt;&lt;di=\r\nv id=3D&quot;ygrp-text&quot;&gt;&lt;p&gt;\nIn the example you bring up, what does the statement=\r\n, &quot;the 3D shapes produced by CPPNs on EndlessForms [are] interestingly diff=\r\nerent from those produced by L-Systems,&quot; actually tell us? I agree that suc=\r\nh a statement would be difficult to quantify because it is a hollow stateme=\r\nnt (which touches on my section about hypothesis construction). What about =\r\nthe shapes makes them interestingly different? What is it about the underly=\r\ning architecture that made the shapes interestingly different? Answering th=\r\nose questions would lead to a quantitative measure out of necessity.&lt;br&gt;\n&lt;b=\r\nr&gt;&lt;/p&gt;&lt;/div&gt;&lt;/div&gt;&lt;/div&gt;&lt;/div&gt;&lt;/blockquote&gt;&lt;div&gt;&lt;br&gt;&lt;/div&gt;&lt;div&gt;I completely=\r\n disagree with you. EndlessForms&nbsp;objects&nbsp;and Picbreeder images ar=\r\ne less blocky and have more subtle, nuanced regularities than L-Systems art=\r\nifacts. They also look more natural, at least with respect to producing ani=\r\nmal forms. &nbsp;How the two mutate differently also reveals the evolvabili=\r\nty of the encoding (CPPNs accommodate more small, subtle changes while muta=\r\ntions to L-systems tend to produce huge effects cascading throughout the ph=\r\nenotype and dramatically changing it). All of these observations tell us in=\r\nteresting things about the difference between the encodings and their evolv=\r\nability, and suggest that&nbsp;the CPPN encoding likely captures some of th=\r\ne power of natural encodings (at least animal encodings).&nbsp;&nbsp;&lt;/div&gt;=\r\n&lt;div&gt;&lt;br&gt;&lt;/div&gt;&lt;div&gt;We could have an interesting conversation about these o=\r\nbservation, and someone could even defend that L-systems are more natural (=\r\ne.g. they better resemble plants), but it&#39;s not the case that that conversa=\r\ntion would be better had with numbers, or would be best settled by a quanti=\r\ntative metric. The point is that until we invent true AI with similar patte=\r\nrn-recognition to humans, we don&#39;t have the ability to quantify the recogni=\r\ntion of interestingly different types of patterns even though those differe=\r\nnces are obvious to humans. This is the same reason why &quot;monet-ness&quot; is pre=\r\ntty clear to us when we see it, but we can&#39;t quantify it well/easily. I sho=\r\nuld point out that I&#39;m not saying that phenomena like &quot;monet-ness&quot; are not =\r\nquantifiable in principle=85.eventually we will invent AI that can &quot;see&quot; th=\r\ne world and recognize high-dimnsional clusters (like &quot;monet-ness&quot; and &quot;poll=\r\nack-ness&quot; as different things, as well as quantify &quot;naturalness&quot;) and at th=\r\nat point we probably can quantify these traits, but at present we can&#39;t do =\r\nthat in a way that is ultimately helpful. If you are a reviewer and you for=\r\nce someone to try to quantify properties like &quot;naturalness&quot;, &quot;monet-ness&quot;, =\r\netc., you are making things worse only in the name of claiming it&#39;s objecti=\r\nve because it is quantitative. Your brain is simply better at some things t=\r\nhan our algorithms, and for those domains we should use our brains to evalu=\r\nate the results, not numbers. Doing so doesn&#39;t make the statements &quot;hollow&quot;=\r\n, uninteresting, or unscientific. You will of course object that they are &quot;=\r\nsubjective&quot; judgements, and they are, but they are the best we&#39;ve got and t=\r\nhey can still be helpful. I will agree (in line with JBM) that we should on=\r\nly accept such results when they are &quot;obvious to us&quot;, so maybe the claim &quot;C=\r\nPPNs are more natural than L-Systems&quot; should be curbed by a reviewer, but s=\r\nomething as obvious as &quot;they are different&quot; should not.&nbsp;&lt;/div&gt;&lt;div&gt;&lt;br=\r\n&gt;&lt;/div&gt;&lt;blockquote type=3D&quot;cite&quot;&gt;&lt;div style=3D&quot;background-color: rgb(255, 2=\r\n55, 255); position: static; z-index: auto; &quot;&gt;&lt;div id=3D&quot;ygrp-mlmsg&quot; style=\r\n=3D&quot;position:relative;&quot;&gt;&lt;div id=3D&quot;ygrp-msg&quot; style=3D&quot;z-index: 1;&quot;&gt;&lt;div id=\r\n=3D&quot;ygrp-text&quot;&gt;&lt;p&gt;\nIn short, if a statement can&#39;t be quantified, then it pr=\r\nobably hasn&#39;t been refined enough.&lt;br&gt;&lt;/p&gt;&lt;/div&gt;&lt;/div&gt;&lt;/div&gt;&lt;/div&gt;&lt;/blockqu=\r\note&gt;&lt;div&gt;Do you still agree with this statement after my above examples? Su=\r\nrely you agree that Jackson Pollack paints in a different style than Monet,=\r\n but I&#39;m guessing you also wouldn&#39;t insist on a quantitative measure before=\r\n making that claim in a scientific publication. If you would insist on that=\r\n, then I think you are forgetting that quantitative measures are supposed t=\r\no be tools that help advance scientific progress, not chains that should bi=\r\nnd us and slow us down.&nbsp;&lt;/div&gt;&lt;div&gt;&lt;br&gt;&lt;/div&gt;&lt;div&gt;&lt;blockquote type=3D&quot;=\r\ncite&quot;&gt;&lt;div style=3D&quot;background-color: rgb(255, 255, 255); position: static;=\r\n z-index: auto; &quot;&gt;&lt;div id=3D&quot;ygrp-mlmsg&quot; style=3D&quot;position: relative; &quot;&gt;&lt;di=\r\nv id=3D&quot;ygrp-msg&quot; style=3D&quot;z-index: 1; &quot;&gt;&lt;div id=3D&quot;ygrp-text&quot;&gt;&lt;div&gt;&gt; Bu=\r\nt we already know the result of that experiment. Ken has shown that target-=\r\nbased evolution doesn&#39;t work, so the error for target-based evolution will =\r\nbe non-zero (and likely large). But (as we mention in the paper) the error =\r\nin our method can be tuned toward zero by increasing the resolution of the =\r\nworkspace, so the error for the Seeded-CPPN technique effectively is zero. =\r\nThus, we know ahead of time that our method won&#39;t produce error. The only u=\r\nncertainty is how bad target based evolution would be, but that is not the =\r\nfocus of this paper, so the experiment would be off-topic. In other words, =\r\nwe introduce a technique that eliminates the issue of error, since it skips=\r\n right to the correct shape=85to compare it against an obviously bad techni=\r\nque that we know produces error would only be to satisfy reviewers that ins=\r\nist on quantification; it does not address a broader hypothesis, no?&lt;br&gt;&lt;br=\r\n&gt;Sure, but those statements are a bit &quot;cowboy science-y.&quot; Let me show you h=\r\now those statements can (and likely will) be translated:&lt;/div&gt;&lt;div&gt;&lt;br&gt;&lt;/di=\r\nv&gt;&lt;div&gt;&quot;A single (non-reproduced?) study has suggested that targeted evolut=\r\nion does not work very well (with Picbreeder?). Our method can achieve an e=\r\nrror of zero (data not shown). &lt;/div&gt;&lt;/div&gt;&lt;/div&gt;&lt;/div&gt;&lt;/div&gt;&lt;/blockquote&gt;&lt;=\r\ndiv&gt;&lt;br&gt;&lt;/div&gt;&lt;div&gt;Why do you say &quot;(data not shown)&quot;? Our paper does show w=\r\nith arguments and images that the error can be tuned toward zero by increas=\r\ning the resolution. See the Super Mario figure and related text.&nbsp;&lt;/div=\r\n&gt;&lt;br&gt;&lt;blockquote type=3D&quot;cite&quot;&gt;&lt;div style=3D&quot;background-color: rgb(255, 255=\r\n, 255); position: static; z-index: auto; &quot;&gt;&lt;div id=3D&quot;ygrp-mlmsg&quot; style=3D&quot;=\r\nposition: relative; &quot;&gt;&lt;div id=3D&quot;ygrp-msg&quot; style=3D&quot;z-index: 1; &quot;&gt;&lt;div id=\r\n=3D&quot;ygrp-text&quot;&gt;&lt;div&gt;Thus, comparing our method with targeted evolution is p=\r\nointless.&quot;&lt;/div&gt;&lt;div&gt;&lt;br&gt;&lt;/div&gt;&lt;div&gt;Performing such a quantitative comparis=\r\non would kill two birds with one stone: (1) it reproduces the findings that=\r\n Ken made* in a 3D domain, and (2) it would address the readers&#39; concerns r=\r\nelated to the goal of the paper, particularly by directly showing that your=\r\n method produces more accurate CPPN-based representations of 3D objects tha=\r\nn the &quot;leading&quot; (only) method. For a methods paper, that is an important st=\r\natement to make. Thus, there is value in making a quantitative comparison h=\r\nere, and it&#39;s not an arbitrary checkbox.&lt;/div&gt;&lt;div&gt;&lt;br&gt;&lt;/div&gt;&lt;/div&gt;&lt;/div&gt;&lt;/=\r\ndiv&gt;&lt;/div&gt;&lt;/blockquote&gt;&lt;div&gt;&lt;br&gt;&lt;/div&gt;&lt;div&gt;If I invented a algorithm that p=\r\nrovided the optimal solution to any traveling salesmen problem every time, =\r\nI wouldn&#39;t need to spend a huge chunk of the paper comparing it to every ba=\r\nd optimization algorithm that has been thrown at the TSP over the years bec=\r\nause the problem would be solved. It would be enough to cite those papers a=\r\nnd say that they don&#39;t work well, especially as the difficulty (number of c=\r\nities) increases, and then say &quot;but now we have an entirely new method that=\r\n doesn&#39;t require optimization and error: you can just skip right to the sol=\r\nution.&quot;&lt;/div&gt;&lt;div&gt;&lt;br&gt;&lt;/div&gt;&lt;blockquote type=3D&quot;cite&quot;&gt;&lt;div style=3D&quot;backgro=\r\nund-color: rgb(255, 255, 255); position: static; z-index: auto; &quot;&gt;&lt;div id=\r\n=3D&quot;ygrp-mlmsg&quot; style=3D&quot;position: relative; &quot;&gt;&lt;div id=3D&quot;ygrp-msg&quot; style=\r\n=3D&quot;z-index: 1; &quot;&gt;&lt;div id=3D&quot;ygrp-text&quot;&gt;&lt;div&gt;It&#39;s a&nbsp;&lt;i&gt;really&lt;/i&gt;&nbsp=\r\n;bad assumption (that many of us make) that someone will want to follow up =\r\non our work. Yes, it&#39;s good to point out future research directions from th=\r\ne work, but the mindset that everyone will want to follow up on our work ca=\r\nn be damaging to the research field. Everyone wants to be the thought leade=\r\nr and establish a &quot;new&quot; research path, and that&#39;s why we see so many people=\r\n establishing new research platforms and whatnot every year and talking abo=\r\nut all the cool research that it enables. Then by the next year, that platf=\r\norm has fallen into obscurity because no one wanted to actually do that fut=\r\nure work, and thus no one really learned anything from the paper introducin=\r\ng that research platform.&lt;/div&gt;&lt;div&gt;&lt;br&gt;&lt;/div&gt;&lt;/div&gt;&lt;/div&gt;&lt;/div&gt;&lt;/div&gt;&lt;/blo=\r\nckquote&gt;&lt;div&gt;&lt;br&gt;&lt;/div&gt;&lt;div&gt;I agree with Ken that it is fine to talk about =\r\nthe exciting future work that a paper enables/suggests. But even if you don=\r\n&#39;t agree with that, what makes you conclude that I assume that anyone else =\r\nwill follow up on the work? The future work section is about work that coul=\r\nd be done. If those possibilities are interesting, they remain so even if n=\r\no one follows up on them. In fact, if they are so &nbsp;uninteresting that =\r\nno one would want to do them, then they certainly shouldn&#39;t be done and inc=\r\nluded in the original paper! It is only the work that you assume/believe so=\r\nmeone would want to do that you should talk about! Moreover, I often write =\r\nfuture work sections describing the work that I find interesting precisely =\r\nbecause I plan to do it. Thus, I&#39;m not assuming that someone else will do i=\r\nt because I plan to do it myself.&nbsp;&lt;/div&gt;&lt;br&gt;&lt;blockquote type=3D&quot;cite&quot;&gt;=\r\n&lt;div style=3D&quot;background-color: rgb(255, 255, 255); position: static; z-ind=\r\nex: auto; &quot;&gt;&lt;div id=3D&quot;ygrp-mlmsg&quot; style=3D&quot;position: relative; &quot;&gt;&lt;div id=\r\n=3D&quot;ygrp-msg&quot; style=3D&quot;z-index: 1; &quot;&gt;&lt;div id=3D&quot;ygrp-text&quot;&gt;&lt;div&gt;That&#39;s a bi=\r\ng reason why I think qualitative/methods/proof of concept&nbsp; papers (wha=\r\ntever you want to call them -- they&#39;re the same) are not very useful to pub=\r\nlish as full papers, and are better suited as a poster or late-breaking abs=\r\ntract.&lt;/div&gt;&lt;div&gt;&lt;br&gt;&lt;/div&gt;&lt;/div&gt;&lt;/div&gt;&lt;/div&gt;&lt;/div&gt;&lt;/blockquote&gt;&lt;div&gt;&lt;br&gt;&lt;/=\r\ndiv&gt;&lt;div&gt;By that rationale you don&#39;t think the Picbreeder paper should have=\r\n been published, or Karl Sims work, is that right? The Picbreeder papers co=\r\nllectively have over 100 citations, and Sims&#39; work arguably kickstarted/ins=\r\npired the entire field of artificial life and has thousands of citations. P=\r\nicbreeder also visually demonstrates the power of CPPNs, provides an intuit=\r\nive testbed for learning how they work, but also taught us lessons about Ev=\r\nolutionary Computation in general; the entire idea for novelty search emerg=\r\ned as a result of the Picbreeder system! If your attitudes for what merits =\r\na publication were universal, no one would pursue this type of work because=\r\n of the low value you place on it would mean that doing so would not help o=\r\nne&#39;s career, and thus such important work would not be done. I don&#39;t really=\r\n get why we would want to eliminate such valuable work. So much crap gets p=\r\nublished just because it has a few quantitative comparisons: I think we can=\r\n spare a few paper slots for work that is interesting, yet not quantifiable=\r\n.&nbsp;&lt;/div&gt;&lt;br&gt;&lt;blockquote type=3D&quot;cite&quot;&gt;&lt;div style=3D&quot;background-color: =\r\nrgb(255, 255, 255); position: static; z-index: auto; &quot;&gt;&lt;div id=3D&quot;ygrp-mlms=\r\ng&quot; style=3D&quot;position: relative; &quot;&gt;&lt;div id=3D&quot;ygrp-msg&quot; style=3D&quot;z-index: 1;=\r\n &quot;&gt;&lt;div id=3D&quot;ygrp-text&quot;&gt;&lt;div&gt;&lt;br&gt;&gt; I&#39;m sorry we didn&#39;t make it clear to=\r\n you. Of course, that issue is also orthogonal to the quantitative vs. qual=\r\nitative conversation, but it is something I would like to address. Can you =\r\ntell me what questions you have? I&#39;d be happy to try to answer them in this=\r\n thread. If anyone reading this also has questions about the technique, ple=\r\nase let me know.&nbsp;&lt;br&gt;&lt;br&gt;&lt;/div&gt;&lt;div&gt;I think my main confusion is the s=\r\nignificance of the ds input to the CPPN. How does the CPPN end up using tha=\r\nt input? Why is that input useful for training a CPPN to reproduce a predet=\r\nermined 3D object?&lt;/div&gt;&lt;div&gt;&lt;br&gt;&lt;/div&gt;&lt;/div&gt;&lt;/div&gt;&lt;/div&gt;&lt;/div&gt;&lt;/blockquote=\r\n&gt;&lt;/div&gt;&lt;div&gt;&lt;br&gt;&lt;/div&gt;&lt;div&gt;Thanks for your question.&nbsp;&lt;/div&gt;&lt;div&gt;&lt;br&gt;&lt;/=\r\ndiv&gt;&lt;div&gt;This comment reveals that we did fail to communicate the technique=\r\n, because with the Seeded-CPPN technique CPPNs are not trained in any way. =\r\nIt&#39;s possible that this misunderstanding contributes to your belief that th=\r\ne Seeded-CPPN technique should be compared to target-based evolution, becau=\r\nse if we were indeed were *training* CPPNs to reproduce an object then it w=\r\nould be more reasonable to require a comparison to alternate methods of tra=\r\nining them to reproduce the same object (i.e. target-based evolution). Note=\r\n: the technique does allow for *further* evolution of an arbitrary shape=85=\r\nso evolutionary &quot;training&quot; does occur, but only after starting from the see=\r\nd shape.&nbsp;&lt;/div&gt;&lt;div&gt;&lt;br&gt;&lt;/div&gt;&lt;div&gt;With the Seeded-CPPN technique, you=\r\n don&#39;t train the CPPN: you inject the geometry of the seed object into the =\r\nCPPN via the ds (distanceToSurface) input. For each voxel, that ds input co=\r\nnveys the distance between that voxel and the surface of the surface (outer=\r\n shell) of the target object (along with a sign indicating if that voxel is=\r\n inside or outside the object). A CPPN recreates the shape by filling in al=\r\nl voxels inside the shape, but the technique also allows for warping of the=\r\n object. For example, for a CPPN to increase the size of the target output =\r\nsimilarly in all dimensions, it could find all voxels that are x centimeter=\r\ns away from, and outside of, the target object and fill them (and everythin=\r\ng inside of them) in.&quot; For a CPPN to increase the width, but not the height=\r\n, of an object, it could fill in the original object plus any voxels x cm a=\r\nway in the width-dimension, etc. Or it could do more complicated things bas=\r\ned on the shape&#39;s geometry. Thus the CPPN can immediately start from a desi=\r\nred pattern (in this case the shape of the object) and then elaborate on th=\r\nat shape by adding/subtracting from the original design, or by warping the =\r\noriginal design.&nbsp;&lt;/div&gt;&lt;div&gt;&lt;br&gt;&lt;/div&gt;&lt;div&gt;Does that make things clear=\r\n? Please let me know if you still have questions.&nbsp;&lt;/div&gt;&lt;div&gt;&lt;br&gt;&lt;/div=\r\n&gt;&lt;div&gt;Thanks again for the interesting conversation,&lt;/div&gt;&lt;div&gt;Jeff&lt;/div&gt;&lt;d=\r\niv&gt;&lt;br&gt;&lt;/div&gt;&lt;br&gt;&lt;blockquote type=3D&quot;cite&quot;&gt;&lt;div style=3D&quot;background-color: =\r\nrgb(255, 255, 255); position: static; z-index: auto; &quot;&gt;&lt;div id=3D&quot;ygrp-mlms=\r\ng&quot; style=3D&quot;position:relative;&quot;&gt;&lt;div id=3D&quot;ygrp-msg&quot; style=3D&quot;z-index: 1;&quot;&gt;=\r\n&lt;div id=3D&quot;ygrp-text&quot;&gt;&lt;p&gt;\n&lt;br&gt;\nCheers,&lt;br&gt;\nRandy&lt;br&gt;\n&lt;br&gt;\n&lt;/p&gt;\n\n    &lt;/div&gt;\n=\r\n     \n\n    \n\n&lt;/div&gt;\n\n\n\n&lt;!-- end group email --&gt;\n\n&lt;/blockquote&gt;&lt;/div&gt;&lt;br&gt;&lt;/s=\r\npan&gt;&lt;/body&gt;&lt;/html&gt;\n\r\n--Apple-Mail=_AA8AE529-53AE-4091-8367-751C7E7CBE57--\r\n\n"}}