{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[{"name":"READ"}]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"userId":550414109,"authorName":"rhiever489","from":"&quot;rhiever489&quot; &lt;rhiever@...&gt;","profile":"rhiever489","replyTo":"LIST","senderId":"zZwSLSI_bLNGz0i68mug3e4KoO3YTQcL0vKCaQwzQOMbo77wyzlltE22mfuaSsBeR2koErS-88z_9Xc9Ds9KJYu3k7FOvTw","spamInfo":{"isSpam":false,"reason":"3"},"subject":"Re: Quantitative vs. Qualitative Results","postDate":"1370303670","msgId":6121,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGtvamFibSt2a3RxQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGtvaGpoZitjbW0zQGVHcm91cHMuY29tPg=="},"prevInTopic":6120,"nextInTopic":6122,"prevInTime":6120,"nextInTime":6122,"topicId":6038,"numMessagesInTopic":46,"msgSnippet":"Hey Ken, ... Of course -- I m taking this as general philosophy of science discussion and hope that no one takes any comments personally. This is an important,","rawEmail":"Return-Path: &lt;rhiever@...&gt;\r\nX-Sender: rhiever@...\r\nX-Apparently-To: neat@yahoogroups.com\r\nX-Received: (qmail 37689 invoked by uid 102); 3 Jun 2013 23:54:32 -0000\r\nX-Received: from unknown (HELO mtaq3.grp.bf1.yahoo.com) (10.193.84.142)\n  by m10.grp.bf1.yahoo.com with SMTP; 3 Jun 2013 23:54:32 -0000\r\nX-Received: (qmail 2299 invoked from network); 3 Jun 2013 23:54:32 -0000\r\nX-Received: from unknown (HELO ng10-ip7.bullet.mail.bf1.yahoo.com) (98.139.165.83)\n  by mtaq3.grp.bf1.yahoo.com with SMTP; 3 Jun 2013 23:54:32 -0000\r\nX-Received: from [98.139.164.122] by ng10.bullet.mail.bf1.yahoo.com with NNFMP; 03 Jun 2013 23:54:32 -0000\r\nX-Received: from [10.193.94.44] by tg3.bullet.mail.bf1.yahoo.com with NNFMP; 03 Jun 2013 23:54:32 -0000\r\nDate: Mon, 03 Jun 2013 23:54:30 -0000\r\nTo: neat@yahoogroups.com\r\nMessage-ID: &lt;kojabm+vktq@...&gt;\r\nIn-Reply-To: &lt;kohjhf+cmm3@...&gt;\r\nUser-Agent: eGroups-EW/0.82\r\nMIME-Version: 1.0\r\nContent-Type: text/plain; charset=&quot;ISO-8859-1&quot;\r\nContent-Transfer-Encoding: quoted-printable\r\nX-Mailer: Yahoo Groups Message Poster\r\nX-Yahoo-Newman-Property: groups-compose\r\nX-eGroups-Msg-Info: 2:3:4:0:0\r\nFrom: &quot;rhiever489&quot; &lt;rhiever@...&gt;\r\nSubject: Re: Quantitative vs. Qualitative Results\r\nX-Yahoo-Group-Post: member; u=550414109; y=vtVTnqxhhN47I8XvT24Wi8Eh-n2r7v3lwsjw34ZhFrBy129RLBJoVfT_Njnu2n4J7eGC5uTbzwuYrw8\r\nX-Yahoo-Profile: rhiever489\r\n\r\nHey Ken,\n\n&gt; Hi Randy, I have a couple comments below.  Please don&#39;t take it=\r\n as\n&gt; overly critical - I&#39;m much more interested in the issue of where an\n&gt;=\r\n unquestioning drive towards quantification will lead us, so I&#39;m just\n&gt; exp=\r\nloring that issue through your suggestions.  I respect your view and\n&gt; unde=\r\nrstand that many share it.\n\nOf course -- I&#39;m taking this as general philoso=\r\nphy of science discussion and hope that no one takes any comments personall=\r\ny. This is an important, albeit sometimes uncomfortable, discussion to have=\r\n. :-)\n\n\n&gt; So you really would prefer that Jeff would fill up several pages =\r\nof this\n&gt; short paper instead with a comparison between his new method and =\r\na\n&gt; reproduction of my old target-based evolution experiment with Brian\n&gt; W=\r\noolley, even though that&#39;s not the subject of this paper?  Jeff&#39;s\n&gt; method =\r\nfor reproducing these objects is not an optimization method so of\n&gt; course =\r\nit is essentially perfect, so why bother comparing it to an\n&gt; optimization =\r\nmethod?  The point of this paper is what happens once you\n&gt; evolve beyond s=\r\nuch reproductions, not the perfection of the\n&gt; reproductions themselves.\n&gt;\n=\r\n&gt; If you were a reviewer and succeeded in forcing Jeff to switch this\n&gt; pap=\r\ner to include such a comparison, do you really think the resulting\n&gt; loss o=\r\nf text on the real topic of the paper (i.e. what happens after you\n&gt; evolve=\r\n further) would not actually reduce its value?\n&gt; \n&gt; This suggested change m=\r\night be an example of how demanding\n&gt; quantification where it is unneeded c=\r\nan actually damage a paper and\n&gt; distort its original intent, but I&#39;m curio=\r\nus how you see it.\n\nThat&#39;s a good point that actually escaped me on my firs=\r\nt read through the paper. The lengthy discussion in the future work on evol=\r\nvability left me with the impression that not much had been explored in ter=\r\nms of the evolvability of the SeededCPPNs, other than that different object=\r\ns can (of course) evolve from &quot;flat&quot; SeededCPPNs. i.e., the &quot;flat&quot; SeededCP=\r\nPNs are still evolvable.\n\nBy the way, this is a great example of why peer r=\r\neview should be an open discussion, and not an anonymous one-shot report. ;=\r\n-)\n\n\n&gt; These sentiments surprised me. Why is it a bad assumption that someo=\r\nne\n&gt; would want to follow up on your work?  What is the point of publishing=\r\n\n&gt; something if you assume that no one would want to follow up on it?  What=\r\n\n&gt; could be more important than what might come next thanks to your\n&gt; contr=\r\nibution?  If anything I&#39;d like to see longer future work sections\n&gt; so I ha=\r\nve some idea why people think their ideas are important.\n\nAs JBM mentioned =\r\nin an earlier post, the main purpose of a paper should be to teach the read=\r\ner something new. If it enables future work (and it most likely does), that=\r\n&#39;s great, and it&#39;s smart to point that future work out in the paper. But to=\r\n make the main contribution of a paper that it enables future work is most =\r\nlikely a fruitless venture that will just end up as an uncited paper if we =\r\ndon&#39;t follow up on it ourselves. Just look at how many papers go uncited no=\r\nwadays.\n\n&gt; I&#39;m also not clear on why a proof of concept should be relegated=\r\n to a\n&gt; poster.  After all, there&#39;s only one proof-of-concept in the known\n=\r\n&gt; universe of evolution producing human intelligence and it inspired our\n&gt; =\r\nentire research field.\n&gt; \n&gt; If I evolved a single HyperNEAT neural network =\r\nwith human-level\n&gt; intelligence but could not do it again, would you prefer=\r\n that the result\n&gt; remains reported only in a poster?  Would you question t=\r\nhe capabilities\n&gt; of HyperNEAT because it &quot;only&quot; evolved human-level intell=\r\nigence once?\n\nI wouldn&#39;t say that high-level intelligence is a single proof=\r\n of concept. High-level intelligence has evolved in many species, some exta=\r\nnt and some extinct. It didn&#39;t just pop out of nowhere, either -- it was th=\r\ne result of a long chain of evolutionary events in environments that favore=\r\nd animals with high-level intelligence. Thus, it&#39;s far more informative to =\r\nunderstand what mechanisms (e.g., selective pressures) underly the evolutio=\r\nn of intelligence, rather than simply demonstrating a system in which it ev=\r\nolved as a (potentially) rare event. That is why quantification is so impor=\r\ntant. By nature, you must gain some deeper understanding of the phenomenon =\r\nin order to quantify it.\n\nFor example, let&#39;s say we did evolve an agent wit=\r\nh high-level intelligence using HyperNEAT, qualitatively showed its perform=\r\nance on some cognitive tasks, and plotted the network as a figure. How woul=\r\nd someone follow up on that? They could take our code and re-run it, but if=\r\n high-level intelligence is indeed a rare evolutionary event, how would the=\r\ny stand a chance of reproducing our result? If they can&#39;t reproduce it, how=\r\n could they build on it from there? Or, if it takes a huge amount of effort=\r\n to reproduce the event, is it really worth the effort to build on it?\n\nIt&#39;=\r\ns unlikely that we&#39;re going to just stumble into something as complex as hi=\r\ngh-level intelligence. It&#39;s going to come from a long series of experiments=\r\n that build on each other as we learn more and more about what constitutes =\r\nintelligence. That&#39;s why proofs of concept are insufficient to advance a fi=\r\neld: They show that something was accomplished (that likely won&#39;t be accomp=\r\nlished again anytime soon, e.g., Sims, 1994), but do not teach the reader *=\r\nwhy* it worked. The *why*, ultimately, is what advances the field.\n\n\nCheers=\r\n,\nRandy\n\n\n"}}