{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[{"name":"READ"}]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"userId":54567749,"authorName":"Ken","from":"&quot;Ken&quot; &lt;kstanley@...&gt;","profile":"kenstanley01","replyTo":"LIST","senderId":"jwIClR8VnQtbZ56tCRqLmQasCvm7xOqCZjeST139fCjHyKNE4mSDhENpHVkg8gVEZWZeWoHS49vtsTX_rYRHzPWjoSIT","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: behavioral vs genetic divesrity","postDate":"1371324461","msgId":6148,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGtwaWY3ZCs4bzN1QGVHcm91cHMuY29tPg==","inReplyToHeader":"PGtwZzJkNitmb290QGVHcm91cHMuY29tPg=="},"prevInTopic":6147,"nextInTopic":6149,"prevInTime":6147,"nextInTime":6149,"topicId":6136,"numMessagesInTopic":14,"msgSnippet":"Oops I had forgotten that we actually do have experimental results supporting the idea that genetic diversity can be important for maintaining behavioral","rawEmail":"Return-Path: &lt;kstanley@...&gt;\r\nX-Sender: kstanley@...\r\nX-Apparently-To: neat@yahoogroups.com\r\nX-Received: (qmail 30038 invoked by uid 102); 15 Jun 2013 19:27:42 -0000\r\nX-Received: from unknown (HELO mtaq3.grp.bf1.yahoo.com) (10.193.84.142)\n  by m7.grp.bf1.yahoo.com with SMTP; 15 Jun 2013 19:27:42 -0000\r\nX-Received: (qmail 19125 invoked from network); 15 Jun 2013 19:27:42 -0000\r\nX-Received: from unknown (HELO ng11.bullet.mail.bf1.yahoo.com) (98.139.164.106)\n  by mtaq3.grp.bf1.yahoo.com with SMTP; 15 Jun 2013 19:27:42 -0000\r\nX-Received: from [98.139.164.125] by ng11.bullet.mail.bf1.yahoo.com with NNFMP; 15 Jun 2013 19:27:42 -0000\r\nX-Received: from [10.193.94.41] by tg6.bullet.mail.bf1.yahoo.com with NNFMP; 15 Jun 2013 19:27:42 -0000\r\nDate: Sat, 15 Jun 2013 19:27:41 -0000\r\nTo: neat@yahoogroups.com\r\nMessage-ID: &lt;kpif7d+8o3u@...&gt;\r\nIn-Reply-To: &lt;kpg2d6+foot@...&gt;\r\nUser-Agent: eGroups-EW/0.82\r\nMIME-Version: 1.0\r\nContent-Type: text/plain; charset=&quot;ISO-8859-1&quot;\r\nContent-Transfer-Encoding: quoted-printable\r\nX-Mailer: Yahoo Groups Message Poster\r\nX-Yahoo-Newman-Property: groups-compose\r\nX-eGroups-Msg-Info: 1:12:0:0:0\r\nFrom: &quot;Ken&quot; &lt;kstanley@...&gt;\r\nSubject: Re: behavioral vs genetic divesrity\r\nX-Yahoo-Group-Post: member; u=54567749; y=_KI56JDV6Dgh-a75Rc8wOPWVRsT4WYIllbtdWVDbJu6c2Wu5wbf9\r\nX-Yahoo-Profile: kenstanley01\r\n\r\n\n\nOops I had forgotten that we actually do have experimental results suppor=\r\nting the idea that genetic diversity can be important for maintaining behav=\r\nioral diversity.  So I was mistaken to say in the previous post that it was=\r\n just speculation.  The publication (with Joel Lehman and Risto Miikkulaine=\r\nn) will appear at this year&#39;s GECCO:\n\nhttp://eplex.cs.ucf.edu/papers/lehman=\r\n_gecco13.pdf\n\nThe key results are in figure 5 and figure 7, which show &quot;N&quot; =\r\n(novelty alone) and &quot;N+S&quot; (novelty+speciation) comparisons in a range of bi=\r\nped walking variant domains (figure 5) and a range of maze navigation varia=\r\nnt domains (figure 7).  These ranges mean the combinations were tested at v=\r\narying levels of problem difficulty.  What you can see is that overall, N+S=\r\n (i.e. with genetic diversity) outperforms novelty alone.\n\nIn the biped tas=\r\nk, the gap is even bigger, which makes intuitive sense if you think about: =\r\n The biped tends to be a brittle task that requires precise weight tuning. =\r\n In a situation like that, new neural network structure is likely to destab=\r\nilize delicately tuned behaviors, leading to degenerate behaviors.  Therefo=\r\nre, some kind of genetic diversity protection is very helpful to make it po=\r\nssible to explore new structural possibilities and hence the behaviors they=\r\n may later enable.  \n\nHowever, even in maze navigation variants the advanta=\r\nge of adding speciation is seen.  In fact, one other important result is th=\r\nat in maze navigation, N+S does better than a combination of F+N (fitness p=\r\nlus novelty), which shows that in some cases novelty is the ideal driver fo=\r\nr the search, and when that is true, genetic diversity provides an addition=\r\nal boost.\n\nSo indeed I think it would be premature to throw away genetic di=\r\nversity from NEAT systems too soon, especially when novelty or behavioral d=\r\niversity are already in the mix.  It&#39;s still an interesting topic for furth=\r\ner investigation though.\n\nBest,\n\nken\n\n--- In neat@yahoogroups.com, &quot;Ken&quot; &lt;k=\r\nstanley@...&gt; wrote:\n&gt;\n&gt; \n&gt; \n&gt; Hi Stef,\n&gt; \n&gt; I changed the subject again jus=\r\nt to make it easier to keep track as the conversation branches.\n&gt; \n&gt; Thanks=\r\n for pointing out these insights and your work on behavioral vs. genetic di=\r\nversity.  It does appear that behavioral diversity and novelty are emerging=\r\n through recent research such as your own as more critical factors in maint=\r\naining healthy diversity than genetic diversity, in particular when the div=\r\nersity is in service of achieving a traditional objective (i.e. when one of=\r\n the multiple objectives is some kind of task-specific performance measure)=\r\n.\n&gt; \n&gt; However, genetic diversity may still play a useful role in combinati=\r\non with behavioral diversity or novelty, which I want to illustrate here.  =\r\nRecall that the original motivation in NEAT for maintaining genetic diversi=\r\nty was to ensure that genetic innovations (i.e. additions of structure) are=\r\n not eliminated prematurely.  That is, the point is to ensure that individu=\r\nals with new structure are not eliminated before they have a chance to show=\r\n their potential by optimizing their weights over several more generations.=\r\n  Placing them in protected species gives them that opportunity to optimize=\r\n further.\n&gt; \n&gt; However, recent results such as yours suggest that when you =\r\nhave a target objective, protecting behavioral diversity is so effective (m=\r\nost likely because it help avoid deception) that a system with only behavio=\r\nral diversity will likely come closer to the objective than one with only g=\r\nenetic diversity.\n&gt; \n&gt; But that leaves open the possibility that genetic di=\r\nversity can complement behavioral diversity or novelty.  One interesting qu=\r\nestion is whether in the &quot;Encouraging Behavioral Diversity in Evolutionary =\r\nRobotics&quot; paper the results would be even better if *both* behavioral diver=\r\nsity/novelty and genetic diversity were combined (as our group has done in =\r\nrecent papers).  Going back to the motivation in NEAT for genetic diversity=\r\n, the logic for why it would still matter when combined with behavioral div=\r\nersity/novelty can be seen:  \n&gt; \n&gt; Just as we do not know at first for any =\r\nstructural innovation whether that innovation might lead to higher fitness =\r\nin an objective-based problem, we also do not know initially whether a part=\r\nicular structural innovation might lead later to more *novelty*.  Often str=\r\nuctural additions in neuroevolution lead to a complete collapse in behavior=\r\n, which obviously hurts fitness, but also hurts novelty because degenerate =\r\nbehaviors are not considered novel (except at the very beginning of the run=\r\n).  Therefore, if you are not protecting genetic diversity when novelty/beh=\r\navioral diversity are one of the objectives, then you are risking premature=\r\nly eliminating genotypes before their potential for novelty has been explor=\r\ned.\n&gt; \n&gt; However, perhaps more significant in magnitude than even that scen=\r\nario is whether novelty alone (as in novelty search) can drive a search as =\r\neffectively without genetic diversity than it can with it.  When you are se=\r\narching for a specific objective target, deception is the overriding pathol=\r\nogy, which is why behavioral diversity is such a potent antidote.  However,=\r\n if you are searching only for novelty, then obviously deception is no long=\r\ner the issue (since you are not looking for any one thing), which means tha=\r\nt now other pathologies (such as prematurely losing structural innovations =\r\nfrom the population) would become more important.  Therefore, the impact of=\r\n forgoing genetic diversity might be more evident in that context.\n&gt; \n&gt; Fur=\r\nthermore, even if this issue is most evident in pure novelty search, it may=\r\n still appear to some extent in any search where behavioral diversity is im=\r\nportant, since genetic diversity ultimately drives behavioral diversity.\n&gt; =\r\n\n&gt; This issue probably merits further study.  I only mean to raise the ques=\r\ntion, not to argue that the answer is conclusive.  I&#39;m guessing the real an=\r\nswer is probably nuanced.  For example, it may be that genetic diversity is=\r\n more important early in a run when small structural changes tend to have t=\r\nhe most dramatic effects on behavior.  Perhaps in later generations because=\r\n the effect tends to be less the need for genotypic protection might reduce=\r\n.  But my guess is that ultimately genetic diversity and behavioral diversi=\r\nty both play a role in healthy evolution, and in fact complement each other=\r\n (because genetic diversity helps foster behavioral diversity).  I would al=\r\nso guess the effect would be more pronounced the more a search relies on no=\r\nvelty as its primary driver (with pure novelty search being the most extrem=\r\ne such case).  Of course these are currently just speculations on my part.\n=\r\n&gt; \n&gt; Best,\n&gt; \n&gt; ken\n&gt; \n&gt; \n&gt; --- In neat@yahoogroups.com, St=E9phane Doncieu=\r\nx &lt;stephane.doncieux@&gt; wrote:\n&gt; &gt;\n&gt; &gt; Hi Oliver,\n&gt; &gt; \n&gt; &gt; we are using NSGA=\r\n-II for neuroevolution for quite a while now, and in\n&gt; &gt; the same situation=\r\n, we have actually chosen to use a simplified version\n&gt; &gt; of NEAT. We have =\r\ndiscarded the innovation numbers and thus the\n&gt; &gt; speciation and crossover =\r\nand kept only the idea of starting simple. We\n&gt; &gt; have actually replaced al=\r\nl of it with an objective that rewards the\n&gt; &gt; behavioral diversity of the =\r\nrobot we were evolving. We made some\n&gt; &gt; comparisons with NEAT in this pape=\r\nr: &quot;Mouret, J.-B. and Doncieux, S.\n&gt; &gt; (2012). Encouraging Behavioral Diver=\r\nsity in Evolutionary Robotics: an\n&gt; &gt; Empirical Study. Evolutionary Computa=\r\ntion. Vol 20 No 1 Pages 91-133&quot;, cf\n&gt; &gt; http://www.isir.upmc.fr/files/2011A=\r\nCLI2061.pdf\n&gt; &gt; It revealed to be more efficient than NEAT on the different=\r\n setups that\n&gt; &gt; we did consider.\n&gt; &gt; \n&gt; &gt; Since then, if we don&#39;t have a r=\r\neason to use something else, we use this\n&gt; &gt; simple encoding either with a =\r\nbehavioral diversity objective or with a\n&gt; &gt; novelty objective. It gives no=\r\nt bad results, see\n&gt; &gt; http://www.youtube.com/watch?feature=3Dplayer_embedd=\r\ned&v=3DTrj0_A1ZfNo, for\n&gt; &gt; instance. It has at least the advantage of bein=\r\ng simple. If you want\n&gt; &gt; some source code and/or look at the work we have =\r\ndone on this topic, you\n&gt; &gt; can have a look at http://pages.isir.upmc.fr/ev=\r\norob_db/.\n&gt; &gt; \n&gt; &gt; I know that it does not directly answer your question, b=\r\nut my advice\n&gt; &gt; would be at least to test such an approach with a simpler =\r\nencoding and\n&gt; &gt; some helper objectives. It is quite straightforward to imp=\r\nlement and\n&gt; &gt; will give you some reference points with which to compare th=\r\ne\n&gt; &gt; performance of more complex algorithms. The other advantage is that t=\r\nhe\n&gt; &gt; day researchers in multi-objective evolutionary algorithms come up w=\r\nith\n&gt; &gt; a new and more efficient algorithm, it should be simple to use it. =\r\nBy\n&gt; &gt; the way, if you experience problem with that, I would be happy to\n&gt; =\r\n&gt; discuss it with you.\n&gt; &gt; \n&gt; &gt; Hope it helps,\n&gt; &gt; \n&gt; &gt; Best,\n&gt; &gt; \n&gt; &gt; step=\r\nhane\n&gt; &gt;\n&gt;\n\n\n\n"}}