{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[{"name":"READ"}]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"userId":55268137,"authorName":"shimonw","from":"&quot;shimonw&quot; &lt;shimon@...&gt;","profile":"shimonw","replyTo":"LIST","senderId":"DyxXfMfMna6REKml1DcaIaNkEmTcR1aqP0tageySz2jteKfP4JWI1wDhF8ArFFbjml5kDDDpynZ1lVVIIqPUqboTkGx7SQ","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: GECCO Paper on HyperNEAT","postDate":"1371470090","msgId":6150,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGtwbXRlYitlcWd2QGVHcm91cHMuY29tPg==","inReplyToHeader":"PGtvdGtoZytoZ3Z1QGVHcm91cHMuY29tPg=="},"prevInTopic":6128,"nextInTopic":6151,"prevInTime":6149,"nextInTime":6151,"topicId":6085,"numMessagesInTopic":14,"msgSnippet":"Hi Ken, If I may, I d like to offer a couple reactions to your latest message.  This is indeed an interesting discussion that touches on many potentially","rawEmail":"Return-Path: &lt;shimon@...&gt;\r\nX-Sender: shimon@...\r\nX-Apparently-To: neat@yahoogroups.com\r\nX-Received: (qmail 93978 invoked by uid 102); 17 Jun 2013 11:54:51 -0000\r\nX-Received: from unknown (HELO mtaq2.grp.bf1.yahoo.com) (10.193.84.33)\n  by m12.grp.bf1.yahoo.com with SMTP; 17 Jun 2013 11:54:51 -0000\r\nX-Received: (qmail 19123 invoked from network); 17 Jun 2013 11:54:51 -0000\r\nX-Received: from unknown (HELO ng6-vm1.bullet.mail.bf1.yahoo.com) (98.139.164.43)\n  by mtaq2.grp.bf1.yahoo.com with SMTP; 17 Jun 2013 11:54:51 -0000\r\nX-Received: from [98.139.164.125] by ng6.bullet.mail.bf1.yahoo.com with NNFMP; 17 Jun 2013 11:54:51 -0000\r\nX-Received: from [10.193.94.43] by tg6.bullet.mail.bf1.yahoo.com with NNFMP; 17 Jun 2013 11:54:51 -0000\r\nDate: Mon, 17 Jun 2013 11:54:50 -0000\r\nTo: neat@yahoogroups.com\r\nMessage-ID: &lt;kpmteb+eqgv@...&gt;\r\nIn-Reply-To: &lt;kotkhg+hgvu@...&gt;\r\nUser-Agent: eGroups-EW/0.82\r\nMIME-Version: 1.0\r\nContent-Type: text/plain; charset=&quot;ISO-8859-1&quot;\r\nContent-Transfer-Encoding: quoted-printable\r\nX-Mailer: Yahoo Groups Message Poster\r\nX-Yahoo-Newman-Property: groups-compose\r\nX-eGroups-Msg-Info: 1:12:0:0:0\r\nFrom: &quot;shimonw&quot; &lt;shimon@...&gt;\r\nSubject: Re: GECCO Paper on HyperNEAT\r\nX-Yahoo-Group-Post: member; u=55268137; y=FWf--bT0D2m-_fIfQaT72nn3WkgkcC0ELyKSG07KUfqWqA\r\nX-Yahoo-Profile: shimonw\r\n\r\nHi Ken,\n\nIf I may, I&#39;d like to offer a couple reactions to your latest mess=\r\nage.  This is indeed an interesting discussion that touches on many potenti=\r\nally important issues.  I hope I can offer a useful perspective on these to=\r\npics.\n\nYou are right that in a target-based scenario there can be many CPPN=\r\ns that generate the same phenotype.  But the CPPN is a genotype, not a phen=\r\notype. In what I&#39;m calling &quot;regular&quot; FFs, there are potentially many *pheno=\r\ntypes* that solve the problem, and for each of them potentially many genoty=\r\npes.  So in my mind, there is still a useful distinction between target bas=\r\ned FFs and regular FFs, though they are perhaps best seen as different poin=\r\nts on a spectrum.\n\nIf I understand correctly, you are suggesting that the i=\r\nmportant distinction is how the FF interacts with the search process.  But =\r\nto me, this is a difficult criterion to use because the search process coul=\r\nd be anything.  The space of possible black-box optimization methods is hug=\r\ne, and what encourages piecewise incremental progress for one method may no=\r\nt for another.\n\nI don&#39;t pretend to know what kind of algorithm would genera=\r\nte Einstein-level intelligence (I don&#39;t even know if this is a useful goal)=\r\n. But as a researcher I highly respect once told me, &quot;your failure to imagi=\r\nne it does not constitute a proof that it cannot be done.&quot;\n\nThat&#39;s why I th=\r\nink your hypothesis is quite a bold one, because it looks at the limitation=\r\ns of a specific class of black-box optimization methods and generalizes the=\r\nm to all possible black-box optimization methods.  \n\nTo give just one examp=\r\nle of the possibilities here: algorithms for continuous-armed bandits, such=\r\n as X-armed bandits and Bayesian optimization methods such as GP-UCB, can b=\r\ne applied to black-box optimization.  These methods avoid the problem of lo=\r\ncal optima in a principled way, by maintaining a posterior distribution ove=\r\nr the global FF, and using optimism in the face of uncertainty to ensure su=\r\nfficient exploration of the solution space.  As a result, these methods hav=\r\ne very nice theoretical properties, like guaranteed convergence to the glob=\r\nal optimum in the limit and logarithmic regret bounds along the way. \n\nAs f=\r\nar as I know, no one has tried to develop versions of these methods that ca=\r\nn discover NN topologies, and which would thus be suitable for optimizing C=\r\nPPNs or other indirect encodings.  But there&#39;s no a priori reason to think =\r\nit can&#39;t be done.  I&#39;m not saying this would necessarily work or even that =\r\nit&#39;s the most promising approach to explore.  I&#39;m just saying it&#39;s one exam=\r\nple of a principled approach that could avoid all the difficulties you ment=\r\nion and which we currently have no strong reason to eliminate from contenti=\r\non.\n\nSo I think it&#39;s quite likely that these hard FFs are not unsolvable, b=\r\nut just that current methods cannot solve them.  Rather than giving up on t=\r\nhem, in my opinion we should be focusing on developing better methods for t=\r\nhem.\n\nRegarding whether 6 nodes is a lot to represent fracture, I think the=\r\n same point applies: just because we can&#39;t think of a better way to do it, =\r\ndoesn&#39;t mean it doesn&#39;t exist.  Our paper establishes 6 as an upper bound, =\r\nwhich can be easily done by example.  If I understand correctly, you are su=\r\nggesting that 6 may be a lower bound, which is much more difficult to demon=\r\nstrate.\n\nI could definitely imagine that a different type of network, or on=\r\ne with a different set of activation functions, might be able to make bette=\r\nr use of 6 nodes.  Even if it&#39;s true that there&#39;s a trade-off, and using fe=\r\nwer nodes means less flexibility, there may be many cases where that&#39;s a fa=\r\nvorable trade-off.  We should at least be open to the possibility that it s=\r\nome cases the sweet spot is not a representation that requires 6 nodes for =\r\nfracture.\n\nI&#39;m looking forward to chatting more about this at GECCO.\n\nCheer=\r\ns,\nShimon\n\n--- In neat@yahoogroups.com, &quot;Ken&quot; &lt;kstanley@...&gt; wrote:\n&gt;\n&gt; Hi =\r\nShimon,\n&gt; \n&gt; These are some really interesting and deep issues we&#39;re gettin=\r\ng into.  I\n&gt; am sure they will be the foundation of great discussions at GE=\r\nCCO.  I&#39;ll\n&gt; try to keep my response more brief than before.\n&gt; \n&gt; 1) Indeed=\r\n recent quadruped results are not in the same setup as in your\n&gt; work; that=\r\n is a legitimate qualification and they do not constitute a\n&gt; proof that in=\r\n your particular setup HyperNEAT would succeed.  However,\n&gt; they are arguab=\r\nly at least comparably complex.  For example, the CTRNN\n&gt; in\n&gt; http://eplex=\r\n.cs.ucf.edu/papers/risi_gecco13b.pdf\n&gt; &lt;http://eplex.cs.ucf.edu/papers/risi=\r\n_gecco13b.pdf&gt;   is a complicated\n&gt; structure and the CPPN that encodes it =\r\nis required not only to generate\n&gt; a controller for a single quadruped morp=\r\nhology, but to generate multiple\n&gt; controllers for multiple morphologies, a=\r\nll from the same CPPN.  A video\n&gt; of three controllers all from the same CP=\r\nPN is here:\n&gt; http://youtu.be/oLSSt5GyHNk &lt;http://youtu.be/oLSSt5GyHNk&gt;\n&gt; \n=\r\n&gt; 2) I think the question of what is &quot;target-based&quot; can actually be\n&gt; inter=\r\nesting, but I completely agree that the semantic side of the\n&gt; argument isn=\r\n&#39;t really important.  But what I do find interesting is the\n&gt; idea that the=\r\nse two scenarios differ substantively in your mind (as you\n&gt; put it):\n&gt; \n&gt; =\r\n&quot;there is an important difference between FFs that require a single\n&gt; speci=\r\nfic phenotype and FFs that require only that some goal be achieved&quot;\n&gt; \n&gt; I =\r\nthink by &quot;single specific phenotype&quot; you mean pattern-matching (i.e.\n&gt; imag=\r\ne-matching).  But I think this distinction doesn&#39;t really exist: \n&gt; There a=\r\nre an unlimited number of networks (i.e. CPPNs) that can encode a\n&gt; particu=\r\nlar two-dimensional image, just as there are an unlimited number\n&gt; of CPPNs=\r\n that can encode a particular behavior or goal (such as\n&gt; following a line)=\r\n.\n&gt; \n&gt; What makes both target-based and fundamentally the same is not the\n&gt;=\r\n number of ways they can be solved, but rather the way the fitness\n&gt; functi=\r\non interacts with the search process.  The problem is that\n&gt; target-based f=\r\nitness encourages piece-wise incremental progress, which\n&gt; tends to be high=\r\nly deceptive.  For example, with an image, matching a\n&gt; single pixel can ra=\r\nise fitness even if the function that causes that\n&gt; pixel to be matched has=\r\n no relationship whatsoever to the overall\n&gt; regularities in the target pat=\r\ntern.  The same is true in control tasks: \n&gt; A mutation that causes a quadr=\r\nuped to lunge forward clumsily is rewarded\n&gt; for the slight improvement in =\r\nfitness, whereas an important underlying\n&gt; regularity (e.g. oscillation) ne=\r\ncessary to get really good at the task\n&gt; is never established.  Non-target-=\r\nbased fitness (or what I call\n&gt; &quot;non-objective&quot;) avoids these problems beca=\r\nuse it *does* reward\n&gt; establishing regularities: it appreciates new regula=\r\nrities even if they\n&gt; don&#39;t immediately raise fitness.\n&gt; \n&gt; But what&#39;s most=\r\n interesting to me is your intuition that there is some\n&gt; way to sidestep t=\r\nhe tradeoff in combining indirect encodings with\n&gt; target-based fitness fun=\r\nctions.  That is, you suspect there may exist an\n&gt; indirect encoding that c=\r\nan both elaborate regularities compositionally\n&gt; over very many generations=\r\n and also almost deterministically satisfy an\n&gt; arbitrary target-based obje=\r\nctive.  I am convinced that is not the case \n&gt; (it would be too good to be =\r\ntrue), but you rightly point out that my\n&gt; position is a hypothesis.   Howe=\r\nver, just as a thought experiment, can\n&gt; you really imagine any neural netw=\r\nork encoding (including DNA) that\n&gt; would give you Einstein-level intellige=\r\nnce if the target was simply to\n&gt; score maximally on an IQ test?  It is pla=\r\nin to me that the stepping\n&gt; stones to human level cannot be crossed in the=\r\n presence of a\n&gt; target-based objective (or any one conceivable).  However,=\r\n\n&gt; interestingly, that does not mean that such a neural network does not\n&gt; =\r\nexist in the search space.  It just means a target won&#39;t get you there.\n&gt; \n=\r\n&gt; 3) We apparently disagree on whether 6 is a big number (for nodes needed\n=\r\n&gt; to represent fracture).  If you try to devise an encoding that\n&gt; represen=\r\nts fracture with fewer than that, my intuition is that you would\n&gt; be sacri=\r\nficing an enormous breadth of flexibility in the kinds of\n&gt; fracture (and p=\r\natterns in general) that you can represent.  Think about\n&gt; the number of &quot;d=\r\negrees of freedom&quot; in fracture: it&#39;s not really\n&gt; well-defined, but a singl=\r\ne line of fracture has a lot of dimensions:\n&gt; \n&gt; -position\n&gt; -orientation\n&gt;=\r\n -curvature (which can be arbitrarily complex)\n&gt; -fracture gradient (that i=\r\ns, one region can smoothly transition into\n&gt; another in a kind of interpola=\r\nted transitional zone)\n&gt; -embedding (fracture can potentially be hierarchic=\r\nal or regular, i.e.\n&gt; dependent on higher-level containing regions)\n&gt; \n&gt; Th=\r\ne idea that all of that can be encoded in anything less than about 6\n&gt; simp=\r\nle functions seems optimistic.  Of course, if you are willing to\n&gt; sacrific=\r\ne some of those degrees of freedom, then you can get fewer\n&gt; nodes, but the=\r\n exquisite minutia of such patterns would be lost (and\n&gt; you&#39;d move more to=\r\nwards direct encoding, like the wavelets do).\n&gt; \n&gt; By the way, here are som=\r\ne cool examples of complicated kinds of fracture\n&gt; from Picbreeder (such as=\r\n fractured periodic zones, but even more complex\n&gt; than even that):\n&gt; \n&gt; No=\r\nntrivial color patterns in each zone:\n&gt; http://picbreeder.org/search/showge=\r\nnome.php?sid=3D11328\n&gt; \n&gt; \n&gt; Very complex brush-stroke pattern inside the a=\r\npple vs. outside (the DNA\n&gt; for this one is fascinating):\n&gt; http://picbreed=\r\ner.org/search/showgenome.php?sid=3D7109\n&gt; \n&gt; \n&gt; \n&gt; Fractured regions coveri=\r\nng a distorted surface, giving a remarkable\n&gt; underlying curvature:\n&gt; http:=\r\n//picbreeder.org/search/showgenome.php?sid=3D2684\n&gt; \n&gt; \n&gt; A color variant: =\r\nhttp://picbreeder.org/search/showgenome.php?sid=3D6652\n&gt; \n&gt; \n&gt; When I see s=\r\no many remarkable examples like these on Picbreeder, the\n&gt; message to me is=\r\n that we have only scratched the surface of what CPPN\n&gt; encoding can teach =\r\nus about representation.  That&#39;s why I think it&#39;s\n&gt; premature (in the face =\r\nof such a treasure trove of evidence) to be\n&gt; worrying about whether we can=\r\n represent some subcomponent of such\n&gt; patterns with less than 6 nodes.  At=\r\n present I&#39;m amazed they can be\n&gt; represented at all, let alone with under =\r\n6 nodes.\n&gt; \n&gt; Thanks very much for raising these issues in any case - it&#39;s =\r\na great\n&gt; debate to have about representation and search and goes to the he=\r\nart of\n&gt; the field of GDS/indirect encoding.\n&gt; \n&gt; Best,\n&gt; \n&gt; ken\n&gt; \n&gt; --- I=\r\nn neat@yahoogroups.com, &quot;shimonw&quot;  wrote:\n&gt; &gt;\n&gt; &gt; Hi Ken,\n&gt; &gt;\n&gt; &gt; Thanks fo=\r\nr your interesting and thought-provoking comments.  I&#39;ll give\n&gt; some brief =\r\nreactions here, and I hope we can have a productive\n&gt; discussion about it a=\r\nt GECCO.\n&gt; &gt;\n&gt; &gt; 1) I won&#39;t comment for now on the new experiments you&#39;ve b=\r\neen running\n&gt; because the details are not available yet.  Instead, I will j=\r\nust comment\n&gt; on the various walking gait domains, because the details of t=\r\nhe\n&gt; additional results you mentioned are in that case already available, i=\r\nn\n&gt; newly published GECCO papers.\n&gt; &gt;\n&gt; &gt; FIrst of all, these are very cool=\r\n results, and nice success stories\n&gt; for HyperNEAT.  It&#39;s great to see that=\r\n the GDS community is continuing\n&gt; the push the envelope in terms of robot =\r\nlocomotion, which seems to be\n&gt; emerging as a nice application for indirect=\r\n encodings.\n&gt; &gt;\n&gt; &gt; However, I would simply caution against placing all the=\r\nse variations\n&gt; on the walking gait task on a one-dimensional spectrum of d=\r\nifficulty. \n&gt; In our paper, we took the orignal walking gait task and made =\r\nonly one\n&gt; change (increasing the mass of the torso) which clearly makes th=\r\ne task\n&gt; harder.  In the papers Ken mentioned, there are other differences,=\r\n e.g.,\n&gt; the use of an SUPG encoding, the use of CTRNNs, the use of a diffe=\r\nrent\n&gt; substrate topology, and varying the length of the legs.\n&gt; &gt;\n&gt; &gt; It&#39;s=\r\n completely legitimate to make these changes and they don&#39;t\n&gt; detract from =\r\nthe results at all.   But they are confounding factors when\n&gt; it comes to c=\r\nomparing HyperNEAT&#39;s performance on walking gait tasks of\n&gt; different diffi=\r\nculties.  Some of these changes may make the task harder\n&gt; in some ways but=\r\n other changes may make it easier in others ways, and so\n&gt; far we don&#39;t hav=\r\ne experimental results that control for these factors.\n&gt; &gt;\n&gt; &gt; 2) I hope to=\r\n avoid a semantic debate about what is a &quot;target-based&quot;\n&gt; FF.  If you want =\r\nto include what I was calling a &quot;regular&quot; FF in the\n&gt; scope of target-based=\r\n FFs, I won&#39;t object.  But my point is that,\n&gt; regardless of what you call =\r\nthem, there is an important difference\n&gt; between FFs that require a single =\r\nspecific phenotype and FFs that\n&gt; require only that some goal be achieved. =\r\n For the latter, there may be\n&gt; many ways to skin the cat, though in any in=\r\nteresting problem, good\n&gt; solutions are still quite rare.  The distinction =\r\nis important because,\n&gt; while the former category is arguably only of theor=\r\netical interest, the\n&gt; second category corresponds to what I consider the m=\r\nost interesting and\n&gt; important class of FFs, because these are the FFs tha=\r\nt naturally arise\n&gt; in a very large number of real-world optimization probl=\r\nems.\n&gt; &gt;\n&gt; &gt; So, using your terminology, I agree it is reasonable to say\n&gt; =\r\nHyperNEAT&#39;s difficulties with fracture are probably limited to\n&gt; &quot;target-ba=\r\nsed&quot; FFs.  But for me, this is a potentially serious\n&gt; restriction, since t=\r\narget-based FFs include not just pathological FFs\n&gt; but a large class of re=\r\nal-world FFs.\n&gt; &gt;\n&gt; &gt; Regarding the wavelet method, I would still definitel=\r\ny call this an\n&gt; indirect encoding, but it is in some sense &quot;less indirect&quot;=\r\n because it\n&gt; lacks the compositional functions of HyperNEAT. It&#39;s a perfec=\r\ntly\n&gt; reasonable hypothesis that such compositionality is advantageous in s=\r\nome\n&gt; ways.  However, if that&#39;s true, then we should be able to demonstrate=\r\n\n&gt; that by finding tasks where HyperNEAT outperforms the wavelet method\n&gt; (=\r\nFYI, in the extended analysis Thomas is conducting for his master&#39;s\n&gt; thesi=\r\ns, we have found one variation of the line-following task where\n&gt; this is t=\r\nhe case).  So in that sense, the wavelet method is a useful\n&gt; baseline, whi=\r\nch is the whole reason we introduced it.\n&gt; &gt;\n&gt; &gt; 3) If it&#39;s true that it ta=\r\nkes ~6 nodes to represent fracture, then I\n&gt; think this a potentially impor=\r\ntant point.  On regular FFs, it could\n&gt; contribute to the difficulty of dis=\r\ncovering fracture, since\n&gt; representations that have only some of the neces=\r\nsary components may not\n&gt; be rewarded (I think you would call this &quot;decepti=\r\non&quot;).  In\n&gt; Picbreeder-like tasks, we already see that fracture can evolve =\r\nanyway,\n&gt; but this doesn&#39;t mean it wouldn&#39;t do it even better if fracture r=\r\nequired\n&gt; fewer nodes to represent.  If we think that the solutions to many=\r\n\n&gt; interesting problems require fracture, then I think it&#39;s at least\n&gt; poss=\r\nible that one could devise a better representation for such problems\n&gt; than=\r\n the CPPNs used in HyperNEAT.\n&gt; &gt;\n&gt; &gt; As I understand it, your approach to =\r\ndealing with &quot;regular&quot; FFs is to\n&gt; reformulate them &quot;in a way that respects=\r\n the need for phenotypic\n&gt; diversity and open-endedness.&quot;  That&#39;s a very in=\r\nteresting approach and I\n&gt; think it has a lot of merit, but I don&#39;t think i=\r\nt will solve all our\n&gt; problems because it presupposes that such a reformul=\r\nation is possible\n&gt; (or that the prior knowledge it requires is available).=\r\n  In some cases,\n&gt; I think we are just stuck with hard FFs and we need to d=\r\nevelop better\n&gt; methods to deal with them.\n&gt; &gt;\n&gt; &gt; Regarding the idea that =\r\n&quot;an unhappy and unhealthy indirect encoding is\n&gt; one with only a strict tar=\r\nget to which to aspire&quot;: this is a very\n&gt; intriguing hypothesis, but to me =\r\nit is only a hypothesis.  I think it&#39;s\n&gt; true of existing indirect encoding=\r\ns, but that for me does not in any way\n&gt; rule out the possibility of develo=\r\nping a different indirect encoding for\n&gt; which that is not true, and I thin=\r\nk that&#39;s one thing we should be\n&gt; working on.   One of the reasons that I&#39;m=\r\n interested in indirect\n&gt; encodings is that I strongly believe this can be =\r\ndone.\n&gt; &gt;\n&gt; &gt; Cheers,\n&gt; &gt; Shimon\n&gt; &gt;\n&gt;\n\n\n"}}