{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[{"name":"READ"}]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"userId":226666827,"authorName":"Joshua Auerbach","from":"Joshua Auerbach &lt;joshua.auerbach@...&gt;","profile":"phareyouwell","replyTo":"LIST","senderId":"IcmDZuIYdxUUMCVtuVzJAsNj3uWoeCgf2dNbxe0l0W3cTwvBvT2EYdHNYs3PaQwWzOxogvLrx6YBWrLUadBwPxmF0VZ9k-sWdbzHo-OPgmMnSpJj5v9C","spamInfo":{"isSpam":false,"reason":"3"},"subject":"Re: [neat] Multiobjective NEAT/HyperNEAT papers","postDate":"1406366814","msgId":6383,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDUzRDM3NDVFLjgwMzA3MDNAbWFpbC5tY2dpbGwuY2E+","inReplyToHeader":"PGxxYzZscisxOTFrZDVvQFlhaG9vR3JvdXBzLmNvbT4=","referencesHeader":"PENBRmJWRXZjOS1UdDcyeU4tcFB1OVBXeTktTFdzZ0xvYWRrOS1XeXlzckV4Vm9KTURYZ0BtYWlsLmdtYWlsLmNvbT4JPDUzQzdCOEUxLjYwNDAwQG1haWwubWNnaWxsLmNhPiA8bHFjNmxyKzE5MWtkNW9AWWFob29Hcm91cHMuY29tPg=="},"prevInTopic":6381,"nextInTopic":0,"prevInTime":6382,"nextInTime":6384,"topicId":6376,"numMessagesInTopic":5,"msgSnippet":"Ken, Thank you for taking the time to write this informative post.  I did not mean to imply that the issue had been solved, but rather just point Jared to one","rawEmail":"Return-Path: &lt;joshua.auerbach@...&gt;\r\nX-Sender: joshua.auerbach@...\r\nX-Apparently-To: neat@yahoogroups.com\r\nX-Received: (qmail 48497 invoked by uid 102); 26 Jul 2014 09:27:01 -0000\r\nX-Received: from unknown (HELO mtaq1.grp.bf1.yahoo.com) (10.193.84.32)\n  by m8.grp.bf1.yahoo.com with SMTP; 26 Jul 2014 09:27:01 -0000\r\nX-Received: (qmail 29444 invoked from network); 26 Jul 2014 09:27:00 -0000\r\nX-Received: from unknown (HELO smtp5.epfl.ch) (98.139.245.163)\n  by mtaq1.grp.bf1.yahoo.com with SMTP; 26 Jul 2014 09:27:00 -0000\r\nX-Received: (qmail 29790 invoked by uid 107); 26 Jul 2014 09:26:57 -0000\r\nX-Virus-Scanned: ClamAV\r\nX-Received: from vpn-b-195-141.epfl.ch (HELO [128.178.195.141]) (128.178.195.141) (TLS, DHE-RSA-AES128-SHA cipher) (authenticated)\n  by smtp5.epfl.ch (AngelmatoPhylax SMTP proxy) with ESMTPSA; Sat, 26 Jul 2014 11:26:57 +0200\r\nMessage-ID: &lt;53D3745E.8030703@...&gt;\r\nDate: Sat, 26 Jul 2014 11:26:54 +0200\r\nUser-Agent: Mozilla/5.0 (X11; Linux x86_64; rv:24.0) Gecko/20100101 Thunderbird/24.5.0\r\nMIME-Version: 1.0\r\nTo: neat@yahoogroups.com\r\nReferences: &lt;CAFbVEvc9-Tt72yN-pPu9PWy9-LWsgLoadk9-WyysrExVoJMDXg@...&gt;\t&lt;53C7B8E1.60400@...&gt; &lt;lqc6lr+191kd5o@...&gt;\r\nIn-Reply-To: &lt;lqc6lr+191kd5o@...&gt;\r\nContent-Type: multipart/alternative;\n boundary=&quot;------------010507040201050602000908&quot;\r\nX-eGroups-Msg-Info: 2:3:4:0:0\r\nSubject: Re: [neat] Multiobjective NEAT/HyperNEAT papers\r\nX-Yahoo-Group-Post: member; u=226666827; y=--GUJzlX0d7CtwfaCsPhe_DFoGGI5Y7lodDO4HWll6AQD3MpO0tb\r\nX-Yahoo-Profile: phareyouwell\r\nFrom: Joshua Auerbach &lt;joshua.auerbach@...&gt;\r\n\r\n\r\n--------------010507040201050602000908\r\nContent-Type: text/plain; charset=UTF-8; format=flowed\r\nContent-Transfer-Encoding: 8bit\r\n\r\nKen,\n\nThank you for taking the time to write this informative post.  I did not \nmean to imply that the issue had been solved, but rather just point \nJared to one approach that I was familiar with.  As you say, what \napproach he should take really depends on his research aims, and I agree \nthat further pursuit of the best way to do multiobjective NEAT/HyperNEAT \nwould be a very useful contribution to the field.\n\nYou raise some extremely interesting points about the potential pitfalls \nof the approach I mentioned (and also for replacing genotypic diversity \nentirely with behavioral diversity), and I&#39;d be interested to know about \nsome of the domains where you have seen these approaches break down.  It \nsounds like you have students actively researching this topic, and I&#39;m \nlooking forward to seeing what comes out of this work.\n\nBest,\nJosh\n\n\n\nOn 07/19/2014 12:21 AM, kstanley@... [neat] wrote:\n&gt;\n&gt; Hi Jared and Josh,\n&gt;\n&gt;\n&gt; There are a number of different ways that NEAT or HyperNEAT can be \n&gt; integrated into a multiobjective framework.  The trickiest part \n&gt; usually involves what to do about speciation when multiobjective \n&gt; algorithms like NSGA-II want to control the main loop and do selection \n&gt; themselves.  What Josh describes is probably the most common solution: \n&gt; adding a genetic diversity objective in lieu of the conventional NEAT \n&gt; style of fitness adjustment from speciation.   You can see that \n&gt; technique also used in some of our recent publications that use \n&gt; multiobjective versions of NEAT or HyperNEAT.  For example:\n&gt;\n&gt; http://eplex.cs.ucf.edu/papers/szerlip_ecal13.pdf\n&gt;\n&gt; http://eplex.cs.ucf.edu/papers/lehman_ab 13.pdf \n&gt; &lt;http://eplex.cs.ucf.edu/papers/lehman_ab13.pdf&gt;\n&gt;\n&gt; This idea is often used also if a novelty objective is being combined \n&gt; with other objectives in NEAT.  It is important to note that novelty \n&gt; (which is calculated over behavior) is different from genetic \n&gt; diversity (which is calculated through NEAT-style genotypic \n&gt; differences based on historical markings).  So usually when we&#39;ve done \n&gt; multiobjective optimization with novelty as an objective we&#39;ve also \n&gt; included genetic diversity, as in the first paper above.\n&gt;\n&gt; Josh also mentions that he uses the NEAT compatibility metric to do \n&gt; the genetic diversity, and that&#39;s a useful point to highlight:  you \n&gt; can still use historical markings and compute genotypic distances as \n&gt; in the original NEAT, even in a multiobjective framework.  In fact, it \n&gt; is important to do that - any other way of measuring diversity is \n&gt; likely to have unintended consequences (like simply rewarding being \n&gt; bigger, which is n ot the intent).\n&gt;\n&gt; Although this advice and the precedent for it sounds simple enough, \n&gt; it&#39;s important to note that the right way to go about \n&gt; multiobjectivizing NEAT is still not a settled issue.  The genetic \n&gt; diversity objective is easy enough to include, but it is *not* \n&gt; equivalent to NEAT-style speciation, and in some domains there may be \n&gt; a cost to that.  This subtlety is not widely recognized and not \n&gt; published but we have unpublished evidence that a genetic diversity \n&gt; objective can actually be damaging whereas NEAT-style speciation may \n&gt; not be (if one is swapped with the other and all else remains equal). \n&gt;  The reason is that an objective that rewards genetic diversity \n&gt; rewards genomes that are completely useless yet crazy, pushing up \n&gt; bloat (an important side effect) and wasting evaluations on junk. \n&gt;  This problem arises because it is extremely easy to dominate on \n&gt; genetic diversity simply by adding more genetic bloat - and dominating \n&gt; on one objective is enough to get offspring allocated in a \n&gt; multiobjective setting.  In regular NEAT-style speciation, on the \n&gt; other hand, genetic diversity merely *adjusts* fitness, which means \n&gt; that being completely horrible tempers the advantage of being \n&gt; genetically unique.  This difference is a real concern as people \n&gt; (including our own group) swap one for the other as if they are \n&gt; equivalent.\n&gt;\n&gt; Perhaps an alternative that we should consider is to forego having an \n&gt; explicit genetic diversity objective and instead adjust all the \n&gt; fitness values for all the objectives prior to NSGA-II ranking in the \n&gt; usual way the NEAT-style speciation adjusts fitnesses, and then hand \n&gt; everything back to NSGA-II.  Or something like that.  Like I said, \n&gt; unfortunately there is almost nothing published about these subtleties \n&gt; but unpublished experimental results have me worried that we are \n&gt; replacing NEAT with something not as healthy as NEAT when we go to \n&gt; mult iobjectivize NEAT and think they&#39;re the same thing.  The subject \n&gt; deserves more thought.  It&#39;s worth noting though that for some \n&gt; problems simply adding the genetic diversity objectives works fine \n&gt; enough (which is why people have been using it), so it is obviously a \n&gt; practical option in some cases, but I think it is ultimately flawed.\n&gt;\n&gt; On the other hand, there is a strain of thought in the community that \n&gt; you don&#39;t even need genetic diversity anymore now that novelty (i.e. \n&gt; behavioral diversity) has been shown so powerful.  Some believe that \n&gt; the use of such novelty now eclipses the need for genetic diversity. \n&gt;  Once again, for some problems that may be true, but also once again I \n&gt; have seen experimental results in some domains that suggest that \n&gt; genetic diversity is still important, even if you also have novelty, \n&gt; and I believe we would be throwing it away at our long-term peril \n&gt; (especially for runs that are intended to go for v ery many \n&gt; generations).  Genetic diversity in my view (and based on experimental \n&gt; results) complements novelty because sometimes a new kind of genotype \n&gt; has the *potential* to do something novel but needs several \n&gt; generations to get there.  Without speciation (or some kind of \n&gt; protection) such a genotype will be lost, and the potential novelty it \n&gt; could have yielded lost with it.\n&gt;\n&gt; As you can see, the issues here are more complex than they may \n&gt; initially seem, and there are basically two ways to approach it:  One \n&gt; is just to do what has been done before and not think about it too \n&gt; much.  Another is to really pursue trying to do it the best possible \n&gt; way and think about the subtleties of the particular way genetic \n&gt; diversity is interleaved into multiobjective NEAT or HyperNEAT.  Both \n&gt; are legitimate depending on the domain and purpose of the empirical \n&gt; research.\n&gt;\n&gt; Best,\n&gt;\n&gt; ken\n&gt;\n&gt; \n\n\r\n--------------010507040201050602000908\r\nContent-Type: text/html; charset=UTF-8\r\nContent-Transfer-Encoding: 8bit\r\n\r\n&lt;html&gt;\n  &lt;head&gt;\n    &lt;meta content=&quot;text/html; charset=UTF-8&quot; http-equiv=&quot;Content-Type&quot;&gt;\n  &lt;/head&gt;\n  &lt;body bgcolor=&quot;#FFFFFF&quot; text=&quot;#000000&quot;&gt;\n    Ken,&lt;br&gt;\n    &lt;br&gt;\n    Thank you for taking the time to write this informative post.  I did\n    not mean to imply that the issue had been solved, but rather just\n    point Jared to one approach that I was familiar with.  As you say,\n    what approach he should take really depends on his research aims,\n    and I agree that further pursuit of the best way to do\n    multiobjective NEAT/HyperNEAT would be a very useful contribution to\n    the field.&lt;br&gt;\n    &lt;br&gt;\n    You raise some extremely interesting points about the potential\n    pitfalls of the approach I mentioned (and also for replacing\n    genotypic diversity entirely with behavioral diversity), and I&#39;d be\n    interested to know about some of the domains where you have seen\n    these approaches break down.  It sounds like you have students\n    actively researching this topic, and I&#39;m looking forward to seeing\n    what comes out of this work.&lt;br&gt;\n    &lt;br&gt;\n    Best,&lt;br&gt;\n    Josh&lt;br&gt;\n    &lt;br&gt;\n    &lt;br&gt;\n    &lt;br&gt;\n    &lt;div class=&quot;moz-cite-prefix&quot;&gt;On 07/19/2014 12:21 AM,\n      &lt;a class=&quot;moz-txt-link-abbreviated&quot; href=&quot;mailto:kstanley@...&quot;&gt;kstanley@...&lt;/a&gt; [neat] wrote:&lt;br&gt;\n    &lt;/div&gt;\n    &lt;blockquote cite=&quot;mid:lqc6lr+191kd5o@...&quot; type=&quot;cite&quot;&gt;\n      &lt;meta http-equiv=&quot;Content-Type&quot; content=&quot;text/html; charset=UTF-8&quot;&gt;\n      &lt;span style=&quot;display:none&quot;&gt; &lt;/span&gt;\n      \n          &lt;div id=&quot;ygrp-text&quot;&gt;\n            &lt;p&gt;Hi Jared and Josh,&lt;/p&gt;\n            &lt;div&gt;&lt;br&gt;\n            &lt;/div&gt;\n            &lt;div&gt;There are a number of different ways that NEAT or\n              HyperNEAT can be integrated into a multiobjective\n              framework.  The trickiest part usually involves what to do\n              about speciation when multiobjective algorithms like\n              NSGA-II want to control the main loop and do selection\n              themselves.  What Josh describes is probably the most\n              common solution: adding a genetic diversity objective in\n              lieu of the conventional NEAT style of fitness adjustment\n              from speciation.   You can see that technique also used in\n              some of our recent publications that use multiobjective\n              versions of NEAT or HyperNEAT.  For example:&lt;/div&gt;\n            &lt;div&gt;&lt;br&gt;\n            &lt;/div&gt;\n            &lt;div&gt;&lt;a moz-do-not-send=&quot;true&quot; rel=&quot;nofollow&quot;\n                target=&quot;_blank&quot;\n                href=&quot;http://eplex.cs.ucf.edu/papers/szerlip_ecal13.pdf&quot;&gt;http://eplex.cs.ucf.edu/papers/szerlip_ecal13.pdf&lt;/a&gt;&lt;br&gt;\n            &lt;/div&gt;\n            &lt;div&gt;&lt;br&gt;\n            &lt;/div&gt;\n            &lt;div&gt;&lt;a moz-do-not-send=&quot;true&quot; rel=&quot;nofollow&quot;\n                target=&quot;_blank&quot;\n                href=&quot;http://eplex.cs.ucf.edu/papers/lehman_ab13.pdf&quot;&gt;http://eplex.cs.ucf.edu/papers/lehman_ab\n\n                13.pdf&lt;/a&gt;&lt;br&gt;\n            &lt;/div&gt;\n            &lt;div&gt;&lt;br&gt;\n            &lt;/div&gt;\n            &lt;div&gt;This idea is often used also if a novelty objective is\n              being combined with other objectives in NEAT.  It is\n              important to note that novelty (which is calculated over\n              behavior) is different from genetic diversity (which is\n              calculated through NEAT-style genotypic differences based\n              on historical markings).  So usually when we&#39;ve done\n              multiobjective optimization with novelty as an objective\n              we&#39;ve also included genetic diversity, as in the first\n              paper above.  &lt;/div&gt;\n            &lt;div&gt;&lt;br&gt;\n            &lt;/div&gt;\n            &lt;div&gt;Josh also mentions that he uses the NEAT compatibility\n              metric to do the genetic diversity, and that&#39;s a useful\n              point to highlight:  you can still use historical markings\n              and compute genotypic distances as in the original NEAT,\n              even in a multiobjective framework.  In fact, it is\n              important to do that - any other way of measuring\n              diversity is likely to have unintended consequences (like\n              simply rewarding being bigger, which is n ot the intent).&lt;/div&gt;\n            &lt;div&gt;&lt;br&gt;\n            &lt;/div&gt;\n            &lt;div&gt;Although this advice and the precedent for it sounds\n              simple enough, it&#39;s important to note that the right way\n              to go about multiobjectivizing NEAT is still not a settled\n              issue.  The genetic diversity objective is easy enough to\n              include, but it is *not* equivalent to NEAT-style\n              speciation, and in some domains there may be a cost to\n              that.  This subtlety is not widely recognized and not\n              published but we have unpublished evidence that a genetic\n              diversity objective can actually be damaging whereas\n              NEAT-style speciation may not be (if one is swapped with\n              the other and all else remains equal).  The reason is that\n              an objective that rewards genetic diversity rewards\n              genomes that are completely useless yet crazy, pushing up\n              bloat (an important side effect) and wasting evaluations\n              on junk.  This problem arises because it is extremely easy\n              to dominate on genetic diversity simply by adding more\n              genetic bloat - and dominating on one objective is enough\n              to get offspring allocated in a multiobjective setting.\n               In regular NEAT-style speciation, on the other hand,\n              genetic diversity merely *adjusts* fitness, which means\n              that being completely horrible tempers the advantage of\n              being genetically unique.  This difference is a real\n              concern as people (including our own group) swap one for\n              the other as if they are equivalent.&lt;/div&gt;\n            &lt;div&gt;&lt;br&gt;\n            &lt;/div&gt;\n            &lt;div&gt;Perhaps an alternative that we should consider is to\n              forego having an explicit genetic diversity objective and\n              instead adjust all the fitness values for all the\n              objectives prior to NSGA-II ranking in the usual way the\n              NEAT-style speciation adjusts fitnesses, and then hand\n              everything back to NSGA-II.  Or something like that.  Like\n              I said, unfortunately there is almost nothing published\n              about these subtleties but unpublished experimental\n              results have me worried that we are replacing NEAT with\n              something not as healthy as NEAT when we go to mult\n              iobjectivize NEAT and think they&#39;re the same thing.  The\n              subject deserves more thought.  It&#39;s worth noting though\n              that for some problems simply adding the genetic diversity\n              objectives works fine enough (which is why people have\n              been using it), so it is obviously a practical option in\n              some cases, but I think it is ultimately flawed.&lt;/div&gt;\n            &lt;div&gt;&lt;br&gt;\n            &lt;/div&gt;\n            &lt;div&gt;On the other hand, there is a strain of thought in the\n              community that you don&#39;t even need genetic diversity\n              anymore now that novelty (i.e. behavioral diversity) has\n              been shown so powerful.  Some believe that the use of such\n              novelty now eclipses the need for genetic diversity.  Once\n              again, for some problems that may be true, but also once\n              again I have seen experimental results in some domains\n              that suggest that genetic diversity is still important,\n              even if you also have novelty, and I believe we would be\n              throwing it away at our long-term peril (especially for\n              runs that are intended to go for v ery many generations).\n               Genetic diversity in my view (and based on experimental\n              results) complements novelty because sometimes a new kind\n              of genotype has the *potential* to do something novel but\n              needs several generations to get there.  Without\n              speciation (or some kind of protection) such a genotype\n              will be lost, and the potential novelty it could have\n              yielded lost with it.&lt;/div&gt;\n            &lt;div&gt;&lt;br&gt;\n            &lt;/div&gt;\n            &lt;div&gt;As you can see, the issues here are more complex than\n              they may initially seem, and there are basically two ways\n              to approach it:  One is just to do what has been done\n              before and not think about it too much.  Another is to\n              really pursue trying to do it the best possible way and\n              think about the subtleties of the particular way genetic\n              diversity is interleaved into multiobjective NEAT or\n              HyperNEAT.  Both are legitimate depending on the domain\n              and purpose of the empirical research.&lt;/div&gt;\n            &lt;div&gt;&lt;br&gt;\n            &lt;/div&gt;\n            &lt;div&gt;Best,&lt;/div&gt;\n            &lt;div&gt;&lt;br&gt;\n            &lt;/div&gt;\n            &lt;div&gt;ken&lt;/div&gt;\n            &lt;div&gt;&lt;br&gt;\n            &lt;/div&gt;\n          &lt;/div&gt;\n          \n      \n      &lt;!-- end group email --&gt;\n    &lt;/blockquote&gt;\n    &lt;br&gt;\n  &lt;/body&gt;\n&lt;/html&gt;\n\r\n--------------010507040201050602000908--\r\n\n"}}