{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[{"name":"READ"}]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"userId":464818732,"authorName":"Jeff Clune","from":"Jeff Clune &lt;jclune@...&gt;","profile":"jeffreyclune","replyTo":"LIST","senderId":"4G3XDy2gMYRpPnsTTxd-BJkezj_JXf_N1k2jfwaASC8Sq46YmTojber36wXT8vWvpk7zD4ilni9SQd2mmf4yJXIPX14","spamInfo":{"isSpam":false,"reason":"0"},"subject":"New Paper: Innovation Engines -","postDate":"1432484784","msgId":6492,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDYwRUIzNDcxLTIzQzYtNDVENS1CQ0Y5LTlGM0YxQkNBQTFBQkBnbWFpbC5jb20+"},"prevInTopic":0,"nextInTopic":0,"prevInTime":6491,"nextInTime":6493,"topicId":6492,"numMessagesInTopic":1,"msgSnippet":"Hello all, I am pleased to announce a new paper written by Anh Nguyen, Jason Yosinski, and myself. It attempts to algorithmically recreate the explosion of","rawEmail":"Return-Path: &lt;jclune@...&gt;\r\nX-Sender: jclune@...\r\nX-Apparently-To: neat@yahoogroups.com\r\nX-Received: (qmail 6689 invoked by uid 102); 24 May 2015 16:26:28 -0000\r\nX-Received: from unknown (HELO mtaq5.grp.bf1.yahoo.com) (10.193.84.36)\n  by m7.grp.bf1.yahoo.com with SMTP; 24 May 2015 16:26:28 -0000\r\nX-Received: (qmail 8005 invoked from network); 24 May 2015 16:26:28 -0000\r\nX-Received: from unknown (HELO mail-ig0-f173.google.com) (98.139.170.167)\n  by mtaq5.grp.bf1.yahoo.com with SMTP; 24 May 2015 16:26:28 -0000\r\nX-Received: by igbyr2 with SMTP id yr2so22148774igb.0\n        for &lt;neat@yahoogroups.com&gt;; Sun, 24 May 2015 09:26:27 -0700 (PDT)\r\nX-Received: by 10.107.151.75 with SMTP id z72mr23682521iod.46.1432484787678;\n        Sun, 24 May 2015 09:26:27 -0700 (PDT)\r\nX-Original-Return-Path: &lt;jclune@...&gt;\r\nX-Received: from [192.168.2.135] ([38.75.208.14])\n        by mx.google.com with ESMTPSA id g12sm6688594ioe.28.2015.05.24.09.26.25\n        (version=TLSv1 cipher=ECDHE-RSA-RC4-SHA bits=128/128);\n        Sun, 24 May 2015 09:26:26 -0700 (PDT)\r\nContent-Type: multipart/alternative; boundary=&quot;Apple-Mail=_C5BF18FC-C1C2-49FC-82E4-329DA13C2683&quot;\r\nDate: Sun, 24 May 2015 10:26:24 -0600\r\nMessage-Id: &lt;60EB3471-23C6-45D5-BCF9-9F3F1BCAA1AB@...&gt;\r\nCc: Anh Nguyen &lt;anh.ng8@...&gt;,\n Jason Yosinski &lt;jason@...&gt;\r\nTo: neat users group group &lt;neat@yahoogroups.com&gt;\r\nMime-Version: 1.0 (Mac OS X Mail 8.2 &#92;(2098&#92;))\r\nX-Mailer: Apple Mail (2.2098)\r\nSubject: New Paper: Innovation Engines -\r\nX-Yahoo-Group-Post: member; u=464818732; y=nnipHRs94V8rwjW3rJ4rzIwK_Qcgpl7msXwOXbHRf59AJJhHuQG4\r\nX-Yahoo-Profile: jeffreyclune\r\nFrom: Jeff Clune &lt;jclune@...&gt;\r\n\r\n\r\n--Apple-Mail=_C5BF18FC-C1C2-49FC-82E4-329DA13C2683\r\nContent-Transfer-Encoding: quoted-printable\r\nContent-Type: text/plain;\n\tcharset=utf-8\r\n\r\nHello all,\n\nI am pleased to announce a new paper written by Anh Nguyen, Jas=\r\non Yosinski, and myself. It attempts to algorithmically recreate the explos=\r\nion of creative diversity that occurred on Picbreeder and EndlessForms, wit=\r\nh the ultimate aim of helping us move towards open-ended evolution (i.e. ev=\r\nolutionary processes that endlessly innovate to produce a diversity of high=\r\n-quality solutions). A key component is using Deep Learning to evaluate nov=\r\nelty in a meaningful, low-dimensional space, because novelty search and oth=\r\ner behavioral-diversity promoting techniques cannot work in high-dimensiona=\r\nl spaces.\nNguyen A, Yosinski J, Clune J (2015) Innovation Engines: Automate=\r\nd Creativity and Improved Stochastic Optimization via Deep Learning. &lt;http:=\r\n//www.evolvingai.org/InnovationEngine&gt;Proceedings of the Genetic and Evolut=\r\nionary Computation Conference. (pdf &lt;http://www.evolvingai.org/files/Innova=\r\ntionEngine_gecco15.pdf&gt;)\nIf you do not have time to read the paper, you may=\r\n enjoy browsing the figures to see all the amazing CPPN pictures that were =\r\nevolved without a human in the loop. We have an even larger selection here:=\r\n http://www.evolvingai.org/innovationEngine &lt;http://www.evolvingai.org/inno=\r\nvationEngine&gt;\n\nWe think it is particularly interesting that we can evolve t=\r\nhese images without a crowd of humans given the fascinating paper by Woolle=\r\ny and Stanley that argues that doing so is not possible if you specifically=\r\n try to evolve any individual type of picture. While our results and theirs=\r\n seem contradictory, we find them compatible because we think the =E2=80=9C=\r\nInnovation Engine=E2=80=9D described in our paper captures what made the cr=\r\nowd of humans so effective: (1) having a vast number of objectives simultan=\r\neously, (2) measuring performance and diversity in an abstract, high-level,=\r\n low-dimensional space, and (3) being willing to =E2=80=9Cgoal switch=E2=80=\r\n=9D, i.e. head toward a new objective whenever near it. Innovation Engines,=\r\n like Picbreeder and EndlessForms, thus =E2=80=9Ccollect interesting steppi=\r\nng stones in every direction.&quot;\n\nI want to highlight one result that I think=\r\n will be particularly interesting to this group: the paper suggests that ha=\r\nving a vast number of objectives can be as good as searching for novelty al=\r\none.  Actually, it can be better, because it includes a pressure for qualit=\r\ny (e.g performance). In other words, perhaps the problem with objectives th=\r\nat Ken, Joel, et al. have done a wonderful job elucidating is not really a =\r\nproblem with objectives, but a problem with having only one (or a few) obje=\r\nctives. If you think of Ken and Joel=E2=80=99s =E2=80=9Chard maze=E2=80=9D,=\r\n it=E2=80=99s clear that the one single objective poisons the search for th=\r\ne goal. But imagine if there were 20 objectives in that maze (go to the top=\r\n-right corner, go to the bottom-right corner, etc.). In that case it, is cl=\r\near that you would get exploration and eventually find the goal. If perform=\r\nance is defined as speed to the objective, you may thus end up with a more =\r\nefficient (high-performing) behavior that reaches the goal. So, maybe what =\r\nmakes natural evolution produce so much diversity is not a pressure for nov=\r\nelty alone (even with a minimal criteria), but instead the existence of mil=\r\nlions of niches, where there is still an arms race to be the best at each o=\r\nf those objectives, but where the fact that there are so many, and thus the=\r\n possibility of goal switching, fuels the production of things that are bot=\r\nh diverse and high-performing. Figure 9 in the paper shows that goal-switch=\r\ning is essential to reach complex objectives, precisely because the path to=\r\n any complex objective (as Ken and Joel et al have pointed out), is *not* t=\r\no increasingly resemble/perform well on that objective. Instead, the path c=\r\nan be quite circuitous, but if you collect interesting stepping stones in a=\r\nny direction, you may eventually find yourself one step away from something=\r\n complex that you otherwise would never have found by trying to head straig=\r\nht for it. \n\nWe are very excited about the ideas in this paper, and we woul=\r\nd really enjoy hearing what you think about them! Please let us know if you=\r\n have any comments, questions, objections, etc. \n\nABSTRACT The Achilles Hee=\r\nl of stochastic optimization algorithms is getting trapped on local optima.=\r\n Novelty Search avoids this problem by encouraging a search in all interest=\r\ning directions. That occurs by replacing a performance objective with a rew=\r\nard for novel behaviors, as defined by a human-crafted, and often simple, b=\r\nehavioral distance function. While Novelty Search is a major conceptual bre=\r\nakthrough and outperforms traditional stochastic optimization on certain pr=\r\noblems, it is not clear how to apply it to challenging, high-dimensional pr=\r\noblems where specifying a useful behavioral distance function is difficult.=\r\n For example, in the space of images, how do you encourage novelty to produ=\r\nce hawks and heroes instead of endless pixel static? Here we propose a new =\r\nalgorithm, the Innovation Engine, that builds on Novelty Search by replacin=\r\ng the human-crafted behavioral distance with a Deep Neural Network (DNN) th=\r\nat can recognize interesting differences between phenotypes. The key insigh=\r\nt is that DNNs can recognize similarities and differences between phenotype=\r\ns at an abstract level, wherein novelty means interesting novelty. For exam=\r\nple, a novelty pressure in image space does not explore in the low-level pi=\r\nxel space, but instead creates a pressure to create new types of images (e.=\r\ng. churches, mosques, obelisks, etc.). Here we describe the long-term visio=\r\nn for the Innovation Engine algorithm, which involves many technical challe=\r\nnges that remain to be solved. We then implement a simplified version of th=\r\ne algorithm that enables us to explore some of the algorithm=E2=80=99s key =\r\nmotivations. Our initial results, in the domain of images, suggest that Inn=\r\novation Engines could ultimately automate the production of endless streams=\r\n of interesting solutions in any domain: e.g. producing intelligent softwar=\r\ne, robot controllers, optimized physical components, and art.\n\n\nBest regard=\r\ns,\nJeff Clune\n\nAssistant Professor, Computer Science\nDirector, Evolving Art=\r\nificial Intelligence Lab &lt;http://evolvingai.org/&gt;\nUniversity of Wyoming\njef=\r\nfclune@...\njeffclune.com\n\n\r\n--Apple-Mail=_C5BF18FC-C1C2-49FC-82E4-329DA13C2683\r\nContent-Transfer-Encoding: quoted-printable\r\nContent-Type: text/html;\n\tcharset=utf-8\r\n\r\n&lt;html&gt;&lt;head&gt;&lt;meta http-equiv=3D&quot;Content-Type&quot; content=3D&quot;text/html charset=\r\n=3Dutf-8&quot;&gt;&lt;/head&gt;&lt;body style=3D&quot;word-wrap: break-word; -webkit-nbsp-mode: s=\r\npace; -webkit-line-break: after-white-space;&quot; class=3D&quot;&quot;&gt;&lt;div class=3D&quot;&quot;&gt;He=\r\nllo all,&lt;/div&gt;&lt;div class=3D&quot;&quot;&gt;&lt;br class=3D&quot;&quot;&gt;&lt;/div&gt;&lt;div class=3D&quot;&quot;&gt;I am ple=\r\nased to announce a new paper written by Anh Nguyen, Jason Yosinski, and mys=\r\nelf. It attempts to algorithmically recreate the explosion of creative dive=\r\nrsity that occurred on Picbreeder and EndlessForms, with the ultimate aim o=\r\nf helping us move towards open-ended evolution (i.e. evolutionary processes=\r\n that endlessly innovate to produce a diversity of high-quality solutions).=\r\n A key component is using Deep Learning to evaluate novelty in a meaningful=\r\n, low-dimensional space, because novelty search and other behavioral-divers=\r\nity promoting techniques cannot work in high-dimensional spaces.&lt;/div&gt;&lt;div =\r\nclass=3D&quot;&quot;&gt;&lt;ul style=3D&quot;margin: 1em 0px; padding: 0px 0px 0.25em 2.5em; col=\r\nor: rgb(59, 59, 59); font-family: Arial, Helvetica, sans-serif; font-size: =\r\n15.3999996185303px; line-height: 23.1000003814697px; widows: 1; background-=\r\ncolor: rgb(255, 255, 255);&quot; class=3D&quot;&quot;&gt;&lt;li class=3D&quot;views-row-2 views-row v=\r\niews-row-even&quot; style=3D&quot;margin: 0px; padding: 0.2em 0.5em 0px 0px;&quot;&gt;&lt;span c=\r\nlass=3D&quot;views-field views-field-field-author&quot;&gt;&lt;span class=3D&quot;field-content&quot;=\r\n&gt;Nguyen A, Yosinski J, Clune J&lt;/span&gt;&nbsp;&lt;/span&gt;&lt;span class=3D&quot;views-fiel=\r\nd views-field-field-year&quot;&gt;&lt;span class=3D&quot;field-content&quot;&gt;(2015)&lt;/span&gt;&nbsp;=\r\n&lt;/span&gt;&lt;span class=3D&quot;views-field views-field-title&quot;&gt;&lt;span class=3D&quot;field-c=\r\nontent&quot;&gt;&lt;a href=3D&quot;http://www.evolvingai.org/InnovationEngine&quot; style=3D&quot;tex=\r\nt-decoration: none; color: rgb(48, 74, 167);&quot; class=3D&quot;&quot;&gt;Innovation Engines=\r\n: Automated Creativity and Improved Stochastic Optimization via Deep Learni=\r\nng.&lt;/a&gt;&lt;/span&gt;&lt;/span&gt;&lt;span class=3D&quot;views-field views-field-field-bib&quot;&gt;&lt;spa=\r\nn class=3D&quot;field-content&quot;&gt;Proceedings of the Genetic and Evolutionary Compu=\r\ntation Conference.&lt;/span&gt;&nbsp;&lt;/span&gt;&lt;span class=3D&quot;views-field views-fiel=\r\nd-field-pdf&quot;&gt;(&lt;a href=3D&quot;http://www.evolvingai.org/files/InnovationEngine_g=\r\necco15.pdf&quot; target=3D&quot;_blank&quot; style=3D&quot;text-decoration: none; color: rgb(48=\r\n, 74, 167);&quot; class=3D&quot;&quot;&gt;pdf&lt;/a&gt;)&lt;/span&gt;&lt;/li&gt;&lt;/ul&gt;&lt;/div&gt;&lt;div class=3D&quot;&quot;&gt;If y=\r\nou do not have time to read the paper, you may enjoy browsing the figures t=\r\no see all the amazing CPPN pictures that were evolved without a human in th=\r\ne loop. We have an even larger selection here:&nbsp;&lt;a href=3D&quot;http://www.e=\r\nvolvingai.org/innovationEngine&quot; class=3D&quot;&quot;&gt;http://www.evolvingai.org/innova=\r\ntionEngine&lt;/a&gt;&lt;/div&gt;&lt;div class=3D&quot;&quot;&gt;&lt;br class=3D&quot;&quot;&gt;&lt;/div&gt;&lt;div class=3D&quot;&quot;&gt;We=\r\n think it is particularly interesting that we can evolve these images witho=\r\nut a crowd of humans given the fascinating paper by Woolley and Stanley tha=\r\nt argues that doing so is not possible if you specifically try to evolve an=\r\ny individual type of picture. While our results and theirs seem contradicto=\r\nry, we find them compatible because we think the =E2=80=9CInnovation Engine=\r\n=E2=80=9D described in our paper captures what made the crowd of humans so =\r\neffective: (1) having a vast number of objectives simultaneously, (2) measu=\r\nring performance and diversity in an abstract, high-level, low-dimensional =\r\nspace, and (3) being willing to =E2=80=9Cgoal switch=E2=80=9D, i.e. head to=\r\nward a new objective whenever near it. Innovation Engines, like Picbreeder =\r\nand EndlessForms, thus =E2=80=9Ccollect &lt;i class=3D&quot;&quot;&gt;interesting&lt;/i&gt; stepp=\r\ning stones in every direction.&quot;&lt;/div&gt;&lt;div class=3D&quot;&quot;&gt;&lt;br class=3D&quot;&quot;&gt;&lt;/div&gt;&lt;=\r\ndiv class=3D&quot;&quot;&gt;I want to highlight one result that I think will be particul=\r\narly interesting to this group: the paper suggests that having a vast numbe=\r\nr of objectives can be as good as searching for novelty alone. &nbsp;Actual=\r\nly, it can be better, because it includes a pressure for quality (e.g perfo=\r\nrmance). In other words, perhaps the problem with objectives that Ken, Joel=\r\n, et al. have done a wonderful job elucidating is not really a problem with=\r\n objectives, but a problem with having only one (or a few) objectives. If y=\r\nou think of Ken and Joel=E2=80=99s =E2=80=9Chard maze=E2=80=9D, it=E2=80=99=\r\ns clear that the one single objective poisons the search for the goal. But =\r\nimagine if there were 20 objectives in that maze (go to the top-right corne=\r\nr, go to the bottom-right corner, etc.). In that case it, is clear that you=\r\n would get exploration and eventually find the goal. If performance is defi=\r\nned as speed to the objective, you may thus end up with a more efficient (h=\r\nigh-performing) behavior that reaches the goal. So, maybe what makes natura=\r\nl evolution produce so much diversity is not a pressure for novelty alone (=\r\neven with a minimal criteria), but instead the existence of millions of nic=\r\nhes, where there is still an arms race to be the best at each of those obje=\r\nctives, but where the fact that there are so many, and thus the possibility=\r\n of goal switching, fuels the production of things that are both diverse an=\r\nd high-performing. Figure 9 in the paper shows that goal-switching is essen=\r\ntial to reach complex objectives, precisely because the path to any complex=\r\n objective (as Ken and Joel et al have pointed out), is *not* to increasing=\r\nly resemble/perform well on that objective. Instead, the path can be quite =\r\ncircuitous, but if you collect interesting stepping stones in any direction=\r\n, you may eventually find yourself one step away from something complex tha=\r\nt you otherwise would never have found by trying to head straight for it.&n=\r\nbsp;&lt;/div&gt;&lt;div class=3D&quot;&quot;&gt;&lt;br class=3D&quot;&quot;&gt;&lt;/div&gt;&lt;div class=3D&quot;&quot;&gt;We are very =\r\nexcited about the ideas in this paper, and we would really enjoy hearing wh=\r\nat you think about them! Please let us know if you have any comments, quest=\r\nions, objections, etc.&nbsp;&lt;/div&gt;&lt;div class=3D&quot;&quot;&gt;&lt;br class=3D&quot;&quot;&gt;&lt;/div&gt;&lt;div=\r\n class=3D&quot;&quot;&gt;ABSTRACT The Achilles Heel of stochastic optimization algorithm=\r\ns is getting trapped on local optima. Novelty Search avoids this problem by=\r\n encouraging a search in all interesting directions. That occurs by replaci=\r\nng a performance objective with a reward for novel behaviors, as&nbsp;defin=\r\ned by a human-crafted, and often simple, behavioral distance function. Whil=\r\ne Novelty Search is a major conceptual breakthrough and outperforms traditi=\r\nonal stochastic optimization on certain problems, it is not clear how to ap=\r\nply it to challenging, high-dimensional problems where&nbsp;specifying a us=\r\neful behavioral distance function is difficult. For example, in the space o=\r\nf images, how do you encourage novelty to produce hawks and heroes instead =\r\nof endless pixel static? Here we propose a new algorithm, the Innovation En=\r\ngine, that builds on Novelty Search by&nbsp;replacing the human-crafted beh=\r\navioral distance with a Deep Neural Network (DNN) that can recognize intere=\r\nsting differences between phenotypes. The key insight is that DNNs can reco=\r\ngnize similarities and differences between phenotypes at an abstract level,=\r\n wherein novelty means&nbsp;interesting novelty. For example, a novelty pre=\r\nssure in image space does not explore in the low-level pixel space, but ins=\r\ntead creates a pressure to create new types of images (e.g. churches, mosqu=\r\nes, obelisks, etc.). Here we describe the long-term vision for the Innovati=\r\non Engine&nbsp;algorithm, which involves many technical challenges that rem=\r\nain to be solved. We then implement a simplified version of the algorithm t=\r\nhat enables us to explore some of the algorithm=E2=80=99s key motivations. =\r\nOur initial results, in the domain of images, suggest that Innovation Engin=\r\nes could&nbsp;ultimately automate the production of endless streams of inte=\r\nresting solutions in any domain: e.g. producing intelligent software, robot=\r\n controllers, optimized physical components, and art.&lt;/div&gt;&lt;div class=3D&quot;&quot;&gt;=\r\n&lt;br class=3D&quot;&quot;&gt;&lt;/div&gt;&lt;div apple-content-edited=3D&quot;true&quot; class=3D&quot;&quot;&gt;&lt;div sty=\r\nle=3D&quot;color: rgb(0, 0, 0); letter-spacing: normal; orphans: auto; text-alig=\r\nn: start; text-indent: 0px; text-transform: none; white-space: normal; wido=\r\nws: auto; word-spacing: 0px; -webkit-text-stroke-width: 0px; word-wrap: bre=\r\nak-word; -webkit-nbsp-mode: space; -webkit-line-break: after-white-space;&quot; =\r\nclass=3D&quot;&quot;&gt;&lt;div style=3D&quot;color: rgb(0, 0, 0); letter-spacing: normal; orpha=\r\nns: auto; text-align: start; text-indent: 0px; text-transform: none; white-=\r\nspace: normal; widows: auto; word-spacing: 0px; -webkit-text-stroke-width: =\r\n0px; word-wrap: break-word; -webkit-nbsp-mode: space; -webkit-line-break: a=\r\nfter-white-space;&quot; class=3D&quot;&quot;&gt;&lt;div style=3D&quot;font-style: normal; font-varian=\r\nt: normal; font-weight: normal; letter-spacing: normal; line-height: normal=\r\n; orphans: 2; text-align: -webkit-auto; text-indent: 0px; text-transform: n=\r\none; white-space: normal; widows: 2; word-spacing: 0px; -webkit-text-stroke=\r\n-width: 0px; word-wrap: break-word; -webkit-nbsp-mode: space; -webkit-line-=\r\nbreak: after-white-space; font-family: Times; color: rgb(0, 0, 0);&quot; class=\r\n=3D&quot;&quot;&gt;&lt;span style=3D&quot;font-family: Times; color: rgb(0, 0, 0);&quot; class=3D&quot;&quot;&gt;&lt;=\r\ndiv style=3D&quot;color: rgb(0, 0, 0); font-family: Times; font-style: normal; f=\r\nont-variant: normal; font-weight: normal; letter-spacing: normal; line-heig=\r\nht: normal; orphans: 2; text-align: -webkit-auto; text-indent: 0px; text-tr=\r\nansform: none; white-space: normal; widows: 2; word-spacing: 0px; -webkit-t=\r\next-stroke-width: 0px; word-wrap: break-word; -webkit-nbsp-mode: space; -we=\r\nbkit-line-break: after-white-space;&quot; class=3D&quot;&quot;&gt;&lt;span style=3D&quot;font-family:=\r\n Times; color: rgb(0, 0, 0);&quot; class=3D&quot;&quot;&gt;&lt;div style=3D&quot;color: rgb(0, 0, 0);=\r\n font-family: Times; font-style: normal; font-variant: normal; font-weight:=\r\n normal; letter-spacing: normal; line-height: normal; orphans: 2; text-alig=\r\nn: -webkit-auto; text-indent: 0px; text-transform: none; white-space: norma=\r\nl; widows: 2; word-spacing: 0px; -webkit-text-stroke-width: 0px; word-wrap:=\r\n break-word; -webkit-nbsp-mode: space; -webkit-line-break: after-white-spac=\r\ne;&quot; class=3D&quot;&quot;&gt;&lt;span style=3D&quot;font-family: Times; color: rgb(0, 0, 0);&quot; cla=\r\nss=3D&quot;&quot;&gt;&lt;div style=3D&quot;color: rgb(0, 0, 0); font-family: Times; font-style: =\r\nnormal; font-variant: normal; font-weight: normal; letter-spacing: normal; =\r\nline-height: normal; orphans: 2; text-align: -webkit-auto; text-indent: 0px=\r\n; text-transform: none; white-space: normal; widows: 2; word-spacing: 0px; =\r\n-webkit-text-stroke-width: 0px; word-wrap: break-word; -webkit-nbsp-mode: s=\r\npace; -webkit-line-break: after-white-space;&quot; class=3D&quot;&quot;&gt;&lt;div style=3D&quot;colo=\r\nr: rgb(0, 0, 0); font-family: Times; font-style: normal; font-variant: norm=\r\nal; font-weight: normal; letter-spacing: normal; line-height: normal; orpha=\r\nns: 2; text-align: -webkit-auto; text-indent: 0px; text-transform: none; wh=\r\nite-space: normal; widows: 2; word-spacing: 0px; -webkit-text-stroke-width:=\r\n 0px; word-wrap: break-word; -webkit-nbsp-mode: space; -webkit-line-break: =\r\nafter-white-space;&quot; class=3D&quot;&quot;&gt;&lt;span style=3D&quot;font-family: Times; color: rg=\r\nb(0, 0, 0);&quot; class=3D&quot;&quot;&gt;&lt;div style=3D&quot;color: rgb(0, 0, 0); font-family: Tim=\r\nes; font-style: normal; font-variant: normal; font-weight: normal; letter-s=\r\npacing: normal; line-height: normal; orphans: 2; text-align: -webkit-auto; =\r\ntext-indent: 0px; text-transform: none; white-space: normal; widows: 2; wor=\r\nd-spacing: 0px; -webkit-text-stroke-width: 0px; word-wrap: break-word; -web=\r\nkit-nbsp-mode: space; -webkit-line-break: after-white-space;&quot; class=3D&quot;&quot;&gt;&lt;s=\r\npan style=3D&quot;font-family: Times; color: rgb(0, 0, 0);&quot; class=3D&quot;&quot;&gt;&lt;div styl=\r\ne=3D&quot;color: rgb(0, 0, 0); font-family: Times; font-style: normal; font-vari=\r\nant: normal; font-weight: normal; letter-spacing: normal; line-height: norm=\r\nal; orphans: 2; text-align: -webkit-auto; text-indent: 0px; text-transform:=\r\n none; white-space: normal; widows: 2; word-spacing: 0px; -webkit-text-stro=\r\nke-width: 0px; word-wrap: break-word; -webkit-nbsp-mode: space; -webkit-lin=\r\ne-break: after-white-space;&quot; class=3D&quot;&quot;&gt;&lt;span style=3D&quot;font-family: Times; =\r\ncolor: rgb(0, 0, 0);&quot; class=3D&quot;&quot;&gt;&lt;div style=3D&quot;color: rgb(0, 0, 0); font-fa=\r\nmily: Times; font-style: normal; font-variant: normal; font-weight: normal;=\r\n letter-spacing: normal; line-height: normal; orphans: 2; text-align: -webk=\r\nit-auto; text-indent: 0px; text-transform: none; white-space: normal; widow=\r\ns: 2; word-spacing: 0px; -webkit-text-stroke-width: 0px; word-wrap: break-w=\r\nord; -webkit-nbsp-mode: space; -webkit-line-break: after-white-space;&quot; clas=\r\ns=3D&quot;&quot;&gt;&lt;span style=3D&quot;font-family: Times; color: rgb(0, 0, 0);&quot; class=3D&quot;&quot;&gt;=\r\n&lt;div style=3D&quot;color: rgb(0, 0, 0); font-family: Times; font-style: normal; =\r\nfont-variant: normal; font-weight: normal; letter-spacing: normal; line-hei=\r\nght: normal; orphans: 2; text-align: -webkit-auto; text-indent: 0px; text-t=\r\nransform: none; white-space: normal; widows: 2; word-spacing: 0px; -webkit-=\r\ntext-stroke-width: 0px; word-wrap: break-word; -webkit-nbsp-mode: space; -w=\r\nebkit-line-break: after-white-space;&quot; class=3D&quot;&quot;&gt;&lt;span style=3D&quot;font-family=\r\n: Times; color: rgb(0, 0, 0);&quot; class=3D&quot;&quot;&gt;&lt;div style=3D&quot;color: rgb(0, 0, 0)=\r\n; font-family: Times; font-style: normal; font-variant: normal; font-weight=\r\n: normal; letter-spacing: normal; line-height: normal; orphans: 2; text-ali=\r\ngn: -webkit-auto; text-indent: 0px; text-transform: none; white-space: norm=\r\nal; widows: 2; word-spacing: 0px; -webkit-text-stroke-width: 0px; word-wrap=\r\n: break-word; -webkit-nbsp-mode: space; -webkit-line-break: after-white-spa=\r\nce;&quot; class=3D&quot;&quot;&gt;&lt;div style=3D&quot;color: rgb(0, 0, 0); font-family: Times; font=\r\n-style: normal; font-variant: normal; font-weight: normal; letter-spacing: =\r\nnormal; line-height: normal; orphans: 2; text-align: -webkit-auto; text-ind=\r\nent: 0px; text-transform: none; white-space: normal; widows: 2; word-spacin=\r\ng: 0px; -webkit-text-stroke-width: 0px; word-wrap: break-word; -webkit-nbsp=\r\n-mode: space; -webkit-line-break: after-white-space;&quot; class=3D&quot;&quot;&gt;&lt;div style=\r\n=3D&quot;color: rgb(0, 0, 0); font-family: Times; font-style: normal; font-varia=\r\nnt: normal; font-weight: normal; letter-spacing: normal; line-height: norma=\r\nl; orphans: 2; text-align: -webkit-auto; text-indent: 0px; text-transform: =\r\nnone; white-space: normal; widows: 2; word-spacing: 0px; -webkit-text-strok=\r\ne-width: 0px; word-wrap: break-word; -webkit-nbsp-mode: space; -webkit-line=\r\n-break: after-white-space;&quot; class=3D&quot;&quot;&gt;&lt;span class=3D&quot;Apple-style-span&quot; sty=\r\nle=3D&quot;border-collapse: separate; border-spacing: 0px;&quot;&gt;&lt;div style=3D&quot;word-w=\r\nrap: break-word; -webkit-nbsp-mode: space; -webkit-line-break: after-white-=\r\nspace;&quot; class=3D&quot;&quot;&gt;&lt;span class=3D&quot;Apple-style-span&quot; style=3D&quot;border-collaps=\r\ne: separate; color: rgb(0, 0, 0); font-family: Times; font-style: normal; f=\r\nont-variant: normal; font-weight: normal; letter-spacing: normal; line-heig=\r\nht: normal; orphans: 2; text-align: -webkit-auto; text-indent: 0px; text-tr=\r\nansform: none; white-space: normal; widows: 2; word-spacing: 0px; border-sp=\r\nacing: 0px; -webkit-text-decorations-in-effect: none; -webkit-text-stroke-w=\r\nidth: 0px;&quot;&gt;&lt;div style=3D&quot;word-wrap: break-word; -webkit-nbsp-mode: space; =\r\n-webkit-line-break: after-white-space;&quot; class=3D&quot;&quot;&gt;&lt;span class=3D&quot;Apple-sty=\r\nle-span&quot; style=3D&quot;border-collapse: separate; color: rgb(0, 0, 0); font-vari=\r\nant: normal; letter-spacing: normal; line-height: normal; orphans: 2; text-=\r\nalign: -webkit-auto; text-indent: 0px; text-transform: none; white-space: n=\r\normal; widows: 2; word-spacing: 0px; border-spacing: 0px; -webkit-text-deco=\r\nrations-in-effect: none; -webkit-text-stroke-width: 0px;&quot;&gt;&lt;div style=3D&quot;wor=\r\nd-wrap: break-word; -webkit-nbsp-mode: space; -webkit-line-break: after-whi=\r\nte-space;&quot; class=3D&quot;&quot;&gt;&lt;span class=3D&quot;Apple-style-span&quot; style=3D&quot;border-coll=\r\napse: separate; color: rgb(0, 0, 0); font-variant: normal; letter-spacing: =\r\nnormal; line-height: normal; orphans: 2; text-align: -webkit-auto; text-ind=\r\nent: 0px; text-transform: none; white-space: normal; widows: 2; word-spacin=\r\ng: 0px; border-spacing: 0px; -webkit-text-decorations-in-effect: none; -web=\r\nkit-text-stroke-width: 0px;&quot;&gt;&lt;div style=3D&quot;font-size: 14px; word-wrap: brea=\r\nk-word; -webkit-nbsp-mode: space; -webkit-line-break: after-white-space;&quot; c=\r\nlass=3D&quot;&quot;&gt;&lt;br class=3D&quot;&quot;&gt;&lt;/div&gt;&lt;div style=3D&quot;font-weight: normal; font-styl=\r\ne: normal; word-wrap: break-word; -webkit-nbsp-mode: space; -webkit-line-br=\r\neak: after-white-space;&quot; class=3D&quot;&quot;&gt;Best regards,&lt;br class=3D&quot;&quot;&gt;&lt;font class=\r\n=3D&quot;Apple-style-span&quot; color=3D&quot;#0a5d19&quot;&gt;&lt;b class=3D&quot;&quot;&gt;Jeff Clune&lt;/b&gt;&lt;/font&gt;=\r\n&lt;br class=3D&quot;&quot;&gt;&lt;br class=3D&quot;&quot;&gt;Assistant Professor,&nbsp;Computer Science&lt;/d=\r\niv&gt;&lt;div style=3D&quot;font-weight: normal; font-style: normal; word-wrap: break-=\r\nword; -webkit-nbsp-mode: space; -webkit-line-break: after-white-space;&quot; cla=\r\nss=3D&quot;&quot;&gt;Director,&nbsp;&lt;a href=3D&quot;http://EvolvingAI.org&quot; style=3D&quot;text-alig=\r\nn: -webkit-auto;&quot; class=3D&quot;&quot;&gt;Evolving Artificial Intelligence Lab&lt;/a&gt;&lt;/div&gt;=\r\n&lt;div style=3D&quot;font-weight: normal; font-style: normal; word-wrap: break-wor=\r\nd; -webkit-nbsp-mode: space; -webkit-line-break: after-white-space;&quot; class=\r\n=3D&quot;&quot;&gt;University of Wyoming&lt;br class=3D&quot;&quot;&gt;&lt;a href=3D&quot;mailto:jeffclune@uwyo.=\r\nedu&quot; class=3D&quot;&quot;&gt;jeffclune@...&lt;/a&gt;&lt;br class=3D&quot;&quot;&gt;jeffclune.com&lt;/div&gt;&lt;/s=\r\npan&gt;&lt;/div&gt;&lt;/span&gt;&lt;/div&gt;&lt;/span&gt;&lt;/div&gt;&lt;/span&gt;&lt;/div&gt;&lt;/div&gt;&lt;/div&gt;&lt;/span&gt;&lt;/div&gt;&lt;=\r\n/span&gt;&lt;/div&gt;&lt;/span&gt;&lt;/div&gt;&lt;/span&gt;&lt;/div&gt;&lt;/span&gt;&lt;/div&gt;&lt;/div&gt;&lt;/span&gt;&lt;/div&gt;&lt;/spa=\r\nn&gt;&lt;/div&gt;&lt;/span&gt;&lt;/div&gt;&lt;/div&gt;&lt;/div&gt;\n&lt;/div&gt;\n\n&lt;br class=3D&quot;&quot;&gt;&lt;/body&gt;&lt;/html&gt;\r\n--Apple-Mail=_C5BF18FC-C1C2-49FC-82E4-329DA13C2683--\r\n\n"}}