{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[{"name":"READ"}]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"userId":127853030,"authorName":"Colin Green","from":"Colin Green &lt;cgreen@...&gt;","profile":"alienseedpod","replyTo":"LIST","senderId":"-yt28gurFyKM0LVewkGZxdTBWE8xWt9EtFXiPo8oBI-HY0BIrwgyDMYVepfI0Z-TAHzfXVfBQMcRuAB0su3NQZxi1vs13a0f4w","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Further Introduction","postDate":"1063845205","msgId":82,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDNGNjhGRDU1LjIwMzA4MDZAZHNsLnBpcGV4LmNvbT4="},"prevInTopic":0,"nextInTopic":85,"prevInTime":81,"nextInTime":83,"topicId":82,"numMessagesInTopic":20,"msgSnippet":"Hi again, as a follow on from my last message I would like to explain a bit more about what I am doing here and some other ideas that I have. Some history. I","rawEmail":"Return-Path: &lt;cgreen@...&gt;\r\nX-Sender: cgreen@...\r\nX-Apparently-To: neat@yahoogroups.com\r\nReceived: (qmail 21443 invoked from network); 18 Sep 2003 00:33:21 -0000\r\nReceived: from unknown (66.218.66.167)\n  by m15.grp.scd.yahoo.com with QMQP; 18 Sep 2003 00:33:21 -0000\r\nReceived: from unknown (HELO shockwave.systems.pipex.net) (62.241.160.9)\n  by mta6.grp.scd.yahoo.com with SMTP; 18 Sep 2003 00:33:21 -0000\r\nReceived: from dsl.pipex.com (81-86-175-101.dsl.pipex.com [81.86.175.101])\n\tby shockwave.systems.pipex.net (Postfix) with ESMTP id E7DB21C001E0\n\tfor &lt;neat@yahoogroups.com&gt;; Thu, 18 Sep 2003 01:33:19 +0100 (BST)\r\nMessage-ID: &lt;3F68FD55.2030806@...&gt;\r\nDate: Thu, 18 Sep 2003 01:33:25 +0100\r\nUser-Agent: Mozilla/5.0 (Windows; U; Windows NT 5.1; en-US; rv:1.0.0) Gecko/20020530\r\nX-Accept-Language: en-us, en\r\nMIME-Version: 1.0\r\nTo: neat@yahoogroups.com\r\nSubject: Further Introduction\r\nContent-Type: text/plain; charset=us-ascii; format=flowed\r\nContent-Transfer-Encoding: 7bit\r\nFrom: Colin Green &lt;cgreen@...&gt;\r\nReply-To: cgreen@...\r\nX-Yahoo-Group-Post: member; u=127853030\r\nX-Yahoo-Profile: alienseedpod\r\n\r\nHi again, as a follow on from my last message I would like to explain a \nbit more about what I am doing here and some other ideas that I have.\n\nSome history. I originally got involved in Evolutionary Computing about \n10 years ago. I looked into using EC to find/build timetables for, say, \nschools and universities. At the time others had already looked at this \ndomain but had tended to implement searches for very specific types of \nproblem. Every time a different type of timetable was looked at (e.g. an \nexam timetable versus a day-to-day one) then a new genome representation \nwas devised. I was also frustrated by the use of string based genomes by \nalmost all the representations I came across, which basically meant that \n90% of mutations and crossovers where totally meaningless.\n\nI just thought why not build a general genome that can represent all of \nthe problems and why not use a genome that is structured so that I can \ndevise more meaningful genetic opeatos.  Now as it happens it didn&#39;t \nwork well enough to be useful, largely due to my inexperience in writing \nrobust code at the time. At the same time I was studying Neural Nets for \na couple of hours a week and I wondered if anyone had tried combining \nNN&#39;s and EC.  Well obviously quite a few people had.\n\nCut to 1996 where I picked up the idea again and wrote an Neuro \nEvolution (NE) system. As an outline this is how it worked...\n\n1) A tree based genome. This helps in a few different ways. When \ncrossover occurs we only swap nodes that are co-located on both parents. \nIt also allows us to implement a &#39;reference&#39; node (more later). And it \nallow us to mutate the genome by not only mutating data within a node, \nbut by copying, deleting and moving branches of the tree around. By \nrelating nodes in a tree and branchies of the tree I thought I would \nfacilitate more intelligent, meaningful manipualtion of the genome.\n\n2) Each node either represents a neuron or a reference. Neurons have a \nposition, which is relative to the parent node. They also have a list of \n(incoming) connections. Each connection has a length (thus giving a \nposition to connect to, relative to the neuron&#39;s position) and a \nweight. The networks evolved thus have fixed weights. Also note that \nconnections connect to the nearest neuron, therefore the connection \nlength does not have to be precise, or even anywhere near a neuron.  \nWhere a neuron is a child of a reference node there is a highly \nconvoluted technique whereby I  evolving a connection point onto the \nparent tree. In theory this allows re-used parts of the tree to be \nextended further (variation on reused genes). In hindsight it is a very \npoor implementation.\n\n3) Reference nodes. A node on the tree that cause traversal to jump to \nsome other specified point. The reference itself is just a list of \nnumbers, each number is basically a list of child indexes specifying a \npath to the referenced node through the tree starting from the root \nnode. Later I also implemented relative references where a child index \nof -1 means to traverse back up the tree one node. Reference nodes allow \nfor the possibility of re-use and therefore aid in evolving complexity.\n\nI tried the system on the prey capture problem, but it performed poorly. \nSolving 4, 0.0 (a prey with 4 initial moves, but no speed).\n\n\nI recently picked up the project again and ported/rewrote it in C#. The \ngenome has been completely re-written and has a few more tricks but is \nessentially the same concept. This time I was able to solve prey capture \nproperly. I had realised that the original failure was primarily caused \nby a poor inability to search different connection combinations between \nneurons due to poorly implemented genetic operators.\n\nFollowing all of this I came across NEAT and have read a few recent \npapers from the Computer Science department at  the university of Texas \nwhich have give me a lot of ideas. Particularly interesting is the \nspeciation mechanism used by NEAT.  I recon I can implement this on my \nown NE system by comparing the structure of my tree based genomes and \ngenerating a compatibilty figure similair to the one Ken has used. \nMeanwhile I will be getting a feel for just how efficient NEAT is at \nsolving problems and looking for new test problems I can use.\n\n\n\nColin.\n\n\n\n"}}