{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[{"name":"READ"}]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"userId":127853030,"authorName":"Colin Green","from":"Colin Green &lt;cgreen@...&gt;","profile":"alienseedpod","replyTo":"LIST","senderId":"IBqiAXSsyOdELmdD4MzCMzEeQI2MuttPYP6SWf_3SQBKQ5Rlm5FWUPfTIECBkaXSEjb7c4nrn4zc0WPqEWRtm8pqgrd5ubljVg","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [neat] Re: Further Introduction","postDate":"1064005921","msgId":86,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDNGNkI3MTIxLjIwNTA2MDlAZHNsLnBpcGV4LmNvbT4=","referencesHeader":"PGJrZDNhZSs0Ym8yQGVHcm91cHMuY29tPg=="},"prevInTopic":85,"nextInTopic":87,"prevInTime":85,"nextInTime":87,"topicId":82,"numMessagesInTopic":20,"msgSnippet":"... Hi Ken, well I don t do anything clever. My tree structure is N-ary and therefore a node s location can be specified by a list of numbers, each of which","rawEmail":"Return-Path: &lt;cgreen@...&gt;\r\nX-Sender: cgreen@...\r\nX-Apparently-To: neat@yahoogroups.com\r\nReceived: (qmail 93839 invoked from network); 19 Sep 2003 21:12:02 -0000\r\nReceived: from unknown (66.218.66.166)\n  by m1.grp.scd.yahoo.com with QMQP; 19 Sep 2003 21:12:02 -0000\r\nReceived: from unknown (HELO colossus.systems.pipex.net) (62.241.160.73)\n  by mta5.grp.scd.yahoo.com with SMTP; 19 Sep 2003 21:12:02 -0000\r\nReceived: from dsl.pipex.com (81-86-175-101.dsl.pipex.com [81.86.175.101])\n\tby colossus.systems.pipex.net (Postfix) with ESMTP id 2BB5D160003CB\n\tfor &lt;neat@yahoogroups.com&gt;; Fri, 19 Sep 2003 22:12:01 +0100 (BST)\r\nMessage-ID: &lt;3F6B7121.2050609@...&gt;\r\nDate: Fri, 19 Sep 2003 22:12:01 +0100\r\nUser-Agent: Mozilla/5.0 (Windows; U; Windows NT 5.1; en-US; rv:1.0.0) Gecko/20020530\r\nX-Accept-Language: en-us, en\r\nMIME-Version: 1.0\r\nTo: neat@yahoogroups.com\r\nSubject: Re: [neat] Re: Further Introduction\r\nReferences: &lt;bkd3ae+4bo2@...&gt;\r\nContent-Type: text/plain; charset=us-ascii; format=flowed\r\nContent-Transfer-Encoding: 7bit\r\nFrom: Colin Green &lt;cgreen@...&gt;\r\nReply-To: cgreen@...\r\nX-Yahoo-Group-Post: member; u=127853030\r\nX-Yahoo-Profile: alienseedpod\r\n\r\nKenneth Stanley wrote:\n\n&gt;--- In neat@yahoogroups.com, Colin Green &lt;cgreen@d...&gt; wrote:\n&gt;\n&gt;  \n&gt;\n&gt;&gt;1) A tree based genome. This helps in a few different ways. When \n&gt;&gt;crossover occurs we only swap nodes that are co-located on both\n&gt;&gt;\n&gt;Hi Colin...what does &quot;co-located&quot; mean if you are looking at two\n&gt;different trees?  Isn&#39;t there still a topology-matching problem\n&gt;with trees?  How do you know which branches match up?\n&gt;  \n&gt;\nHi Ken, well I don&#39;t do anything clever. My tree structure is N-ary and \ntherefore a node&#39;s location can be specified by a list of numbers, each \nof which describes a traversal through the tree starting from the root. \nIf two nodes have the same location path then I say they are co-located. \nIn reality I don&#39;t use these paths I simply traverse both trees in \nparallel. Starting at the root I traverse (depth first, left to right) \nall children that both root nodes have in common, so if tree 1 has ten \nchildren and tree 2 has 5 then I only traverse the first five nodes of \nboth trees. As traversal progresses I store the node pairs in a list, I \ncan then select one or more of these node pairs and perform crossover.\n\nNote that a single croosover could be considered to be analogous to \ntraditional 2 point crossover. That is if we consider the trees \nflattened out and then note which nodes we have crossed over we see that \nthe sub-tree we switched was in the middle of the genome. The three \nspecial cases are switching the root node (sort of pointless) highest \nleftmost/rightmost subtree - which switches the left and right parts of \nthe genome repsectively - analogous to single point crossover.\n\n\n&gt;&gt;of -1 means to traverse back up the tree one node. Reference nodes allow \n&gt;&gt;    \n&gt;&gt;\n&gt;&gt;for the possibility of re-use and therefore aid in evolving complexity.\n&gt;&gt;    \n&gt;&gt;\n&gt;\n&gt;Gruau&#39;s Cellular Encoding (CE) also uses a tree genome and can reuse\n&gt;nodes in the tree.  Have you looked at CE?  I describe it (and give a\n&gt;picture) in our Taxonomy for Artificial Embryogeny paper:\n&gt;\n&gt;http://steam.csres.utexas.edu/nn/pub-view.php?RECORD_KEY(Pubs)=PubID&PubID(Pubs)=121\n&gt;  \n&gt;\nYes I read the paper and it gave me a lot of ideas particularly with \nregards to modifying my own NE program. The cellular encoding described \nby Graua is more indirect than my own, e.g. the genome describes a path \nof development, splitting cells and creating connections at the current \ngrowth point - wherever that may be. I would say tha my genome is sort \nof halfway between that approach and the more &#39;brittle&#39; (as you put it) \ndirect encodings. In my own genome because each neuron&#39;s position is \nrelative the the position of it&#39;s parent neuron it can make sense to \ncopy branches of neurons and re-aatch them elsewhere - the same \nsub-structure of neurons will simply be built at a different location. \nExactly the same occurs with my reference node as the sub-tree that is \nreferred to takes it&#39;s base position as being the position in the tree \ntraversal algorithm&#39;s &#39;current position&#39; variable.\n\n&gt;The references to Gruau&#39;s original papers on CE are also given in that\n&gt;paper.  It might be interesting to see how your ideas are similar to\n&gt;Gruau&#39;s.\n&gt;  \n&gt;\nIndeed. More generally though right now I&#39;m trying to clarify in my head \nwhether a complex development stage has any benefits over and above \nsystems like my own (with some kind indirect encoding)- or whether the \ndevelopment phase seen in biology is purely a necessity of existing and \ntrying to grow in the real, physical world with limited resources to \nhand. Having said that any system with indirect encoding has to go \nthrough some sort of development phase, e.g. in my own system the tree \ntraversal algorithm that decodes the genome, follows the node references \nand builds the neural network is in effect a developmental stage.\n\nAt the same time I can see that a more indirect encoding might possibly \nsupport robustness in a genome encoding (canalization). This is were \nthings get difficult, certainly the relative positioning in my own \nsystem gives us some sort of canalization as does my connection strategy \n(connect to the neuron closest to the end of the connection), but these \nare quite simple techniques and trying to envisage how greater levels of \nindirection would be beneficial is difficult.\n\n\nFor now I&#39;m interested in implementing speciation and seeing what sort \nof impact it has. As in crossover I intend to compare the tree \nstructures in order to generate a compatibility number with which to \ndrive the speciation. This then should create a system very much like \nNEAT but with the ability to complexify - that&#39;s the theory anyhow :-)\n\nColin.\n\n\n\n\n\n\n\n\n"}}