{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[{"name":"READ"}]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"userId":54567749,"authorName":"Kenneth Stanley","from":"&quot;Kenneth Stanley&quot; &lt;kstanley@...&gt;","profile":"kenstanley01","replyTo":"LIST","senderId":"sPpLU94gjBlo-XQVMPIyrTvbqHDadKfbuUs3eed1eM9zCBbcJtpY_b7HA9EWWig-yMy_QaRM8q89QlcWKkBe_P09pb0TsxG6Nf9gIBBoSqpz","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Bloat","postDate":"1085863349","msgId":904,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGM5YXNqbCt0dGluQGVHcm91cHMuY29tPg=="},"prevInTopic":0,"nextInTopic":912,"prevInTime":903,"nextInTime":905,"topicId":904,"numMessagesInTopic":68,"msgSnippet":"I think the bloat discussion between Colin and Derek has been great.  These issues definitely get to some of the fundamentals of NEAT, and it s good to think","rawEmail":"Return-Path: &lt;kstanley@...&gt;\r\nX-Sender: kstanley@...\r\nX-Apparently-To: neat@yahoogroups.com\r\nReceived: (qmail 22708 invoked from network); 29 May 2004 20:42:38 -0000\r\nReceived: from unknown (66.218.66.172)\n  by m19.grp.scd.yahoo.com with QMQP; 29 May 2004 20:42:38 -0000\r\nReceived: from unknown (HELO n9.grp.scd.yahoo.com) (66.218.66.93)\n  by mta4.grp.scd.yahoo.com with SMTP; 29 May 2004 20:42:37 -0000\r\nReceived: from [66.218.67.170] by n9.grp.scd.yahoo.com with NNFMP; 29 May 2004 20:42:29 -0000\r\nDate: Sat, 29 May 2004 20:42:29 -0000\r\nTo: neat@yahoogroups.com\r\nMessage-ID: &lt;c9asjl+ttin@...&gt;\r\nUser-Agent: eGroups-EW/0.82\r\nMIME-Version: 1.0\r\nContent-Type: text/plain; charset=ISO-8859-1\r\nContent-Length: 3719\r\nX-Mailer: Yahoo Groups Message Poster\r\nX-eGroups-Remote-IP: 66.218.66.93\r\nFrom: &quot;Kenneth Stanley&quot; &lt;kstanley@...&gt;\r\nSubject: Bloat\r\nX-Yahoo-Group-Post: member; u=54567749\r\nX-Yahoo-Profile: kenstanley01\r\n\r\nI think the bloat discussion between Colin and Derek has been \ngreat.  These issues definitely get to some of the fundamentals of \nNEAT, and it&#39;s good to think about them.  It&#39;s a credit to Derek and \nPhilip that their paper spawned this discussion.  Ultimately I think \na comparison between &quot;phased&quot; and &quot;blended&quot; runs may be in order, \nbut I thought I&#39;d give my 2 cents.  \n\nColin touched on what I&#39;m about to say a bit but I want to say it \nmore explicitly.    Bloat is a very tricky thing to pin down in \nNEAT.  Sometimes new structure enhances fitness immdiately, in wich \ncase it isn&#39;t bloat, but what about new structure that doesn&#39;t \nchange fitness at all?  Part of the reason for protecting innovation \nis of course to keep such stucture around for a while so it can \noptimize.  But then it&#39;s interesting that we are now discussing how \nbest to cut it out.\n\nThat&#39;s not to say we don&#39;t want to do some pruning, but the question \nis how to measure how useful such pruning is.  In a simple problem, \npruning (i.e. simplifying) rigorously may make sense, since if you \ncut something that would have been useful later, it&#39;s no big deal \nsince it will probably reappear soon enough anyway.  However, in a \nreally hard problem, you *need* structure to accumulate for a while, \nand pruning can undermine that process.\n\nThere is a sense in which &quot;bloat&quot; is an accomplishment, since it \ngets you into higher-dimensional space without a fitness penalty, \nand you may *need* to be in that space ultimately.  To the extent \nthat your &quot;bloated&quot; solution works, you probably couldn&#39;t have \ngotten it to work in that larger space if you&#39;d started in it \ndirectly, but now here you are in a more promising part of that \nspace.  Obviously too much bloat is too much, but how much is too \nmuch?\n\nWe&#39;ve observed runs in complex domains of thousands of generations \nin which fitness doesn&#39;t improve for hundreds of generations and \nthen suddenly moves up, after which it climbs gradually for a while \nand then gets stuck again.  What&#39;s going on in a run like that?  In \na normal GA, that phenomenon would be unlikely to see often, since \nyou&#39;re probably stuck at a local optimum after hundreds of \ngenerations of stagnation, but in NEAT, it is able to build up some \nnew structure slowly (because it requires slowly moving up \ncomplexity through new species and a little luck), and eventually \nthe added structure sufficiently expands the space to do something \nthat&#39;s actually novel, and voila you are no longer on a local \noptimum *even though* you haven&#39;t moved in space.  Instead, you&#39;ve \nadded new dimensions.\n\nIt&#39;s interesting to speculate which methodology, e.g. blended or \nphased, still allows such a dynamic to take place.  Anything that \ntoo aggressively cuts out structure that isn&#39;t immediately adding to \nfunction will undermine this potential.  It even brings up a \nquestion which Derek, Philip, and I have talked about in email, \nwhich is whether the nice results for blended runs also apply in \nvery complex domains.  \n\nI have little doubt that some simplification is a good thing, but I \nthink we need to be cautious about how much we do it and how much \nit&#39;s really helping in the long haul even when it looks nice in the \nshort run.  Protecting innovation is a long-term investment, and \nsimplifying is to some extent short-term instant-gratification.  \nAgain, I&#39;m not saying some degree of blending is bad, just that it&#39;s \na deep issue.  As Derek pointed out, NEAT is meant to incrementally \nevaluate new structure, not add huge gobs of it at once, so there is \nanother side to the argument.  Still, we do see some amazing escapes \nfrom stagnation that are clearly due to the accumulation of \nstructure.\n\nken  \n\n\n"}}