{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[{"name":"READ"}]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"userId":54567749,"authorName":"Kenneth Stanley","from":"&quot;Kenneth Stanley&quot; &lt;kstanley@...&gt;","profile":"kenstanley01","replyTo":"LIST","senderId":"EApmq6ZuH5BHQ8aKENJO4mSmjHNlaqemciiLLDp5Azg01jmYAGzsUs_YA8ESf13ZPVjzYVmCfy_repRDz1rS7pfe4kJ5A1S70KSScH_OHR5M","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: Bloat","postDate":"1086220206","msgId":962,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGM5bHAzZStyOTIxQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDQwQkU1MTk2LjgwMTA1MDJAZHNsLnBpcGV4LmNvbT4="},"prevInTopic":961,"nextInTopic":968,"prevInTime":961,"nextInTime":963,"topicId":904,"numMessagesInTopic":68,"msgSnippet":"Guys one thing worth clarifying is that expressed DNA that does not change the phenotype is not the same as useless appendages hanging around.  What s","rawEmail":"Return-Path: &lt;kstanley@...&gt;\r\nX-Sender: kstanley@...\r\nX-Apparently-To: neat@yahoogroups.com\r\nReceived: (qmail 41540 invoked from network); 2 Jun 2004 23:50:08 -0000\r\nReceived: from unknown (66.218.66.218)\n  by m22.grp.scd.yahoo.com with QMQP; 2 Jun 2004 23:50:08 -0000\r\nReceived: from unknown (HELO n10.grp.scd.yahoo.com) (66.218.66.65)\n  by mta3.grp.scd.yahoo.com with SMTP; 2 Jun 2004 23:50:08 -0000\r\nReceived: from [66.218.67.160] by n10.grp.scd.yahoo.com with NNFMP; 02 Jun 2004 23:50:07 -0000\r\nDate: Wed, 02 Jun 2004 23:50:06 -0000\r\nTo: neat@yahoogroups.com\r\nMessage-ID: &lt;c9lp3e+r921@...&gt;\r\nIn-Reply-To: &lt;40BE5196.8010502@...&gt;\r\nUser-Agent: eGroups-EW/0.82\r\nMIME-Version: 1.0\r\nContent-Type: text/plain; charset=ISO-8859-1\r\nContent-Length: 8250\r\nX-Mailer: Yahoo Groups Message Poster\r\nX-eGroups-Remote-IP: 66.218.66.65\r\nFrom: &quot;Kenneth Stanley&quot; &lt;kstanley@...&gt;\r\nSubject: Re: Bloat\r\nX-Yahoo-Group-Post: member; u=54567749\r\nX-Yahoo-Profile: kenstanley01\r\n\r\nGuys one thing worth clarifying is that expressed DNA that does not \nchange the phenotype is not the same as useless appendages hanging \naround.  What&#39;s interesting about neutral structures in an NN is \nthat, assuming they aren&#39;t just a bunch of 0-weight connections, \nthey perform a function that is either complementary to, redundant \nwith, or amounting to no effect on, the rest of the network.  In \nother words it&#39;s not junk.  Try inserting a few extra neurons in the \nmiddle of your brain and see whether is doesn&#39;t screw you up.  I \nthink it&#39;s an accomplishment to add structure that doesn&#39;t have a \ndeleterious effect.  It&#39;s quite analogous to gene duplication in \nnature, which does exactly the same thing and is credited with some \ngreat accomplishments.  Mathematically, it enters the solution into \na part of new higher-dimensional space which can now be explored \nsafely since it is starting at a robust point, i.e. a point where \nthe extra dimensions have been optimized not to interfere with \nnormal functionality.  In other words, we shouldn&#39;t knock so-\ncalled &quot;redundant&quot; DNA too strongly.\n\nken\n\n--- In neat@yahoogroups.com, Colin Green &lt;cgreen@d...&gt; wrote:\n&gt; Derek James wrote:\n&gt; \n&gt; &gt;On Tue, 01 Jun 2004 22:18:55 +0100, Colin Green &lt;cgreen@d...&gt; \nwrote:\n&gt; &gt;  \n&gt; &gt;\n&gt; &gt;&gt;You&#39;re right that culling stagnant species does often give rise \nto\n&gt; &gt;&gt;&#39;jumps&#39; in a search. \n&gt; &gt;&gt;    \n&gt; &gt;&gt;\n&gt; &gt;\n&gt; &gt;That was just one possible explanation for fitness jumps following\n&gt; &gt;stagnant stretches.  There may be others.\n&gt; &gt;  \n&gt; &gt;\n&gt; Agreed.\n&gt; \n&gt; &gt;&gt;But do you agree that some gradual improvements\n&gt; &gt;&gt;come about by connecting to neurons that were previously not\n&gt; &gt;&gt;contributing to the fitness of a genome. This must be the case \nbecause\n&gt; &gt;&gt;as I said before ALL neurons start out like this. So really the \nquestion\n&gt; &gt;&gt;is not whether redundant structure sometimes gets incorporated, \nbut how\n&gt; &gt;&gt;much redundant structure gets incorporated and participates in \nthe\n&gt; &gt;&gt;search process? \n&gt; &gt;&gt;    \n&gt; &gt;&gt;\n&gt; &gt;\n&gt; &gt;I&#39;m not really sure that is the question.  New connections arise, \nbut\n&gt; &gt;they may be forming new connections to neurons that *were* already\n&gt; &gt;doing something useful.  Not all new topological additions are \nlinking\n&gt; &gt;up redundant structures.\n&gt; &gt;  \n&gt; &gt;\n&gt; I&#39;m still not sure if you&#39;ve grasped my main point here. Ok so \nsometimes \n&gt; a new connection appears and it immediately increases the fitness \nof a \n&gt; genome - good. But whenever a neuron is added it can *never* be \n&gt; immediately beneficial because NEAT adds them in such a way as to \nmake \n&gt; them equivalent to the connection that was split. In order to make \nthat \n&gt; neuron useful a further mutation in a later generation must \nconnect to \n&gt; that neuron. So therefore this neuron is a very minimal type of \n&gt; redundant structure, I can prove that this redundant structure \nsometimes \n&gt; gets incorporated and made useful because I have seen networks \nthat have \n&gt; hidden nodes and these networks are proven to need those hidden \nnodes to \n&gt; do what they do.\n&gt; \n&gt; If we establish this as a fact then we can go on to ask - are \nlarger \n&gt; redundant structures sometimes incorporated and made useful? and \nnot \n&gt; just single neurons?\n&gt; \n&gt; &gt;In biology, as far as I understand, more often than not new \nfeatures\n&gt; &gt;are coopted from features that already served another adaptive \npurpose\n&gt; &gt;(this dynamic is called &quot;exaptation&quot;).  It is widely held that\n&gt; &gt;feathers first evolved for the purposes of insulation, and were \nlater\n&gt; &gt;coopted for flight.  Another hypothesis proposes that legs evolved\n&gt; &gt;from lateral fins used to help fish that foraged near shores, with\n&gt; &gt;dense vegetation and debris, to navigate more easily in such\n&gt; &gt;environments (helping them &quot;semi-walk&quot; through or over dense \naquatic\n&gt; &gt;vegetation and push themselves along the river bottom in shallow\n&gt; &gt;areas).\n&gt; &gt;\n&gt; &gt;  \n&gt; &gt;\n&gt; Ok this really is encroaching on the subjest of indirect \nencodings, \n&gt; which I purposefully put to one side since that&#39;s a whole other \nsubject.\n&gt; \n&gt; &gt;However, you bring up a good point about excess capacity in DNA, \nor\n&gt; &gt;junk DNA.  More below...\n&gt; &gt;\n&gt; &gt;  \n&gt; &gt;\n&gt; &gt;&gt;I don&#39;t think there is really a limit since some small sub-\nstructure\n&gt; &gt;&gt;within a large random network may get connected too and become\n&gt; &gt;&gt;beneficial. I think this must happen in nature to some extent \nsince DNA\n&gt; &gt;&gt;seems so abundant and seems to contain a whole load of junk (not \nproven\n&gt; &gt;&gt;though AFAIK, junk DNA could turn out to have a useful and \ndirect role).\n&gt; &gt;&gt;From that you could conclude that DNA  is cheap to carry around \nand\n&gt; &gt;&gt;therefore nature has not much reason to keep it trimmed to a \nminimum,\n&gt; &gt;&gt;certainly I think I&#39;m right in saying that there are a lot of \ngenes in\n&gt; &gt;&gt;the human genome that are from our ancient history and are \npermanently\n&gt; &gt;&gt;disabled. \n&gt; &gt;&gt;    \n&gt; &gt;&gt;\n&gt; &gt;\n&gt; &gt;Right...and this is a good point.  NEAT already employs this \nconcept\n&gt; &gt;with the notion of disabled connection genes.  But there is a \n*huge*\n&gt; &gt;difference between carrying around a lot of disabled DNA, as \nopposed\n&gt; &gt;to actually expressing all of that DNA in the phenotype.  One is\n&gt; &gt;cheap, as you point out...the other is grossly expensive.\n&gt; &gt;  \n&gt; &gt;\n&gt; Yes I see your point. Expressing all of the junk in the phenotype \nmay \n&gt; work to some extent but it wouldn&#39;t be very efficient. I sort of \ntouched \n&gt; on this in the last post when I mentioned that junk structures \nthat \n&gt; connect to output nodes would drown out any signals from useful \n&gt; structures. This would be like me having, say, loads of extra \nlimbs - \n&gt; the usual four are useful, but start adding extra ones and they \njust get \n&gt; in the way :)\n&gt; \n&gt; &gt;So I could be sold that &quot;junk DNA&quot; might be useful, perhaps \nextremely\n&gt; &gt;so.  But the idea of a lot of neutral or slightly maladaptive\n&gt; &gt;structure expressed in the phenotype, that is just waiting around \nto\n&gt; &gt;become useful?  I&#39;m *highly* skeptical that this is a good idea.\n&gt; &gt;  \n&gt; &gt;\n&gt; Yes I agree with this.\n&gt; \n&gt; [...]\n&gt; \n&gt; &gt;\n&gt; &gt;I think the easiest way to mimic junk DNA from biology is to \nsimply\n&gt; &gt;start with a lot of random genes that are simply not expressed, \nand\n&gt; &gt;allow them to collect up during the run.  Although, do you use\n&gt; &gt;disabled genes to determine compatibility?  If so, this \ncalculation\n&gt; &gt;can be computationally expensive, and if you have extremely large\n&gt; &gt;genomes that you have to compare every generation, that might be \nan\n&gt; &gt;issue.\n&gt; &gt;  \n&gt; &gt;\n&gt; Well my code includes disabled genes in determining compatibility, \nand \n&gt; I&#39;m pretty sure I based this on Ken&#39;s NEAT code/papers. Perhaps \nwhat we \n&gt; need then is some library of structures external to the population \nof \n&gt; genomes. A new mutation could be to randomly insert pieces of \nstructure \n&gt; from this library into a genome. That way you get the as-yet-\nunproven \n&gt; benefit of &#39;junk DNA&#39; without the baggage of having to carry it \naround \n&gt; in the genomes. If a useful &#39;chunk&#39; is found then it then becomes \npart \n&gt; of a genome and subject to propogation through the population \nthrough \n&gt; the normal means of crossover and asexual reproduction.\n&gt; \n&gt; &gt;&gt;Yes that&#39;s right. But that is what evolution is all about. The \nvast\n&gt; &gt;&gt;majority of the time it comes up with useless structures, and \nevery once\n&gt; &gt;&gt;in a while (like every few million years or so) something novel \nis\n&gt; &gt;&gt;found. \n&gt; &gt;&gt;    \n&gt; &gt;&gt;\n&gt; &gt;\n&gt; &gt;Right...but the useless structures are not generally kept \naround.  You\n&gt; &gt;don&#39;t see organisms with lots of useless organs or appendages just\n&gt; &gt;waiting to become useful.\n&gt; &gt;  \n&gt; &gt;\n&gt; Well that&#39;s not entirely true. If the useless appendages hinder \nthe \n&gt; organism or require a significant resources to grow and/or \nmaintain then \n&gt; individuals with these characteristics will be selected against \nover \n&gt; time. But if the appendages aren&#39;t too expensive and aren&#39;t \ngetting in \n&gt; the way then they can indeed stick around. One that comes to mind \nis the \n&gt; human appendix, and I&#39;ve never found my little toe to be all that \n&gt; useful. Well Ok you did say &#39;generally&#39; - these &#39;extras&#39; are \nmostly \n&gt; special cases. I agree with the general priniciple that organisms \ndon&#39;t \n&gt; carry around loads of  appendages in the hope that one might \nbecome \n&gt; useful, like some biological equivalent of a swiss army knife :)\n&gt; \n&gt; Colin.\n\n\n"}}